main.floors.MT0=
{
    "floorId": "MT0",
    "title": "提亚之森",
    "name": "提亚之森",
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "defaultGround": "ground",
    "images": [
        {
            "name": "moon.png",
            "canvas": "bg",
            "x": 0,
            "y": 0,
            "sx": 0,
            "sy": 0,
            "w": 480,
            "h": 448
        }
    ],
    "ratio": 1,
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,140,140,140,140,140,140,140,335,140,140,140,140,140,140],
    [20085,20086,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [340,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [340,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [340,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "firstArrive": [
        {
            "type": "confirm",
            "text": "要跳过开场剧情吗？",
            "yes": [
                {
                    "type": "setHeroOpacity",
                    "opacity": 1,
                    "time": 0
                },
                {
                    "type": "setText",
                    "background": "winskin.png",
                    "time": 34
                }
            ],
            "no": [
                {
                    "type": "loadBgm",
                    "name": "fightstart.mp3"
                },
                {
                    "type": "setValue",
                    "name": "switch:A",
                    "value": "false"
                },
                {
                    "type": "sleep",
                    "time": 1000
                },
                {
                    "type": "setViewport",
                    "loc": [
                        8,
                        21
                    ],
                    "time": 5000
                },
                {
                    "type": "changePos",
                    "loc": [
                        15,
                        21
                    ],
                    "direction": "left"
                },
                {
                    "type": "setHeroOpacity",
                    "opacity": 1,
                    "time": 0
                },
                {
                    "type": "moveHero",
                    "time": 500,
                    "steps": [
                        "left:4"
                    ]
                },
                {
                    "type": "setText",
                    "background": "winskin.png",
                    "time": 34
                },
                {
                    "type": "if",
                    "condition": "switch:A",
                    "true": [],
                    "false": [
                        "\t[hero]\b[hero]肚子好饿啊……不知道附近有没有什么村落。",
                        "\t[hero]\b[hero]白面包也好，黑面包也好，当然有肉最好。",
                        "\t[hero]\b[hero]再不吃点什么，我可能就要彻底失去理智了。",
                        "\t[hero]\b[hero]如果我成了魔物……哈哈，那这个世界还有什么勇者能击败我呢？",
                        "\t[hero]\b[hero]为了守护世界的和平……神啊，快让我饱餐一顿吧。"
                    ]
                },
                {
                    "type": "moveHero",
                    "time": 500,
                    "steps": [
                        "left:3"
                    ]
                },
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": [
                        8,
                        21
                    ]
                },
                {
                    "type": "if",
                    "condition": "switch:A",
                    "true": [],
                    "false": [
                        "\t[hero]\b[hero]出来吧，我知道你在里面。",
                        "\t[hero]\b[hero]大晚上的，鬼鬼祟祟地做什么？可别让我请你出来。",
                        "\t[hero]\b[hero]否则……我都不敢想会发生什么事情。"
                    ]
                },
                {
                    "type": "changePos",
                    "direction": "up"
                },
                "\t[hero]\b[hero]好好考虑下？",
                {
                    "type": "playSound",
                    "name": "grass.mp3",
                    "sync": true
                },
                {
                    "type": "move",
                    "loc": [
                        8,
                        18
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "down:2"
                    ]
                },
                {
                    "type": "if",
                    "condition": "switch:A",
                    "true": [],
                    "false": [
                        "\t[hero]\b[hero]哎呀？原来是位小姐，失礼失礼。",
                        "\t[米娅,N335]\b[this,8,20]……那个",
                        "\t[米娅,N335]\b[this,8,20]先生，现在这里很危险，到处都是魔物。",
                        "\t[米娅,N335]\b[this,8,20]我劝您还是和我一起先躲一阵子吧？",
                        "\t[hero]\b[hero]魔物？我好像一路上都没怎么见到。",
                        "\t[米娅,N335]\b[this,8,20]您没见到吗？",
                        "\t[hero]\b[hero]这么看……你是被魔物追赶，才躲在这里的？",
                        "\t[米娅,N335]\b[this,8,20]是的……我没想到晚上居然会出现这么多魔物，以前明明没有的。",
                        "\t[米娅,N335]\b[this,8,20]还好我及时躲起来了，没被它们发现。",
                        "\t[hero]\b[hero]有魔物……就说明附近有魔塔。",
                        "\t[hero]\b[hero]而有魔塔就说明附近有居民。",
                        "\t[hero]\b[hero]小姐，你就住在这片地方吧？",
                        "\t[米娅,N335]\b[this,8,20]是的……我就住在这里的提亚村。",
                        "\t[hero]\b[hero]我可以护送你到村子里，不过代价是为我提供一顿满意的晚餐。",
                        "\t[hero]\b[hero]怎么样？",
                        "\t[米娅,N335]\b[this,8,20]您是勇者！？",
                        "\t[hero]\b[hero]……额，如果单纯指能与魔物战斗这方面的话，其实大差不差啦。",
                        "\t[hero]\b[hero]其实我是漂泊者。",
                        "\t[米娅,N335]\b[this,8,20]漂泊者？"
                    ]
                },
                {
                    "type": "playBgm",
                    "name": "fightstart.mp3",
                    "keep": true
                },
                {
                    "type": "changePos",
                    "direction": "left"
                },
                "\t[hero]\b[hero]退到我身后！",
                "\t[米娅,N335]\b[this,8,20]诶！？",
                {
                    "type": "move",
                    "loc": [
                        8,
                        20
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "right:1",
                        "down:1"
                    ]
                },
                {
                    "type": "turnBlock",
                    "direction": "left",
                    "loc": [
                        [
                            9,
                            21
                        ]
                    ]
                },
                {
                    "type": "move",
                    "loc": [
                        0,
                        21
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "right:3"
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "E339",
                    "loc": [
                        [
                            3,
                            21
                        ]
                    ],
                    "time": 1
                },
                {
                    "type": "move",
                    "loc": [
                        0,
                        22
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "right:2"
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "E339",
                    "loc": [
                        [
                            2,
                            22
                        ]
                    ],
                    "time": 1
                },
                {
                    "type": "move",
                    "loc": [
                        0,
                        20
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "right:2"
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "E339",
                    "loc": [
                        [
                            2,
                            20
                        ]
                    ],
                    "time": 1
                },
                "\t[hero]\b[hero]撞上大奖了呀。",
                "\t[hero]\b[hero]噬牙兽……完全没有理智，只存在攻击欲望的低等犬型魔物……是我最讨厌的类型呀。",
                "\t[米娅,N335]\b[this,8,20]小心！",
                {
                    "type": "setBlock",
                    "number": "E340",
                    "loc": [
                        [
                            3,
                            21
                        ]
                    ],
                    "time": 1
                },
                {
                    "type": "jump",
                    "from": [
                        3,
                        21
                    ],
                    "dxy": [
                        4,
                        0
                    ],
                    "time": 150,
                    "keep": true
                },
                {
                    "type": "animate",
                    "name": "jianji2",
                    "loc": [
                        7,
                        21
                    ]
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            7,
                            21
                        ]
                    ],
                    "remove": true,
                    "time": 100
                },
                "\t[hero]\b[hero]啧……别吓到小姑娘呀……你这蠢狗。",
                {
                    "type": "jump",
                    "from": [
                        2,
                        22
                    ],
                    "to": [
                        8,
                        21
                    ],
                    "time": 250,
                    "keep": true,
                    "async": true
                },
                {
                    "type": "move",
                    "loc": [
                        9,
                        21
                    ],
                    "time": 125,
                    "keep": true,
                    "async": true,
                    "steps": [
                        "backward:2"
                    ]
                },
                {
                    "type": "changePos",
                    "direction": "down"
                },
                {
                    "type": "moveHero",
                    "time": 200,
                    "steps": [
                        "backward:1"
                    ]
                },
                {
                    "type": "waitAsync"
                },
                {
                    "type": "animate",
                    "name": "jianji2",
                    "loc": [
                        8,
                        21
                    ]
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            21
                        ]
                    ],
                    "remove": true,
                    "time": 100
                },
                {
                    "type": "changePos",
                    "direction": "left"
                },
                {
                    "type": "setBlock",
                    "number": "E340",
                    "loc": [
                        [
                            2,
                            20
                        ]
                    ],
                    "time": 1
                },
                {
                    "type": "jump",
                    "from": [
                        2,
                        20
                    ],
                    "dxy": [
                        6,
                        0
                    ],
                    "time": 250,
                    "keep": true,
                    "async": true
                },
                {
                    "type": "jumpHero",
                    "dxy": [
                        1,
                        0
                    ],
                    "time": 200
                },
                {
                    "type": "waitAsync"
                },
                {
                    "type": "animate",
                    "name": "jianji2",
                    "loc": [
                        8,
                        20
                    ]
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            20
                        ]
                    ],
                    "remove": true,
                    "time": 100,
                    "async": true
                },
                {
                    "type": "setVolume",
                    "value": 0,
                    "time": 3000,
                    "async": true
                },
                "\t[hero]\b[hero]呼……还好我技高一筹。",
                {
                    "type": "moveHero",
                    "time": 400,
                    "steps": [
                        "down:1"
                    ]
                },
                {
                    "type": "changePos",
                    "direction": "right"
                },
                "\t[hero]\b[hero]怎么样？小姐，这下可以信任我了吧？",
                {
                    "type": "move",
                    "loc": [
                        11,
                        21
                    ],
                    "time": 200,
                    "keep": true,
                    "async": true,
                    "steps": [
                        "left:1"
                    ]
                },
                "\t[米娅,N335]\b[this,10,21]那拜托你了！这里从西边那里的十字坡再往南走就到村子了",
                "\t[hero]\b[hero]那么就让我们赶在午夜前回去吧 ",
                "\t[hero]\b[hero]毕竟熬夜对身体不好呢。",
                "\t[hero]\b[hero]当然，饿肚子也是。",
                {
                    "type": "changePos",
                    "direction": "left"
                },
                {
                    "type": "moveHero",
                    "time": 500,
                    "async": true,
                    "steps": [
                        "left:3"
                    ]
                },
                {
                    "type": "move",
                    "loc": [
                        10,
                        21
                    ],
                    "time": 500,
                    "keep": true,
                    "async": true,
                    "steps": [
                        "left:3"
                    ]
                },
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 1000,
                    "keep": true
                },
                {
                    "type": "waitAsync"
                }
            ]
        },
        {
            "type": "follow",
            "name": "my.png"
        },
        {
            "type": "changeFloor",
            "floorId": "MT1",
            "loc": [
                6,
                0
            ],
            "direction": "down"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20000,  0,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,  0,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,  0,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,  0,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140],
    [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "width": 15,
    "height": 23,
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "weather": [
        "fog",
        1
    ],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20077,20078,20077,20078,20077,20078,20077,20078,20182,20077,20078,20077,20078,20077,20078],
    [  0,  0,20085,20086,20085,20086,20085,20086,20092,20085,20086,20085,20086,20085,20086],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "bgm": "dark.ogg"
}