main.floors.MT1=
{
    "floorId": "MT1",
    "title": "提亚之森北部01",
    "name": "提亚之森北部01",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "light.mp3",
    "weather": [
        "fog",
        1
    ],
    "firstArrive": [
        {
            "type": "pauseBgm"
        },
        {
            "type": "loadBgm",
            "name": "light.mp3"
        },
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "down:1"
            ]
        },
        "\t[米娅,N335]\b[hero,1]附近居然出现了这么多的魔物……",
        "\t[hero]\b[hero]这下能不能早点到村子就不好说了。",
        {
            "type": "playBgm",
            "name": "light.mp3",
            "keep": true
        },
        {
            "type": "setValue",
            "name": "flag:ztl",
            "value": "1"
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "function",
            "function": "function(){\ncore.addItem('book', 1)\n}"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,1": [
            "——致来到该世界的初学者（点击鼠标或者按下空格/回车继续）",
            "本游戏使用鼠标或者键盘来进行游玩，可以按下H键了解操作方式，接下来进行玩法的基础讲解。",
            "生命力\\i[hp]是游戏的基础，你的所有行动目的都是为了保持跟你更多的生命力。",
            "与敌人的战斗以回合制进行，每个回合由你先对敌人进行一次攻击，然后敌人如果仍存活则对你反击。",
            "每次攻击时，攻击者会对被攻击者造成攻击力\\i[atk]-防御力\\i[def]点生命削减，优先扣除护盾\\i[mdef]。",
            "以敌人绿史莱姆为例，现在你的攻击力\\i[atk]为5，它的防御力为0，所以一次攻击造成5点伤害。",
            "你要打败它需要攻击50/5=10次，所以在这场战斗中回合数为10，你需要承受9次攻击。",
            "你受到的伤害则等于（它的攻击力8-你的防御力\\i[def]0）*9=72点，伤害数额显示在敌人的左下角。",
            "此外，敌人的特殊属性会影响战斗伤害的计算，可以打开怪物手册对怪物的能力、属性进行具体的查看。",
            "拾取红宝石\\i[I352]提高攻击力\\i[atk]可以降低战斗回合数，让你受攻击的次数减少。敌人左上角的数字就代表离下一次降低回合还需要增加多少点攻击力。",
            "拾取蓝宝石\\i[I353]提高防御力\\i[def]则可以降低每次攻击你受到的伤害，而拾取绿宝石\\i[I354]提升护盾\\i[mdef]，每场战斗都会帮你抵扣掉相当于护盾的数额的伤害。",
            "当你的生命力不够时，拾取血瓶可以恢复你的生命力。恢复效果依次为：红血瓶\\i[redPotion]、蓝血瓶\\i[bluePotion]、黄血瓶\\i[yellowPotion]、绿血瓶\\i[greenPotion]",
            "伤害计算的原理讲完后，我们应当如何制定策略呢？",
            "1.在生命值足够的情况下，优先获取能增加能力的宝石，红宝石增加攻击，蓝宝石增加防御，绿宝石增加护盾。\n2.在获取宝石时，除了宝石本身能提供的价值以外，还要考虑获取需要的代价（敌人数量和强度）\n3.一般来说，当敌人的伤害大于敌人的生命值时，红宝石的效果要强于蓝宝石，反之则蓝宝石的效果更强。\n4.绿宝石的获取优先度在前期要低于红蓝宝石，在你强大之后再获取效果会更好。",
            "最后最后，一定要记得多存档。魔塔的游玩就是一个不断试错优化的过程，存档和读档是优化的唯一途径。而且一旦犯下严重的错误，就会导致游戏完全进行不下去，如果没有存档就只能重新开始，挫败感非常强。（当然低难度一般没有这种情况，而且不断自动读档（A键）最多可以让你回到十步以前，基本能应付大多数情况，但习惯性的存档仍然是一个好习惯）实在不喜欢存档，可以作为代替多使用浏览地图功能来为之后的挑战提前做好应对准备。",
            "接下来请自己尝试吧。"
        ]
    },
    "changeFloor": {
        "11,12": {
            "floorId": "MT2",
            "loc": [
                11,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [140,140,140,140,140,140,  0,140,140,140,140,140,140],
    [140, 31,20015,20049,20050,129,  0,140,140,  0,202,  0,140],
    [140,354,20056,20057,20058,20059,  0,140,140,  0,20031,  0,140],
    [140,352,20064,20065,20066,20067,  0,  0,201,  0,20039,352,140],
    [140,  0,20072,20073,20074,20075,20011,  0,20038,20049,20050, 31,140],
    [140,202,  0,20081,20082,  0,205,  0,20056,20057,20058,20059,140],
    [140,20012,  0,201,  0,  0,20090,  0,20064,20065,20066,20067,140],
    [140,  0,  0,140,140,  0,20098,201,20072,20073,20074,20075,140],
    [140,201,140,140,140,202,20106,  0,20007,20081,20082,353,140],
    [140,  0,140,140,  0,  0, 31,  0,  0,  0,205,  0,140],
    [140,  0,20038,  0,  0,140,140,140,201,20029,20030,  0,140],
    [140,  0,205,  0,140,140,140,140,  0,  0,201,  0,140],
    [140,140,140,140,140,140,140,140,140,140,140, 93,140]
],
    "bgmap": [
    [142,142,142,142,142,142,141,142,142,142,142,142,142],
    [142,141,142,142,142,142,141,142,142,141,141,141,142],
    [142,141,142,142,142,142,141,142,142,141,142,141,142],
    [142,141,142,142,142,142,141,141,141,141,142,141,142],
    [142,141,142,142,142,142,142,141,142,142,142,141,142],
    [142,141,141,142,142,141,141,141,142,142,142,142,142],
    [142,142,141,141,141,141,142,141,142,142,142,142,142],
    [142,141,141,142,142,141,142,141,142,142,142,142,142],
    [142,141,142,142,142,141,142,141,142,142,142,141,142],
    [142,141,142,142,141,141,141,141,141,141,141,141,142],
    [142,141,142,141,141,142,142,142,141,142,142,141,142],
    [142,141,141,141,142,142,142,142,141,141,141,141,142],
    [142,142,142,142,142,142,142,142,142,142,142,141,142]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20080,  0,  0,20083,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,20080,  0,  0,20083,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}