main.floors.MT106=
{
    "floorId": "MT106",
    "title": "熔岩之塔1层",
    "name": "熔岩之塔1层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 0,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "ry.mp3"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[hero]\b[hero]好热……这次居然是熔岩地段……",
        "\t[hero]\b[hero]这个温度……真是难受……",
        "\t[hero]\b[hero]比起之前的森林……这环境简直是折磨。",
        "\t[hero]\b[hero]怀特莉丝！使用冰冻魔法！",
        {
            "type": "setHeroIcon",
            "name": "o.png"
        },
        "\t[怀特莉丝,N430]\b[hero]……",
        "\t[怀特莉丝,N430]\b[hero]我不会。",
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        "\t[hero]\b[hero]什么！？",
        "\t[hero]\b[hero]连伊杰明都办得到……你身为更高位格的魔法师居然不会吗？",
        {
            "type": "setHeroIcon",
            "name": "o.png"
        },
        "\t[怀特莉丝,N430]\b[hero]严格来说，我现在所使用的魔法纯粹是根据本能使出来的。",
        "\t[怀特莉丝,N430]\b[hero]并没有相关的学习知识。",
        "\t[怀特莉丝,N430]\b[hero]或许找回记忆我就能用出其他的魔法了。",
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        "\t[hero]\b[hero]真的假的……",
        "\t[hero]\b[hero]唉……总之速战速决吧！",
        "\t[hero]\b[hero]我可不想在这地方多待。",
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "playBgm",
            "name": "ry.mp3",
            "keep": true
        },
        {
            "type": "setValue",
            "name": "flag:ltf",
            "value": "0"
        },
        "楼传需要在楼梯边的限制解除了。",
        {
            "type": "function",
            "function": "function(){\nflags.__visited__ = { MT1: true, MT2: true, MT3: true, MT4: true, MT5: true, MT6: true, MT7: true, MT8: true, MT9: true, MT10: true, MT11: true, MT12: true, MT13: true, MT14: true, MT15: true, MT16: true, MT28: true, MT29: true, MT106: true }\n}"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {
        "6,2": [
            "\t[hero]\b[hero]这个感觉……",
            "\t[hero]\b[hero]看来对手是个很厉害的剑士啊。",
            {
                "type": "setHeroIcon",
                "name": "o.png"
            },
            "\t[怀特莉丝,N430]\b[hero]哦？",
            "\t[怀特莉丝,N430]\b[hero]我都没有察觉出来，你怎么做到的。",
            {
                "type": "setHeroIcon",
                "name": "hero.png"
            },
            "\t[hero]\b[hero]算是剑士之间的独有的感应吧……",
            "\t[hero]\b[hero]有点期待和他的战斗啊，虽然他应该也和那个精灵一样变成傀儡了……"
        ]
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,150,150, 87,150,150,150,150,150,150],
    [150,150,150,150,150,150,594,150,150,150,150,150,150],
    [150,150,150, 31,596, 83, 31,499,500,501,150,150,150],
    [150,150,150, 33,150,150,150,150,150,150,150,150,150],
    [150,150,150, 33,150,150,150,150,150,150,150,150,150],
    [150,150,150, 31,595, 31,596, 31,596, 31,150,150,150],
    [150,150,150,150,150,150,150,150,150, 33,150,150,150],
    [150,150,150,150,150,150,150,150,150, 33,150,150,150],
    [150,150,150, 23, 23,595,356, 83,595, 31,150,150,150],
    [150,150,150,150,150,150, 33,150,150,150,150,150,150],
    [150,150,150,150,150,150,356,150,150,150,150,150,150],
    [150,150,150,150,150,150,  0,150,150,150,150,150,150]
],
    "bgmap": [
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}