main.floors.MT105=
{
    "floorId": "MT105",
    "title": "不知名酒馆",
    "name": "不知名酒馆",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": -1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "jg.mp3",
            "keep": true
        },
        {
            "type": "loadBgm",
            "name": "bd.mp3"
        },
        {
            "type": "show",
            "loc": [
                [
                    3,
                    12
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                3,
                12
            ],
            "time": 300,
            "keep": true,
            "steps": [
                "up:5",
                "right:1"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    4,
                    7
                ]
            ]
        },
        "\t[莉雅朵洛,N581]\b[this,4,7]来杯你推荐的。",
        "\t[酒保,N557]\b[this,4,5]那你一定不能错过我们的新品！",
        "\t[酒保,N557]\b[this,4,5]拿好了。",
        {
            "type": "move",
            "loc": [
                4,
                7
            ],
            "time": 300,
            "keep": true,
            "steps": [
                "right:1",
                "down:2"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    5,
                    9
                ]
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    9
                ]
            ]
        },
        "\t[酒客a,N585]\b[this,11,5]听说了吗？现在帝国正在四处征集勇者。",
        "\t[酒客b,N561]\b[this,11,4]那是当然，这件事早就闹得沸沸扬扬了吧？",
        "\t[酒客a,N585]\b[this,11,5]啧……似乎很多人都准备应征。",
        "\t[酒客b,N561]\b[this,11,4]你不知道吗？下个月税收就要增加三成了。",
        "\t[酒客b,N561]\b[this,11,4]好像就是为了筹集军费用在这些勇者上。",
        "\t[酒客b,N561]\b[this,11,4]所以很多人直接撂挑子不干，干脆去应征勇者了。",
        "\t[酒客c,N565]\b[this,8,5]唉……再增加三成税收，这不是要了我们的命吗？",
        "\t[酒客c,N565]\b[this,8,5]今天恐怕都是我最后一次喝上酒了。",
        "\t[酒客a,N585]\b[this,11,5]话是这么说……可勇者是要赌上性命的。",
        "\t[酒客b,N561]\b[this,11,4]要么饿死……要么被怪物杀死……这世道真是……",
        "\t[酒客c,N565]\b[this,8,5]最近好像还出现了魔化症……啧啧……要是染上了就没救了。",
        {
            "type": "setBlock",
            "number": "N572",
            "loc": [
                [
                    3,
                    12
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                3,
                12
            ],
            "time": 300,
            "keep": true,
            "steps": [
                "up:5",
                "right:1"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    4,
                    7
                ]
            ]
        },
        "\t[联络人,N569]\b[this,4,7]麻烦来两杯蜂蜜酒，再加一份果盘和黄油面包。",
        {
            "type": "move",
            "loc": [
                4,
                7
            ],
            "time": 300,
            "keep": true,
            "steps": [
                "right:1"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    5,
                    7
                ]
            ]
        },
        "\t[联络人,N569]\b[this,5,7]对精灵族来说，还算合胃口吧？",
        "\t[莉雅朵洛,N581]\b[this,5,9]直接说正事吧。",
        {
            "type": "move",
            "loc": [
                5,
                7
            ],
            "time": 300,
            "keep": true,
            "steps": [
                "right:3",
                "down:2"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    8,
                    9
                ]
            ]
        },
        "\t[联络人,N569]\b[this,8,9]嗯……想必小姐你也知道帝国正在网罗各地的人才投入到魔塔作战中去。",
        "\t[联络人,N569]\b[this,8,9]哎呀……自二十年前突然冒出来的魔塔……起初并没有多重视。",
        "\t[联络人,N569]\b[this,8,9]不少冒险者还以此作为搜猎财富的宝地，结果随着时间的流逝，魔塔变得越来越危险。",
        "\t[联络人,N569]\b[this,8,9]以至于闹到现在全民皆兵的地步。",
        "\t[联络人,N569]\b[this,8,9]据我们估计……不出五年，恐怕整个大地就会遭到一次彻底的洗劫。",
        "\t[莉雅朵洛,N581]\b[this,5,9]你究竟想说什么？",
        "\t[联络人,N569]\b[this,8,9]别着急嘛……为此我们魔塔作战部专门成立了讨伐计划。",
        "\t[联络人,N569]\b[this,8,9]虽然有组织大地各处的有能之士处理周边大大小小的魔塔……但这毕竟还是治标不治本。",
        "\t[联络人,N569]\b[this,8,9]而讨伐计划的核心则是……征集像您这样实力远超一般冒险者的成员，向始祖之塔发起进攻。",
        "\t[莉雅朵洛,N581]\b[this,5,9]始祖之塔？",
        "\t[联络人,N569]\b[this,8,9]根据我们的部门这十几年的调查研究来看……在这些掌管魔塔的塔主之中存在着一批地位更高的塔主。",
        "\t[联络人,N569]\b[this,8,9]而他们被称为始祖，可以说他们就是最初存在的魔塔。",
        "\t[联络人,N569]\b[this,8,9]若是不彻底铲除他们……那么魔塔始终会再次出现。",
        "\t[联络人,N569]\b[this,8,9]当然他们的力量也远超一般的塔主，为此我们才需要征集向您这样的人才。",
        "\t[莉雅朵洛,N581]\b[this,5,9]我只关心报酬……让我看看你们的诚意。",
        "\t[联络人,N569]\b[this,8,9]您还真是和传闻中的精灵族大不相同啊……我听说精灵族都是对金钱观念很淡薄的。",
        "\t[莉雅朵洛,N581]\b[this,5,9]那你既然找上我……应该不会不知道我被逐出妖精森了吧。",
        "\t[联络人,N569]\b[this,8,9]呵呵……这还真是……",
        {
            "type": "pauseBgm"
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        "\t[酒客d,N573]\b[this,12,10]唔……啊啊……",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    8,
                    5
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    11,
                    5
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    11,
                    4
                ]
            ]
        },
        "\t[酒客e,N577]\b[this,9,9]怎……怎么回事！？",
        {
            "type": "playBgm",
            "name": "bd.mp3",
            "keep": true
        },
        {
            "type": "setBlock",
            "number": "zombie",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 100,
            "noSkip": true
        },
        {
            "type": "setBlock",
            "number": "N573",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        "\t[酒客a,N585]\b[this,11,5]看他的身体！好像在发生变化！",
        "\t[酒客b,N561]\b[this,11,4]见鬼！这是魔化症！他……他是漂泊者啊！",
        {
            "type": "move",
            "loc": [
                8,
                5
            ],
            "time": 100,
            "async": true,
            "steps": [
                "down:2",
                "left:5",
                "down:5"
            ]
        },
        {
            "type": "move",
            "loc": [
                11,
                5
            ],
            "time": 100,
            "async": true,
            "steps": [
                "down:2",
                "left:8",
                "down:5"
            ]
        },
        {
            "type": "move",
            "loc": [
                4,
                5
            ],
            "time": 100,
            "async": true,
            "steps": [
                "up:1",
                "left:3",
                "up:3"
            ]
        },
        {
            "type": "move",
            "loc": [
                9,
                9
            ],
            "time": 500,
            "keep": true,
            "async": true,
            "steps": [
                "up:2",
                "left:1"
            ]
        },
        {
            "type": "move",
            "loc": [
                11,
                4
            ],
            "time": 1000,
            "keep": true,
            "async": true,
            "steps": [
                "backward:1"
            ]
        },
        {
            "type": "setBlock",
            "number": "zombie",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 100,
            "noSkip": true
        },
        {
            "type": "setBlock",
            "number": "N573",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500,
            "noSkip": true
        },
        {
            "type": "setBlock",
            "number": "zombie",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 100,
            "noSkip": true
        },
        {
            "type": "setBlock",
            "number": "N573",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500,
            "noSkip": true
        },
        {
            "type": "setBlock",
            "number": "zombie",
            "loc": [
                [
                    12,
                    10
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 200,
            "noSkip": true
        },
        {
            "type": "jump",
            "from": [
                12,
                10
            ],
            "to": [
                7,
                7
            ],
            "time": 100,
            "keep": true
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                8,
                7
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    7
                ]
            ],
            "remove": true
        },
        "\t[酒客b,N561]\b[this,11,3]完蛋了！要死在这了！",
        "\t[酒客b,N561]\b[this,11,3]不……我不想死啊啊啊……",
        {
            "type": "playSound",
            "name": "hj.mp3"
        },
        {
            "type": "sleep",
            "time": 1000,
            "noSkip": true
        },
        "\t[莉雅朵洛,N581]\b[this,5,9]啧……真吵……",
        {
            "type": "animate",
            "name": "skill3",
            "loc": [
                7,
                7
            ]
        },
        {
            "type": "setVolume",
            "value": 0,
            "time": 1500,
            "async": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    7
                ]
            ],
            "remove": true,
            "time": 1500
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "pauseBgm"
        },
        "\t[莉雅朵洛,N581]\b[this,5,9]食欲都被搅没了。",
        "\t[联络人,N569]\b[this,8,9]不愧是禁忌之弓莉雅朵洛……",
        "\t[联络人,N569]\b[this,8,9]每次任务的报酬不会低于五万耀恩……您可满意？",
        "\t[莉雅朵洛,N581]\b[this,5,9]我同意加入你们了。",
        {
            "type": "move",
            "loc": [
                5,
                9
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up:2"
            ]
        },
        "\t[莉雅朵洛,N581]\b[this,5,7]明天就去报道……之前我点了一杯不知道叫什么的酒，你也顺便结了吧。",
        {
            "type": "move",
            "loc": [
                5,
                7
            ],
            "time": 500,
            "keep": true,
            "async": true,
            "steps": [
                "left:2",
                "down:2"
            ]
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1500,
            "keep": true
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "setValue",
            "name": "flag:jl",
            "value": "1"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "changeFloor",
            "floorId": "MT104",
            "loc": [
                6,
                11
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,12": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "6,9": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [143,143,143,143,143,143,143,143,143,143,143,143,143],
    [143,90289,90290,90039,90126,90127,143,143,  0,  0,  0,  0,  0],
    [143,90297,90298,90047,90134,90135,  0,  0,  0,  0,  0,  0,  0],
    [143,90305,90306,90168,90142,90143,90051,  0,  0,90048,90050,  0,90189],
    [143,  0,  0,  0,  0,  0,90052,  0,  0,90056,90058,562,90189],
    [143,90048,90049,90049,557,90049,90060,  0,567,90056,90058,586,90189],
    [143,90064,90065,90065,90065,90065,90068,  0,  0,90064,90066,  0,  0],
    [143,  0,  0,  0,90183,  0,  0,  0,  0,  0,  0,  0,  0],
    [143,  0,  0,  0,90183,  0,90048,90050,  0,  0,90048,90050,  0],
    [143,90169,  0,  0,90183,  0,90108,90058,  0,579,90056,90058,  0],
    [143,90169,  0,  0,90183,  0,90056,90058,  0,  0,90056,90058,574],
    [143,90169,  0,  0,90191,  0,90064,90066,  0,  0,90064,90066,  0],
    [143,143,143,584,143,143,143,143,143,143,143,143,143]
],
    "bgmap": [
    [90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90035,90033,90033,90033,90033,90002,90002,90035,90033,90033,90033,90033],
    [90002,90043,90041,90041,90041,90041,90032,90034,90043,90041,90041,90041,90041],
    [90002,90003,90002,90002,90002,90002,90040,90042,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90039,90186,90039],
    [  0,  0,  0,90160,  0,  0,  0,90184,90183,  0,90047,  0,90047],
    [  0,  0,  0,90161,  0,  0,  0,  0,90191,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90084,  0,  0,  0,90108,  0,  0],
    [  0,90183,90100,90116,90116,90099,  0,  0,  0,90110,90084,  0,  0],
    [  0,90191,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90183,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90094,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90092,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,90055,  0,  0,90055,  0],
    [  0,  0,  0,  0,90049,  0,  0,  0,90055,  0,  0,90055,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90191,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90191,90055,90056,  0,90055,90055,  0,  0,90055],
    [  0,  0,  0,  0,90191,90055,  0,  0,90055,90055,  0,  0,90055],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}