main.floors.MT103=
{
    "floorId": "MT103",
    "title": "森林之塔9层",
    "name": "森林之塔9层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            {
                "type": "setHeroIcon",
                "name": "o.png"
            },
            "\t[怀特莉丝,N430]\b[hero]前面应该就是最后一层了。",
            "\t[怀特莉丝,N430]\b[hero]但是……怎么没有塔主的气息？",
            {
                "type": "setHeroIcon",
                "name": "hero.png"
            },
            "\t[hero]\b[hero]没有塔主？",
            "\t[hero]\b[hero]莫非这其实是类似遗迹的地方？",
            {
                "type": "setHeroIcon",
                "name": "o.png"
            },
            "\t[怀特莉丝,N430]\b[hero]不……这是魔塔的感觉……但没有塔主的感觉……",
            "\t[怀特莉丝,N430]\b[hero]这地方的魔塔还真是邪门……",
            {
                "type": "setHeroIcon",
                "name": "hero.png"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "5,4": [
            {
                "type": "setValue",
                "name": "flag:sl9",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flags.sl9==2)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            3
                        ]
                    }
                ]
            }
        ],
        "7,4": [
            {
                "type": "setValue",
                "name": "flag:sl9",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flags.sl9==2)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            3
                        ]
                    }
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 27,  0, 28, 20, 20, 87, 20, 20,  0, 27,  0, 20],
    [ 20,  0,554,  0, 20, 31,  0, 31, 20, 21,  0, 34, 20],
    [ 20,552, 20,545, 20, 20, 85, 20, 20, 20,551, 20, 20],
    [ 20,  0, 20,  0, 20,550,  0,550, 20, 20, 81, 20, 20],
    [ 20, 81, 20, 82, 20, 20, 81, 20, 20, 29,  0, 32, 20],
    [ 20,  0,  0,  0,549,  0,  0,  0,553,  0,  0, 21, 20],
    [ 20, 20, 20, 20, 20, 81, 20, 81, 20, 20,545, 20, 20],
    [ 20, 21,  0, 20,550,  0, 20,  0,  0, 81,  0, 29, 20],
    [ 20,  0, 33, 20,  0,553, 20,  0,356, 20, 32, 21, 20],
    [ 20, 29,  0,552,  0,  0, 20,549, 20, 20, 20, 20, 20],
    [ 20,  0, 28, 20, 21, 21, 20,  0,  0,549,  0, 88, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305],
    [305,305,305,305,305,305,305,305,305,305,305,305,305]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "sj": 8
}