main.floors.MT116=
{
    "floorId": "MT116",
    "title": "王城内",
    "name": "王城内",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": -1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "wx.mp3",
            "keep": true
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    12
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 250,
            "keep": true,
            "steps": [
                "up:4"
            ]
        },
        "\t[克洛德,N590]\b[this,6,8]呦！你们好啊！",
        "\t[克洛德,N590]\b[this,6,8]看来各位都是应征而来的勇者吧？",
        "\t[莉雅朵洛,N581]\b[this,4,6]……",
        "\t[闻斯莫提,N611]\b[this,6,5]阁下就是斩龙剑克洛德先生吧？",
        "\t[克洛德,N590]\b[this,6,8]哦？我这么有名气了吗？",
        "\t[闻斯莫提,N611]\b[this,6,5]呵呵……阁下的名号最近可是响亮的很啊，我是来自星之学院的闻斯莫提。",
        "\t[闻斯莫提,N611]\b[this,6,5]嗯……这两位是号称禁忌之弓的莉雅朵洛小姐和来自圣殿的佛修斯阁下。",
        "\t[闻斯莫提,N611]\b[this,6,5]……",
        "\t[闻斯莫提,N611]\b[this,6,5]好像二位都不太爱说话啊……哈哈……",
        "\t[闻斯莫提,N611]\b[this,6,5]好歹大家都是要一起作战的战友了。",
        "\t[闻斯莫提,N611]\b[this,6,5]多交流交流也无妨嘛。",
        "\t[莉雅朵洛,N581]\b[this,4,6]对我而言这就是份工作而已……我并不想与什么人有多深的牵扯。",
        "\t[莉雅朵洛,N581]\b[this,4,6]你们只要能保证别拖我后腿就行。",
        "\t[克洛德,N590]\b[this,6,8]喂喂喂！精灵族都这么冷淡的嘛？",
        "\t[佛修斯,N607]\b[this,8,6]……我们不过是冲在前方的身先士卒的炮灰罢了……",
        "\t[佛修斯,N607]\b[this,8,6]啊……人生真是一片黑暗啊……",
        "\t[佛修斯,N607]\b[this,8,6]闻斯莫提先生……真的不需要在下治疗一下你的手臂吗？",
        "\t[佛修斯,N607]\b[this,8,6]看你缠满了绷带的样子……恐怕会影响行动吧……虽然我们的命运依旧灰暗……但至少在死前少受些苦吧……",
        "\t[闻斯莫提,N611]\b[this,6,5]哈哈……其实这些是以前魔法实验留下的旧伤……由于显得比较瘆人……所以干脆用绷带缠上了而已……",
        {
            "type": "setBlock",
            "number": "N618",
            "loc": [
                [
                    6,
                    12
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 250,
            "keep": true,
            "steps": [
                "up:2"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    8
                ]
            ]
        },
        "\t[汉斯,N615]\b[this,6,10]看来人都到齐了。",
        "\t[汉斯,N615]\b[this,6,10]那么我也不说什么废话了。",
        "\t[汉斯,N615]\b[this,6,10]来自妖精之森的禁忌之弓——莉雅朵洛。",
        "\t[莉雅朵洛,N581]\b[this,4,6]……",
        "\t[汉斯,N615]\b[this,6,10]在冒险者中初露头角的斩龙剑——克洛德",
        "\t[克洛德,N590]\b[this,6,8]哈哈哈哈，我还是个普通的冒险者而已。",
        "\t[汉斯,N615]\b[this,6,10]圣殿年轻一辈中杰出的圣职者——佛修斯",
        "\t[佛修斯,N607]\b[this,8,6]哎，我这号人马上就要因任务失败而除名了。",
        "\t[汉斯,N615]\b[this,6,10]星之学院的魔法科首席弟子——闻斯莫提",
        "\t[闻斯莫提,N611]\b[this,6,5]不敢当。",
        "\t[汉斯,N615]\b[this,6,10]每一个都是帝国数一数二的人才。",
        "\t[汉斯,N615]\b[this,6,10]这次召集你们组成讨伐队为的就是……",
        "\t[汉斯,N615]\b[this,6,10]对塔之始祖——惶惑卿进行讨伐。",
        "\t[克洛德,N590]\b[this,6,8]惶惑卿？",
        "\t[克洛德,N590]\b[this,6,8]没听说过啊……",
        "\t[汉斯,N615]\b[this,6,10]目前为止……帝国所得到的情报仅有十一位塔之始祖中的六位。",
        "\t[汉斯,N615]\b[this,6,10]落日、虚妄、灰烬、惶惑、不朽、灾宴……",
        "\t[汉斯,N615]\b[this,6,10]而讨伐成功的……只有落日公一名。",
        "\t[汉斯,N615]\b[this,6,10]付出的代价就是折损了近乎三支部队的兵力……",
        "\t[汉斯,N615]\b[this,6,10]这也让我们明白了……普通战力对于魔塔完全就是微不足道的存在。",
        "\t[汉斯,N615]\b[this,6,10]只有像你们这样拥有远超常人的战斗力的个体组成讨伐队，面对魔塔中那些千奇百怪的法则更有胜算。",
        "\t[汉斯,N615]\b[this,6,10]这次任务结果将决定帝国未来的作战方针。",
        "\t[克洛德,N590]\b[this,6,8]……看来还真是相当艰巨的任务。",
        "\t[汉斯,N615]\b[this,6,10]希望诸位不要让帝国失望啊。",
        {
            "type": "setVolume",
            "value": 0,
            "time": 500,
            "async": true
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "setValue",
            "name": "flag:hs",
            "value": "1"
        },
        {
            "type": "changeFloor",
            "floorId": "MT115",
            "loc": [
                11,
                6
            ],
            "direction": "right"
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.dzw==22)",
            "true": [
                {
                    "type": "hide",
                    "loc": [
                        [
                            4,
                            6
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            6
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            5
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            8
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            10
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "setBlock",
                    "number": "N633",
                    "loc": [
                        [
                            6,
                            3
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N564",
                    "loc": [
                        [
                            4,
                            10
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N568",
                    "loc": [
                        [
                            5,
                            9
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N394",
                    "loc": [
                        [
                            6,
                            10
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N580",
                    "loc": [
                        [
                            7,
                            9
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N588",
                    "loc": [
                        [
                            8,
                            10
                        ]
                    ]
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[恩佐,N633]\b[this,6,3]恭喜你，约瑟，你现在已经是皇家骑士候补了。",
                "\t[路人]\b[this,4,10]天呐……这个年纪成为皇家骑士候补……",
                "\t[路人]\b[this,7,9]这在历史上可都是非常少见的……",
                "\t[路人]\b[this,5,9]太厉害了！",
                "\t[路人]\b[this,8,10]呜呜呜……真是羡慕啊……",
                "\t[hero]\b[hero]那个……老师，有米洛的消息吗？",
                "\t[恩佐,N633]\b[this,6,3]米洛啊……",
                "\t[恩佐,N633]\b[this,6,3]他在上个月，讨伐魔塔的作战中……殉职了……",
                "\t[hero]\b[hero]殉……职？",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                "\t[hero]\b[hero]……",
                "\t[hero]\b[hero]哈……哈哈！",
                "\t[hero]\b[hero]我就说……当什么勇者啊……米洛……",
                "\t[hero]\b[hero]你看你得到了什么！？",
                "\t[hero]\b[hero]就这么凄惨的死去了！你本该和我一样成为皇家骑士！",
                "\t[hero]\b[hero]就为了你那虚无缥缈的正义感？",
                "\t[hero]\b[hero]哈哈……太可笑了……不是吗？",
                {
                    "type": "hide",
                    "loc": [
                        [
                            4,
                            10
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            5,
                            9
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            10
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            7,
                            9
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            10
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "setBlock",
                    "number": "N647",
                    "loc": [
                        [
                            6,
                            3
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N649",
                    "loc": [
                        [
                            8,
                            6
                        ]
                    ]
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[科索莫,N647]\b[this,6,3]约瑟·弗里克，现查出你已感染魔化症。",
                "\t[科索莫,N647]\b[this,6,3]皇家决定剥夺你的皇家骑士身份！并且将你逐出弗里克家族，沦为漂泊者！",
                "\t[hero]\b[hero]开……开玩笑的吧？",
                {
                    "type": "changePos",
                    "direction": "right"
                },
                "\t[hero]\b[hero]父亲！救救我啊！",
                "\t[hero]\b[hero]我不想成为漂泊者啊！",
                "\t[约瑟父亲,N648]\b[this,8,6]……",
                "\t[约瑟父亲,N648]\b[this,8,6]……从今往后……不要再说你是弗里克家族的人。",
                {
                    "type": "move",
                    "loc": [
                        8,
                        6
                    ],
                    "time": 200,
                    "steps": [
                        "down:6"
                    ]
                },
                {
                    "type": "changePos",
                    "direction": "down"
                },
                "\t[hero]\b[hero]父亲！",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT131",
                    "loc": [
                        5,
                        10
                    ],
                    "direction": "up"
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "6,12": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [110033,110033,110033,110033,110033,110067,110068,110069,110033,110033,110033,110033,110033],
    [110041,110041,110041,110041,110041,110075,110076,110077,110041,110041,110041,110041,110041],
    [  0,110086,110165,  0,110167,110079,  0,110079,110167,  0,110165,110087,  0],
    [  0,110094,  0,110078,  0,  0,  0,  0,  0,110078,  0,110095,  0],
    [110156,110086,  0,110078,  0,  0,611,  0,  0,110078,  0,110087,110156],
    [110164,110094,  0,110078,581,  0,  0,  0,607,110078,  0,110095,110164],
    [110100,110086,  0,110078,  0,  0,  0,  0,  0,110078,  0,110087,110100],
    [110100,110094,  0,110078,  0,  0,  0,  0,  0,110078,  0,110095,110100],
    [110158,110158,  0,110159,  0,  0,  0,  0,  0,110159,  0,110158,110158],
    [110166,110166,  0,110167,  0,  0,  0,  0,  0,110167,  0,110166,110166],
    [149,149,149,149,  0,  0,  0,  0,  0,149,149,149,149],
    [149,149,149,149,  0,  0,593,  0,  0,149,149,149,149]
],
    "bgmap": [
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004],
    [110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004,110004]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [110023,  0,110038,110099,110107,  0,  0,  0,110107,110099,110038,  0,110023],
    [110031,  0,110046,  0,110159,110071,  0,110071,110159,  0,110046,  0,110031],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,110033,110033,110033,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,110041,110041,110041,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,155,155,155,155,155,  0,  0,  0,  0],
    [  0,  0,  0,  0,155,155,155,155,155,  0,  0,  0,  0],
    [  0,  0,  0,  0,155,155,155,155,155,  0,  0,  0,  0],
    [  0,  0,  0,  0,155,155,155,155,155,  0,  0,  0,  0],
    [  0,  0,  0,  0,155,155,155,155,155,  0,  0,  0,  0],
    [  0,  0,  0,  0,155,155,155,155,155,  0,  0,  0,  0],
    [  0,  0,  0,  0,155,155,155,155,155,  0,  0,  0,  0],
    [  0,  0,  0,  0,110184,110185,110185,110185,110186,  0,  0,  0,  0],
    [  0,  0,  0,  0,110192,110193,110193,110193,110194,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [110159,  0,110157,  0,  0,  0,  0,  0,  0,  0,110157,  0,110159],
    [110167,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110167],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}