main.floors.MT117=
{
    "floorId": "MT117",
    "title": "冰原之塔1层",
    "name": "冰原之塔1层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 0,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "by.mp3"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[hero]\b[hero]冰原？",
        "\t[hero]\b[hero]比起之前的熔岩，这地方更让我难受啊……",
        "\t[hero]\b[hero]为什么偏偏是个这么糟糕的环境……",
        {
            "type": "setHeroIcon",
            "name": "o.png"
        },
        "\t[怀特莉丝,N430]\b[hero]你很怕冷吗？",
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        "\t[hero]\b[hero]要是你有过差点冻死在雪地里的经历……你也会怕冷的……",
        "\t[hero]\b[hero]哎，先是熔岩后是冰原，真是遭大罪了。",
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "playBgm",
            "name": "by.mp3",
            "keep": true
        },
        {
            "type": "function",
            "function": "function(){\nflags.__visited__ = { MT1: true, MT2: true, MT3: true, MT4: true, MT5: true, MT6: true, MT7: true, MT8: true, MT9: true, MT10: true, MT11: true, MT12: true, MT13: true, MT14: true, MT15: true, MT16: true, MT28: true, MT29: true, MT117: true }\n}"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,12": [
            {
                "type": "if",
                "condition": "flags.cs>=1",
                "true": [],
                "false": [
                    {
                        "type": "setValue",
                        "name": "flag:cs",
                        "value": "0"
                    }
                ]
            },
            "${flags.cs}",
            {
                "type": "setValue",
                "name": "status:atk",
                "operator": "+=",
                "value": "5"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "operator": "+=",
                "value": "5"
            },
            {
                "type": "setValue",
                "name": "status:mdef",
                "operator": "+=",
                "value": "20"
            },
            {
                "type": "setValue",
                "name": "flag:cs",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,6": [
            "\t[hero]\b[hero]嘶……真是……寒意刺骨啊",
            {
                "type": "setHeroIcon",
                "name": "o.png"
            },
            "\t[怀特莉丝,N430]\b[hero]这恐怕不只是寒冷这么简单。",
            {
                "type": "setHeroIcon",
                "name": "herob.png"
            },
            "\t[hero]\b[hero]什么意思？",
            {
                "type": "setHeroIcon",
                "name": "o.png"
            },
            "\t[怀特莉丝,N430]\b[hero]你体内被施加了冰系魔法一类的东西。",
            "\t[怀特莉丝,N430]\b[hero]虽然现在没有体现出效果……但是一旦被引爆，恐怕你的行动能力会受到严重影响。",
            {
                "type": "setHeroIcon",
                "name": "herob.png"
            },
            "\t[hero]\b[hero]附加和引爆的能力分别在不同敌人身上吗……",
            "\t[hero]\b[hero]放心，我想出来战术了。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007],
    [120007, 33, 33, 33, 33,120007, 87,120007, 33, 33, 33, 33,120007],
    [120007,120007, 84,120007,120007,120007,619,120007,120007,120007, 84,120007,120007],
    [120007,120007,500,501,499, 21, 22, 21, 33, 33, 33,120007,120007],
    [120007,120007,120007,120007,120007,120007,620,120007,120007,120007,120007,120007,120007],
    [120007, 11, 11, 11, 24,120007,161,120007, 24, 11, 11, 11,120007],
    [120007, 11,120007,120007,120007,120007,624,120007,120007,120007,120007, 11,120007],
    [120007, 11, 11, 11, 11, 81, 33, 81, 11, 11, 11, 11,120007],
    [120007,120007,120007,120007,120007,120007,620,120007,120007,120007,120007,120007,120007],
    [120007, 11, 11, 11, 11, 81, 33, 81, 11, 11, 11, 11,120007],
    [120007, 11,120007,120007,120007,120007, 33,120007,120007,120007,120007, 11,120007],
    [120007, 11, 11, 11, 24,120007, 33,120007, 24, 11, 11, 11,120007],
    [120007,120007,120007,120007,120007,120007,  0,120007,120007,120007,120007,120007,120007]
],
    "bgmap": [
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}