main.floors.MT128=
{
    "floorId": "MT128",
    "title": "??塔??层",
    "name": "??塔??层",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": -1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[佛修斯,N607]\b[this,6,1]……",
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    5,
                    2
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    7,
                    2
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    6,
                    3
                ]
            ]
        },
        "\t[克洛德,N590]\b[this,6,3]我就说这家伙能撑到这里吧？",
        "\t[莉雅朵洛,N581]\b[this,5,2]没想到你一个圣职者也能跟的上我们……",
        "\t[莉雅朵洛,N581]\b[this,5,2]看来汉斯那家伙找的人确实水平都不差。",
        "\t[佛修斯,N607]\b[this,6,1]唉……不过是早死一会儿或晚死一会儿的区别罢了……",
        "\t[佛修斯,N607]\b[this,6,1]我们的力量在始祖面前终究还是不入流的……",
        "\t[克洛德,N590]\b[this,6,3]哎呀！你这人怎么老是这么悲观啊！？",
        "\t[克洛德,N590]\b[this,6,3]你看现在不是一切都安好吗！？",
        "\t[克洛德,N590]\b[this,6,3]而且凭借我们四人合力……我可想象不出来这个什么惶惑卿能强到那种地步。",
        "\t[莉雅朵洛,N581]\b[this,5,2]放心……若是情况不对……我会立刻撤退的。",
        "\t[莉雅朵洛,N581]\b[this,5,2]我可不准备让自己白白死在这种地方。",
        "\t[克洛德,N590]\b[this,6,3]喂！你的意思是留我们给你殿后吗？",
        "\t[闻斯莫提,N611]\b[this,7,2]……唔……",
        {
            "type": "setBlock",
            "number": "zombie",
            "loc": [
                [
                    7,
                    2
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 100,
            "noSkip": true
        },
        {
            "type": "setBlock",
            "number": "N614",
            "loc": [
                [
                    7,
                    2
                ]
            ]
        },
        "\t[佛修斯,N607]\b[this,6,1]闻斯莫提阁下……你这是……",
        "\t[佛修斯,N607]\b[this,6,1]染上魔化症了吧……",
        "\t[克洛德,N590]\b[this,6,3]什么！？",
        "\t[克洛德,N590]\b[this,6,3]那玩意可是没救的啊！？",
        "\t[莉雅朵洛,N581]\b[this,5,2]……",
        "\t[闻斯莫提,N611]\b[this,7,2]还是被发现了吗……",
        "\t[闻斯莫提,N611]\b[this,7,2]抱歉……各位，我不是有意隐瞒的……",
        "\t[闻斯莫提,N611]\b[this,7,2]其实我这次来就是赴死的……",
        "\t[闻斯莫提,N611]\b[this,7,2]染上魔化症后就没有救治手段了……等待我的也只有死亡……",
        "\t[闻斯莫提,N611]\b[this,7,2]既然这样……不如将我剩余的力量与生命用在这里……才更有意义。",
        "\t[佛修斯,N607]\b[this,6,1]闻斯提莫阁下……您真是大义……",
        "\t[佛修斯,N607]\b[this,6,1]在下佩服。",
        "\t[闻斯莫提,N611]\b[this,7,2]呵呵……佛修斯先生不也虽然嘴上一直抱怨，但还是一直走到了这里么。",
        "\t[克洛德,N590]\b[this,6,3]开什么玩笑！不要放弃！",
        "\t[克洛德,N590]\b[this,6,3]尽管现在没有治疗手段！但不代表就找不到！",
        "\t[克洛德,N590]\b[this,6,3]哪怕只有渺茫的希望！也要咬着牙抓住它！",
        "\t[克洛德,N590]\b[this,6,3]我们都要活着回去！",
        "\t[闻斯莫提,N611]\b[this,7,2]克洛德先生……",
        "\t[克洛德,N590]\b[this,6,3]大家都打起精神来！接下来就是和惶惑卿的决战了！我们要一起回去活着领赏！",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    5,
                    2
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    7,
                    2
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    3
                ]
            ]
        },
        {
            "type": "setValue",
            "name": "flag:byjs",
            "value": "1"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "changeFloor",
            "floorId": "MT126",
            "loc": [
                1,
                6
            ],
            "direction": "left"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  0,607,  0,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,581,  0,611,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,590,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  0,  0,  0,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  0, 87,  0,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  0,  0,  0,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 88,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}