main.floors.MT122=
{
    "floorId": "MT122",
    "title": "冰原之塔6层",
    "name": "冰原之塔6层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 5,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "建议先存个档。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,6": [
            {
                "type": "show",
                "loc": [
                    [
                        10,
                        1
                    ]
                ]
            },
            {
                "type": "move",
                "loc": [
                    10,
                    1
                ],
                "time": 200,
                "keep": true,
                "steps": [
                    "left:4",
                    "down:3"
                ]
            },
            "\t[伊杰明,N416]\b[this,6,4]看样子你已经解决掉两座塔了啊，约瑟先生。",
            {
                "type": "changePos",
                "direction": "up"
            },
            "\t[hero]\b[hero]伊杰明？你已经恢复了吗？",
            "\t[伊杰明,N416]\b[this,6,4]是啊……多亏村子里的人悉心照料。",
            "\t[伊杰明,N416]\b[this,6,4]我的魔法系统也已经恢复的差不多了。",
            "\t[伊杰明,N416]\b[this,6,4]我发现这座塔居然没有单人限制的条件啊。",
            "\t[伊杰明,N416]\b[this,6,4]看来可以双人行动了。",
            "\t[hero]\b[hero]这座塔的法则和之前我们探索的遗迹很像啊。",
            "\t[hero]\b[hero]这个复活还是那么的令人头疼。",
            "\t[伊杰明,N416]\b[this,6,4]呵呵，但想必你走到这里也已经对破解之法有头绪了吧。",
            "\t[hero]\b[hero]啊，是已经有头绪了。",
            {
                "type": "moveHero",
                "time": 50,
                "async": true,
                "steps": [
                    "up:1"
                ]
            },
            {
                "type": "animate",
                "name": "jianji2",
                "loc": [
                    6,
                    4
                ],
                "async": true
            },
            {
                "type": "move",
                "loc": [
                    6,
                    4
                ],
                "time": 50,
                "keep": true,
                "steps": [
                    "backward:1"
                ]
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "setBlock",
                "number": "N495",
                "loc": [
                    [
                        6,
                        3
                    ]
                ],
                "time": 500
            },
            "\t[黑衣人,N495]\b[this,6,3]切……被看出来了么。",
            "\t[黑衣人,N495]\b[this,6,3]看来那个水井中的遗迹……并不是有着复活魔物的规则吧。",
            "\t[黑衣人,N495]\b[this,6,3]不过……你是从什么时候发现的。",
            "\t[hero]\b[hero]伊杰明那家伙在别人面前可是很喜欢称呼自己为鄙人的。",
            "\t[hero]\b[hero]（其实是在下啦……不过我也没理由告诉你他真正的口癖。）",
            "\t[黑衣人,N495]\b[this,6,3]呵呵，是这样啊。",
            "\t[黑衣人,N495]\b[this,6,3]看来我调查不够充分啊。",
            "\t[黑衣人,N495]\b[this,6,3]不过本来就是玩玩罢了。",
            "\t[黑衣人,N495]\b[this,6,3]那么，就让我来看看你的实力究竟如何吧。",
            {
                "type": "closeDoor",
                "id": "specialDoor",
                "loc": [
                    6,
                    7
                ]
            },
            {
                "type": "setBlock",
                "number": "E631",
                "loc": [
                    [
                        6,
                        3
                    ]
                ]
            },
            {
                "type": "setBlockOpacity",
                "loc": [
                    [
                        6,
                        3
                    ]
                ],
                "opacity": 0.5
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "10,1": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,3": [
            {
                "type": "setBlock",
                "number": "N495"
            },
            "\t[黑衣人,N495]\b[this,6,3]看来……已经不是我能够解决的对手了……",
            "\t[黑衣人,N495]\b[this,6,3]你的魔力明显比一开始的时候增加了很多。",
            "\t[黑衣人,N495]\b[this,6,3]而且……几乎感觉不到你有魔化症的困扰。",
            "\t[黑衣人,N495]\b[this,6,3]这究竟是怎么回事……",
            "\t[hero]\b[hero]这就没必要告诉你了吧？",
            {
                "type": "animate",
                "name": "jianji2",
                "loc": [
                    6,
                    3
                ],
                "async": true
            },
            {
                "type": "jump",
                "from": [
                    6,
                    3
                ],
                "to": [
                    6,
                    1
                ],
                "time": 200,
                "keep": true
            },
            "\t[黑衣人,N495]\b[this,6,1]呵呵……不玩了。",
            "\t[黑衣人,N495]\b[this,6,1]那家伙是不是有什么事情没告诉我……总觉得有些奇怪……",
            "\t[hero]\b[hero]你们叫做巴别塔是吧。",
            "\t[hero]\b[hero]还真是一堆反社会的家伙啊。",
            "\t[hero]\b[hero]告诉那个塔主，我很快就会让他的魔塔崩塌掉！",
            "\t[黑衣人,N495]\b[this,6,1]呵呵……你们之间究竟谁能取得胜利我并不在意。",
            "\t[黑衣人,N495]\b[this,6,1]只要能提供给我足够的乐趣就行了。",
            "\t[黑衣人,N495]\b[this,6,1]那么……期待你的表现。",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        1
                    ]
                ],
                "remove": true
            },
            "\t[hero]\b[hero]啧……下次必须连他也一起收拾干净。",
            {
                "type": "setHeroIcon",
                "name": "o.png"
            },
            "\t[怀特莉丝,N430]\b[hero]这家伙的能力很麻烦啊……",
            "\t[怀特莉丝,N430]\b[hero]要是有他站在塔主那一边。",
            "\t[怀特莉丝,N430]\b[hero]确实是不好办。",
            {
                "type": "if",
                "condition": "(flags.bd==1)",
                "true": [
                    {
                        "type": "setHeroIcon",
                        "name": "herob.png"
                    }
                ],
                "false": [
                    {
                        "type": "setHeroIcon",
                        "name": "hero.png"
                    }
                ]
            },
            "\t[hero]\b[hero]到时候麻烦的事情就交给伊杰明吧。",
            "\t[hero]\b[hero]他们看上去挺有渊源的。",
            {
                "type": "openDoor",
                "loc": [
                    6,
                    7
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007],
    [120007,619,356,  0,627,  0,  0,  0,622,  0,417, 88,120007],
    [120007,120007,120007,120007,120007,  0,  0,  0,120007, 32,  0,  0,120007],
    [120007, 34,  0, 34,120007,120007,  0,120007,120007,120007,120007, 81,120007],
    [120007,  0, 30,  0,120007,  0,  0,  0,120007,  0,625,  0,120007],
    [120007, 21,  0, 21,120007,  0,  0,  0,120007,  0,  0,625,120007],
    [120007,120007, 81,120007,120007,  0,  0,  0,120007, 81,120007,120007,120007],
    [120007,627,  0,  0,120007,120007,  0,120007,120007,  0,499,  0,120007],
    [120007,  0,627,  0,120007, 32,  0, 32,120007,501,  0,628,120007],
    [120007, 81,120007,120007,120007,  0, 32,  0,120007,  0,500,  0,120007],
    [120007,  0,  0, 32,120007, 32,  0, 32,120007,120007,120007,120007,120007],
    [120007, 87,  0,  0,625,  0,  0,  0,626,  0, 21, 32,120007],
    [120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007,120007]
],
    "bgmap": [
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}