main.floors.MT139=
{
    "floorId": "MT139",
    "title": "最终之塔4层",
    "name": "最终之塔4层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 3,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,668,  0,  0, 82,  0, 88,  0, 82,  0,  0, 87,10024],
    [10026,  0,  0, 33,  2,  0,  0,  0,  2,501,  0,  0,10024],
    [10026,246,  2,  2,  2,  2,231,  2,  2,  2,  2,246,10024],
    [10026,  0,  0, 21,  2, 32,  0, 32,  2, 21,  0,  0,10024],
    [10026, 34,  0,  0,219,  0, 30,  0,219,  0,  0, 34,10024],
    [10026,  2,  2,  2,  2,  2, 81,  2,  2,  2,  2,  2,10024],
    [10026, 33,  0,231,  0,  0,  0,  0,  0,231,  0, 33,10024],
    [10026,  2,  2,  2,  2,246,  2,246,  2,  2,  2,  2,10024],
    [10026, 21, 21,219,  0,  0,  2,  0,  0,219, 21, 21,10024],
    [10026,  2,  2,  2,  2, 81,  2, 81,  2,  2,  2,  2,10024],
    [10026, 33,499,  0,220,  0,  2,  0,220,  0,500, 33,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}