main.floors.MT138=
{
    "floorId": "MT138",
    "title": "最终之塔3层",
    "name": "最终之塔3层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 2,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,  0,220,  0, 21,  2, 87,  2, 32, 32,  2,501,10024],
    [10026,  0,  2,500, 33,  2,  0,  2, 32, 32,  2, 21,10024],
    [10026, 81,  2,  2,  2,  2,  0,  2,  2,246,  2, 21,10024],
    [10026,  0,  0,246,  0,  0,  0, 81, 81,  0, 81,  0,10024],
    [10026, 81,  2,  2,  2,219,  2,  2,  2,  2,  2,219,10024],
    [10026,  0,  0,231,  0,  0,356,  0,  0,220,  0,  0,10024],
    [10026,246,  2,  2,  2,  2,  2,246,  2,  2,  2, 81,10024],
    [10026,  0, 81,  0, 81, 81,  0,  0,  0,219,  0,  0,10024],
    [10026, 32,  2,219,  2,  2,  0,  2,  2,  2,  2, 81,10024],
    [10026, 32,  2, 21, 21,  2,  0,  2, 33,499,  2,  0,10024],
    [10026,668,  2, 21, 21,  2, 88,  2, 21,  0,231,  0,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}