main.floors.MT137=
{
    "floorId": "MT137",
    "title": "最终之塔2层",
    "name": "最终之塔2层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 88,  2,  0,500, 34,  2, 30,  2, 32,  0,668,10024],
    [10026,  0,  2,220,  0, 21,  2,  0,219,  0, 32,  0,10024],
    [10026,  0,  2, 81,  2,  2,  2, 81,  2,  2,  2,  2,10024],
    [10026,  0,  2,  0,  0,246,  0,  0,  2,  0, 34,  0,10024],
    [10026,219,  2, 81,  2,  2,  2, 82,  2,501,  0, 21,10024],
    [10026,  0,  2,  0,  0,231,  0,  0,  2,  0,219,  0,10024],
    [10026,  0,  2,  2,  2,  2,  2, 81,  2,  2, 81,  2,10024],
    [10026,  0,  0,  0,246,  0,  0,  0,246,  0,  0, 21,10024],
    [10026,  2, 81,  2,  2,  2, 81,  2,  2,  2, 81,  2,10024],
    [10026,  0,220,  0,  2, 21,  0, 21,  2,  0,231,  0,10024],
    [10026, 21,  0, 22,  2,  0, 87,  0,  2,499,  0, 33,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}