main.floors.MT144=
{
    "floorId": "MT144",
    "title": "最终之塔9层",
    "name": "最终之塔9层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 8,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 88,  0,  0,236,  0,  0,  0,247,  0,356,668,10024],
    [10026,  2, 81,  2,  2,  2,223,  2,  2,  2,  2,  2,10024],
    [10026,  0,223,  0,  2, 21,  0, 21,  2, 33,500, 33,10024],
    [10026, 21,  0, 21,  2,  0, 31,  0,  2,  2,247,  2,10024],
    [10026,  0,236,  0,  2,228,  2,236,  2,  0,  0,  0,10024],
    [10026,  2, 81,  2,  2,  0,  2,  0,  2,223,  2,223,10024],
    [10026,228,  0,228,  2, 81,  2, 82,  2,  0,  0,  0,10024],
    [10026,  0,  2,  0,  2,  0,  2,  0,  2,  2, 81,  2,10024],
    [10026, 34,499, 34,  2,247,  2,228,  2,  0,  0,236,10024],
    [10026,  2,  2,  2,  2,  0,  0,  0, 81,  0,247, 21,10024],
    [10026,670,  0,228, 81,  0, 87,  0,  2,236, 21,501,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}