main.floors.MT147=
{
    "floorId": "MT147",
    "title": "最终之塔12层",
    "name": "最终之塔12层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 31,500,  2, 31,499,  2, 31,  2, 32,  2, 31,10024],
    [10026, 21, 21,  2, 21, 21,  2,  0,  2,  0,  2,  0,10024],
    [10026,  0,  0,  2,  0,  0,  2,676,  2,677,  2,676,10024],
    [10026,  0,677, 81,  0,674, 81,  0,  0,  0,  0,  0,10024],
    [10026,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2, 82,10024],
    [10026, 87,  2,501, 31, 21,  2,  0,247,  0,  2,  0,10024],
    [10026,  0,  2, 31, 21,  0,  2,  0,  2,  0,228,  0,10024],
    [10026,  0,  2,  2,  2, 81,  2, 81,  2,  2,  2,  2,10024],
    [10026,  0,  2,247,228,247,  2,  0,  0,  0,  0,  0,10024],
    [10026,228,  2, 81,  2,  2,  2,676,  2, 81,  2,  0,10024],
    [10026,  0,  0,  0,  0,  0,  0,  0,  2,356,  2, 88,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}