main.floors.MT143=
{
    "floorId": "MT143",
    "title": "最终之塔8层",
    "name": "最终之塔8层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 7,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 87,  0,  0,231,  0,  0,  0,231,  0,  0, 88,10024],
    [10026,  2,220,  2,  2,  2, 82,  2,  2,  2, 81,  2,10024],
    [10026,  0,  0,  0,  2, 21, 21, 21,  2,  0,  0,  0,10024],
    [10026,236,  2, 81,  2,  2, 82,  2,  2,223,  2,223,10024],
    [10026, 32,  0,231,  2,  0,668,  0,  2, 21, 22, 21,10024],
    [10026,  0,356,  0, 81,220,  0, 21,  2,  2,  2,  2,10024],
    [10026,220,  0, 21,  2,  0,  0,  0, 81,  0,236,  0,10024],
    [10026, 81,  2,  2,  2,  2, 81,  2,  2,  2,  2, 81,10024],
    [10026,223,  0, 21,  2,  0,247,  0,  2,  0,  0,228,10024],
    [10026,  0,501, 31,  2, 34,  0, 34,  2, 33,499,  0,10024],
    [10026, 21, 31, 31,  2,  0, 30,  0,  2,500, 33,  0,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}