main.floors.MT140=
{
    "floorId": "MT140",
    "title": "最终之塔5层",
    "name": "最终之塔5层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 4,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "3,11": [
            "\t[hero]\b[hero]这碎片……",
            "\t[伊杰明,N416]\b[hero,1]要收集到另外的碎片组合起来是吧。",
            "\t[hero]\b[hero]看来这一次的敌人就是前三个傀儡记忆中的魔法师了。",
            "\t[赫,N426]\b[hero]没有单独分出去么。",
            "\t[hero]\b[hero]或许是他仅剩的一张牌了。",
            "\t[hero]\b[hero]而且这一路来看也确实比之前的三座塔强上很多。",
            "\t[hero]\b[hero]不过要说王牌的话……还得是他从一开始打出去的黑骑士啊。"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 32,  0,219, 81,  0,  0, 32, 82,246,  2, 88,10024],
    [10026,  0, 21,  0,  2,  0,500,  0,  2,  0,  0,  0,10024],
    [10026,668,  0,356,  2, 21,  0,246, 81,231,  2,  0,10024],
    [10026,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,219,10024],
    [10026, 22, 21, 21,  0,231,  0, 81,  0, 31,  2,  0,10024],
    [10026,  2,  2,  2,  2,  2,  0,  2, 31,  0, 81,  0,10024],
    [10026, 21,  0, 81,219,  2,  0,  2,  2,  2,  2,  0,10024],
    [10026,499, 21,  2,220,  2,  0,220,  0,  0,219,  0,10024],
    [10026, 33,501,  2,219,  2,  0,  2,  2,  2,  2, 81,10024],
    [10026,  2,  2,  2, 81,  2,  0,  2, 21, 21,246,  0,10024],
    [10026, 87,  0,670,  0,246,  0,  2, 21, 21,246,  0,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}