main.floors.MT148=
{
    "floorId": "MT148",
    "title": "最终之塔13层",
    "name": "最终之塔13层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 2,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,  0,  0,  0,676,  0,  0, 81,  0,677, 32,501,10024],
    [10026, 81,  2,  2,  2,  2,  0,  2,  0,  2,  2, 32,10024],
    [10026,  0,  2,499, 21,  2,  0,  2,  0,  2,  2,674,10024],
    [10026,  0,674,  0, 32,  2,228,  2,676,  0,  0,  0,10024],
    [10026,  2,  2, 82,  2,  2,  0,  2,  2,  2,  2, 81,10024],
    [10026, 88,  0,  0,674,  0,  0,  0,247,  0,  0,  0,10024],
    [10026,  2, 81,  2,  2,  2,  0,  2,  2,  2,  2,  0,10024],
    [10026,  0,  0,676,  0,  2,677,  2, 32,500,  2,676,10024],
    [10026,228,  2,  2,  0, 81,  0, 82,  0, 21,  2,  0,10024],
    [10026,  0,  2,  2, 32,  2,  0,  2,677,  2,  2,  0,10024],
    [10026,  0,247,  0,  0,  2, 87,  2,  0,  0, 81,  0,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}