main.floors.MT142=
{
    "floorId": "MT142",
    "title": "最终之塔7层",
    "name": "最终之塔7层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 6,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,670, 32,  2,  0, 21, 21, 22,  2, 21,  0, 87,10024],
    [10026,  0,501,  2,236,  0, 21, 21,  2,  0, 31,  0,10024],
    [10026, 81,  2,  2, 81,  2,  2,  2,  2,220,  2,  2,10024],
    [10026,  0,231,  0,  0,220,  0,668,  2,  0, 32,  0,10024],
    [10026,  2,  2,  2,  2,  2, 81,  2,  2,  2,  2, 81,10024],
    [10026,  0, 21,  0,  2, 31,  0, 21,  2, 21,  0,246,10024],
    [10026,499,  0,223, 81,  0,  0,  0,  2,  0,  2,  0,10024],
    [10026,  0, 33,  0,  2,  0,220,  0,  2,246,  0, 31,10024],
    [10026, 82,  2,  2,  2,  2, 81,  2,  2, 81,  2,  2,10024],
    [10026,  0, 32,  0,  2, 31,  0, 31,  2,  0,356,  0,10024],
    [10026,500,  0,231, 81,  0,  0,  0,219,  0,  0, 88,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}