main.floors.MT151=
{
    "floorId": "MT151",
    "title": "最终之塔16层",
    "name": "最终之塔16层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 5,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 31,  0,678,  0,  0,356,  0,  0,678,  0, 31,10024],
    [10026,  0, 31,  2, 81,  2,  2,  2, 81,  2, 31,  0,10024],
    [10026,677,  2,  2,  0, 31,  2, 31,  0,  2,  2,677,10024],
    [10026,  0, 82,  0, 32,  0,  2,  0, 32,  0, 82,  0,10024],
    [10026,  0,  2, 31,  0,500,  2,500,  0, 31,  2,  0,10024],
    [10026, 21,  2,  2, 82,  2,  2,  2, 82,  2,  2, 21,10024],
    [10026,  0,  2, 31,  0,499,  2,499,  0, 31,  2,  0,10024],
    [10026,  0,  2,  0,501,  0,  2,  0,501,  0,  2,  0,10024],
    [10026,674,  2,  2,  0, 31,  2, 31,  0,  2,  2,674,10024],
    [10026,  0,  0,  2, 81,  2,  2,  2, 81,  2,  0,  0,10024],
    [10026, 87,  0,675,  0,  0,356,  0,  0,675,  0, 88,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}