main.floors.MT157=
{
    "floorId": "MT157",
    "title": "最终之塔A2层",
    "name": "最终之塔A2层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 11,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,356,  0, 34,  0,  3, 32, 32,  3, 32,  3, 88,10024],
    [10026,  0, 34,  0, 21,  3,  0, 32,  3, 21,  3,  0,10024],
    [10026,  3,  3,677,  3,  3,679,  0,  3,  0,  3,  0,10024],
    [10026,  0,  0,  0, 32,  3, 81,  3,  3,676,  3,  0,10024],
    [10026,676,  0,  0, 21,  3,  0,  0,  0,  0, 86,  0,10024],
    [10026, 81,  3,  3,  3,  3, 82,  3,  3, 81,  3,  0,10024],
    [10026,  0,  0,  0,679,  0,  0,  0,  3,  0,  3,  0,10024],
    [10026,  3,  3, 81,  3,  3,  3, 32,  3, 31,  3,  0,10024],
    [10026,  0, 34,  0, 34,  0,  3, 32,  3, 31,  3,  0,10024],
    [10026,674,  3,  3,  3,674,  3,500,  3,501,  3,  0,10024],
    [10026,  0, 21,499, 21,  0,  3,  0,677,  0,  3, 87,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}