main.floors.MT15=
{
    "floorId": "MT15",
    "title": "提亚之森南部06",
    "name": "提亚之森南部06",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[hero]\b[hero]（这次是三头犬么……恐怕有些难度。）",
        "\t[hero]\b[hero]（能和三头犬交战撑到现在……那个人也不简单啊。）",
        "\t[hero]\b[hero]（看衣服也和村里的人不一样，是外来的勇者？）",
        "\t[hero]\b[hero]（现在还剩一人有行动力，剩余两人受伤倒地）",
        "\t[hero]\b[hero]（而他也撑不了多久，最好的办法是将这东西引开。）",
        {
            "type": "moveHero",
            "time": 1,
            "steps": [
                "up:7"
            ]
        },
        {
            "type": "animate",
            "name": "jianji2",
            "loc": [
                6,
                4
            ]
        },
        "\t[三头犬,E406]\b[this,6,4]嗷！！！",
        "\t[格兰姆,N410]\b[this,6,7]！？",
        "\t[格兰姆,N410]\b[this,6,7]朋友你是？",
        "\t[hero]\b[hero]我引开这畜生，你赶紧处理一下这两个人后躲起来，村里的帮手应该马上就会赶到了。",
        {
            "type": "animate",
            "name": "omnislash",
            "loc": [
                6,
                5
            ],
            "async": true
        },
        {
            "type": "moveHero",
            "steps": [
                "backward:1"
            ]
        },
        "\t[hero]\b[hero]咳……该死……力道真不小啊……",
        "\t[hero]\b[hero]（之前体力也被消耗了挺多……更重要的是……抑制器恐怕马上就要满了。）",
        "\t[hero]\b[hero]来抓我吧！笨狗！",
        {
            "type": "jumpHero",
            "loc": [
                6,
                0
            ],
            "time": 500
        },
        {
            "type": "setHeroOpacity",
            "opacity": 0
        },
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    6,
                    4
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                6,
                4
            ],
            "time": 200,
            "steps": [
                "up:4"
            ]
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "changeFloor",
            "floorId": "MT16",
            "loc": [
                6,
                12
            ],
            "direction": "up"
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.th==1)",
            "true": [
                {
                    "type": "if",
                    "condition": "(flags.stq==1)",
                    "true": [],
                    "false": [
                        {
                            "type": "sleep",
                            "time": 1000
                        },
                        "\t[hero]\b[hero]……",
                        "\t[hero]\b[hero]我现在心情可不是很好。",
                        "\t[hero]\b[hero]识趣的就离我远点。",
                        {
                            "type": "move",
                            "loc": [
                                6,
                                3
                            ],
                            "time": 500,
                            "keep": true,
                            "steps": [
                                "backward:3"
                            ]
                        },
                        {
                            "type": "turnBlock",
                            "direction": "down",
                            "loc": [
                                [
                                    6,
                                    6
                                ]
                            ]
                        },
                        {
                            "type": "move",
                            "loc": [
                                6,
                                6
                            ],
                            "time": 1,
                            "steps": [
                                "down:6"
                            ]
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    5,
                                    2
                                ]
                            ],
                            "floorId": "MT9"
                        },
                        {
                            "type": "setValue",
                            "name": "flag:stq",
                            "value": "1"
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    6,
                                    7
                                ]
                            ],
                            "floorId": "MT16"
                        }
                    ]
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "6,3": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT14",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,409,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,406,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,413,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,414,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,  0,415, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 93, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [60000,60000,60000,60000,60000,60000,145,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,145,60000,60000,60000,60000,60000,60000]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "weather": [
        "cloud",
        3
    ],
    "bgm": "fightstart.mp3"
}