main.floors.MT158=
{
    "floorId": "MT158",
    "title": "最终之塔A3层",
    "name": "最终之塔A3层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 12,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,501,  0, 81,  0,  3,  0,676,  0,  3,  0, 21,10024],
    [10026,  0, 33,  3,  0,  3,  0,  3,  0, 81,679,  0,10024],
    [10026, 81,  3,  3,674,  3,  0,  3,  0,  3,  0, 22,10024],
    [10026,  0, 21,  3,  0,  3,679,  3,679,  3,  3,  3,10024],
    [10026, 21,  0,  3,  0, 81,  0, 82,  0,  3,  0,  0,10024],
    [10026,  3,  3,  3,  3,  3,  0,  3,  0, 81,  0, 87,10024],
    [10026,  0,  0,676,  0,  0,  0,  3,  0,  3,  0,  0,10024],
    [10026, 81,  3,  3,  3, 81,  3,  3,676,  3,  3, 81,10024],
    [10026,679,  0,  3,  0,677,  0,  3,  0,  3,  3, 81,10024],
    [10026,  0, 21,  3, 21,  0, 21,  3,  0,  3,  0,  0,10024],
    [10026, 21, 21,  3,500, 33,499,  3,  0, 81,  0, 88,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}