main.floors.MT150=
{
    "floorId": "MT150",
    "title": "最终之塔15层",
    "name": "最终之塔15层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 4,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[hero]\b[hero]见鬼……这里怎么还有魔物。",
        "\t[hero]\b[hero]可恶啊……现在必须赶快跑去找怀特莉丝。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,  0, 31,  0, 82,  0, 88,  0,  2,499,  0, 34,10024],
    [10026,674,  0, 21,  2,  0,  0,  0,  2,  0,675,  0,10024],
    [10026, 81,  2,  2,  2,  2, 81,  2,  2,  2, 81,  2,10024],
    [10026,  0,356,  0,  2,  0,677,  0,  2,500,  0, 34,10024],
    [10026, 31,  0,678, 81, 31,  0, 21,  2,  0,678,  0,10024],
    [10026, 81,  2,  2,  2,  2,  2,  2,  2,  2, 81,  2,10024],
    [10026,  0, 31,  0, 81,674,  0,356,  2, 21,  0, 21,10024],
    [10026,677,  0, 21,  2,  0, 31,  0,  2,  0,677,  0,10024],
    [10026, 81,  2,  2,  2,  2, 82,  2,  2,  2, 81,  2,10024],
    [10026,  0, 31,  0,  2, 31,  0, 31,  2, 31,  0,  0,10024],
    [10026, 21,  0,678, 81,  0,501,  0, 81,  0,  0, 87,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}