main.floors.MT161=
{
    "floorId": "MT161",
    "title": "最终之塔A6层",
    "name": "最终之塔A6层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 15,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,  0, 34, 34,  3, 34,  0, 34,  3, 21,500, 34,10024],
    [10026,  0, 34, 34,  3,  0,499,  0,  3,  0, 21,501,10024],
    [10026,675,  0,  0,  3,  0,  3,677,  3, 81,  3,  3,10024],
    [10026, 81,  3,  3,  3,675,  3,  0,  3,677,678,677,10024],
    [10026,  0,  0, 32,  3,  0,  3, 82,  3,  3,  3, 81,10024],
    [10026,  0,  0,  0,674,  0,  0,  0,674,  0,  0,  0,10024],
    [10026,  3,  3,  3,  3,  3,  3,  3,  3, 81,  3,  3,10024],
    [10026,  0, 34,  0,678,  0,  0,  0,677,  0,  3, 33,10024],
    [10026, 81,  3,  3,  3,  3, 81,  3,  3, 21,  3,  0,10024],
    [10026,  0,  0, 32,  3,  0,  0,  0,  3, 21,  3,674,10024],
    [10026, 87,  0,  0, 82,  0, 88,  0,  3,  0, 81,  0,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}