main.floors.MT168=
{
    "floorId": "MT168",
    "title": "最终之塔B6层",
    "name": "最终之塔B6层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 22,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,500,  0,  0,675,  0, 88,  0,674,  0, 34,  0,10024],
    [10026, 33,501,  0,  3,  0,  0,  0,  3, 21,  0, 21,10024],
    [10026,  3,  3,  3,  3,  3,  0,  3,  3,  3,  3,  3,10024],
    [10026,  0,  0,678,  0, 81,  0,  3,  0, 81,  0, 21,10024],
    [10026, 81,  3,  3,  3,  3,  0,  3,675,  3, 34, 33,10024],
    [10026,  0,674,  0, 21,  3,  0,  3,  0,  3,  3,  3,10024],
    [10026,677,  0, 33,499,  3,  0,  3,  0, 81,  0, 21,10024],
    [10026,  3,  3,  3,  3,  3,674,  3,678,  3, 21, 33,10024],
    [10026,  0,677,  0,  0,  0,  0, 81,  0,  3,  3,  3,10024],
    [10026, 34,  3, 82,  3,  3,  3,  3,  3,  3,  0,  0,10024],
    [10026,  0,677,  0,  0,  0,  0,678,  0,  0,  0, 87,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}