main.floors.MT164=
{
    "floorId": "MT164",
    "title": "最终之塔B2层",
    "name": "最终之塔B2层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 18,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,  0,  0,  0,  3, 21,  0,676, 81,674,  0,  0,10024],
    [10026, 21,  3,677,  3,  0,  3,  0,  3,  0,501, 31,10024],
    [10026,499,  3,  0,  3,676,  0, 21,  3,  0, 31, 33,10024],
    [10026, 33,  3, 81,  3, 81,  3,  3,  3,  3,  3,  3,10024],
    [10026,  3,  3,  0,  0,  0,  0,  0,  0,  0,  3, 34,10024],
    [10026, 88,  3,679,  3,  3, 81,  3,  3,679,  3, 21,10024],
    [10026,  0,  3,  0,  3,  0,679,  0,  3,  0,  3, 21,10024],
    [10026,  0, 82,  0,  3, 21,  0, 21,  3,  0, 81,  0,10024],
    [10026,676,  3,676,  3,  3, 81,  3,  3,676,  3,679,10024],
    [10026,  0,  3,  0,  3,  0,674,  0,  3,  0,  0,  0,10024],
    [10026,  0, 81,  0,  3,500,  0, 33,  3,  0,  0, 87,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}