main.floors.MT165=
{
    "floorId": "MT165",
    "title": "最终之塔B3层",
    "name": "最终之塔B3层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 19,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 87,  3, 31,  0, 33,  0, 31,  3, 21,  3, 22,10024],
    [10026,  0,  3,  0,499,  0,500,  0,  3, 21,  3,674,10024],
    [10026,  0,  3,677,  0,501,  0,679,  3,676,  3,  0,10024],
    [10026,679,  3, 81,  3,  3,  3, 82,  3, 81,  3, 81,10024],
    [10026,  0,  3,  0,  0,676,  0,  0,  0,  0,  0,  0,10024],
    [10026,  0,  3,  0,  3,  3,  3,  3,  3, 81,  3, 81,10024],
    [10026,  0,674,  0,  3,  0, 33, 82, 32,  0,  3,  0,10024],
    [10026, 81,  3, 81,  3,677,  0,  3,  0, 21,  3,679,10024],
    [10026,  0,  3,  0,  3, 81,  3,  3,  3, 81,  3,  0,10024],
    [10026,679,  3,679,  3, 21,  0,  3,  0,676,  3,  0,10024],
    [10026,  0, 34,  0,  3,  0,676, 81, 32,  0,  3, 88,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}