main.floors.MT160=
{
    "floorId": "MT160",
    "title": "最终之塔A5层",
    "name": "最终之塔A5层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 14,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 88,  0,676,  0,  0,  0, 81,  0, 82,  0,500,10024],
    [10026,  0,  0,  3,  3,  3,679,  3,  3,  3,499,  0,10024],
    [10026,  3,  3,  3,  0, 81,  0, 81,  0,  3,  3, 81,10024],
    [10026, 34, 21,  3,676,  3,  0,  3,  0,674,  0,678,10024],
    [10026, 21,  0, 81,  0,  3,  0,  3,674,  0,356,  0,10024],
    [10026,  3,  3,  3,  0,  3,677,  3,  3,  3,  3,  3,10024],
    [10026, 23, 21,  3,675,  3,  0,  3,  0, 32,  3, 22,10024],
    [10026, 21,  0, 81,  0,  3,  0,  3, 32,  0,  3, 21,10024],
    [10026,  3,  3,  3,  3,  3,679,  3,  3,674,  3, 21,10024],
    [10026, 32,501,  0,  3,  0,  0,  0,  3,  0,  3,  0,10024],
    [10026, 21,  0,674, 81,  0, 87,  0, 81,  0, 81,677,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}