main.floors.MT167=
{
    "floorId": "MT167",
    "title": "最终之塔B5层",
    "name": "最终之塔B5层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 21,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,  0, 21,  0,  3,  0, 87,  0,  3,  0,  0,501,10024],
    [10026, 22,  0,677, 81,  0,  0,  0, 81,674,  0,  0,10024],
    [10026,  0, 21,  0,  3, 34,  0,  0,  3,  0,  0, 33,10024],
    [10026,  3,  3,  3,  3,  3, 81,  3,  3, 81,  3,  3,10024],
    [10026,  0,499,  0,  3,  0,679,  0,  3,  0,  3, 31,10024],
    [10026, 33,  0,678, 81,  0,  0,  0,  3,  0,675,  0,10024],
    [10026,  0,500,  0,  3,  0,  0, 21,  3,  0,  3, 23,10024],
    [10026,  3,  3,  3,  3,  3, 82,  3,  3, 81,  3,  3,10024],
    [10026, 21,676,  0,  3, 34,  0,  0,  3,  0,  0, 32,10024],
    [10026, 21,677,  0, 81,  0,  0,  0, 81,679,  0,  0,10024],
    [10026, 21,676,  0,  3,  0, 88,  0,  3,  0,  0, 32,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}