main.floors.MT16=
{
    "floorId": "MT16",
    "title": "塔前",
    "name": "塔前",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "weather": [
        "cloud",
        3
    ],
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "floorId": "MT15",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    9
                ]
            ],
            "floorId": "MT15",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    11
                ]
            ],
            "floorId": "MT15",
            "remove": true
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "moveHero",
            "steps": [
                "up:3"
            ]
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 500
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up:1"
            ]
        },
        "\t[hero]\b[hero]本不想用这招的……但时间要是拖太久，恐怕就更危险了……",
        {
            "type": "setValue",
            "name": "item:skill1",
            "operator": "+=",
            "value": "1"
        },
        "漂泊者可以使用诅咒的力量，让自身通过魔化而打出魔族一样的力量，但代价是诅咒值上升一大段，离死亡会更近。",
        {
            "type": "autoText",
            "text": "获得技能，请在背包中查看。",
            "time": 3000
        },
        "\t[hero]\b[hero]来吧……蠢狗，这里就是你的坟墓！",
        {
            "type": "if",
            "condition": "(flags.b10b!=1)",
            "true": [],
            "false": [
                "\t[hero]\b[hero]已经是大晚上了啊……",
                "\t[hero]\b[hero]真是不想再经历这么麻烦的事情了。",
                "\t[hero]\b[hero]一不小心就过了这么长时间。",
                "\t[hero]\b[hero]村里的人不会都给我办丧事了吧……哈哈。",
                {
                    "type": "hide",
                    "loc": [
                        [
                            5,
                            11
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            7,
                            11
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "show",
                    "loc": [
                        [
                            6,
                            3
                        ]
                    ],
                    "floorId": "MT15"
                }
            ]
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.b10b===1)",
            "true": [
                {
                    "type": "if",
                    "condition": "(flags.tw===1)",
                    "true": [],
                    "false": [
                        "\t[hero]\b[hero]已经是大晚上了啊……",
                        "\t[hero]\b[hero]真是不想再经历这么麻烦的事情了。",
                        "\t[hero]\b[hero]一不小心就过了这么长时间。",
                        "\t[hero]\b[hero]村里的人不会都给我办丧事了吧……哈哈。",
                        {
                            "type": "confirm",
                            "text": "现在可以提交成绩",
                            "yes": [
                                {
                                    "type": "choices",
                                    "text": "选择计分规则",
                                    "choices": [
                                        {
                                            "text": "生命",
                                            "action": [
                                                "分数为生命。",
                                                "额外的，每把绿钥匙增加1000000分。",
                                                {
                                                    "type": "setValue",
                                                    "name": "status:hp",
                                                    "operator": "+=",
                                                    "value": "core.itemCount('greenKey')*1000000"
                                                },
                                                {
                                                    "type": "win",
                                                    "reason": "回到村子(生命榜)"
                                                }
                                            ]
                                        },
                                        {
                                            "text": "钥匙",
                                            "action": [
                                                "分数为1000+蓝钥匙*1000+黄钥匙*500",
                                                {
                                                    "type": "setValue",
                                                    "name": "status:hp",
                                                    "value": "1000+core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000"
                                                },
                                                "额外的，每把绿钥匙增加1000000分。",
                                                {
                                                    "type": "setValue",
                                                    "name": "status:hp",
                                                    "operator": "+=",
                                                    "value": "core.itemCount('greenKey')*1000000"
                                                },
                                                {
                                                    "type": "win",
                                                    "reason": "回到村子(钥匙榜)"
                                                }
                                            ]
                                        },
                                        {
                                            "text": "综合",
                                            "action": [
                                                "分数为生命+蓝钥匙*1000+黄钥匙*500+魔力*50",
                                                {
                                                    "type": "setValue",
                                                    "name": "status:hp",
                                                    "operator": "+=",
                                                    "value": "core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000+hero.mana*50"
                                                },
                                                "额外的，每把绿钥匙增加1000000分。",
                                                {
                                                    "type": "setValue",
                                                    "name": "status:hp",
                                                    "operator": "+=",
                                                    "value": "core.itemCount('greenKey')*1000000"
                                                },
                                                {
                                                    "type": "win",
                                                    "reason": "回到村子(综合榜)"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ],
                            "no": []
                        },
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    5,
                                    11
                                ]
                            ],
                            "remove": true
                        },
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    7,
                                    11
                                ]
                            ],
                            "remove": true
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    6,
                                    3
                                ]
                            ],
                            "floorId": "MT15"
                        },
                        {
                            "type": "setValue",
                            "name": "flag:tw",
                            "value": "1"
                        },
                        {
                            "type": "moveHero",
                            "time": 500,
                            "steps": [
                                "down:4"
                            ]
                        },
                        {
                            "type": "changeFloor",
                            "floorId": "MT15",
                            "loc": [
                                6,
                                0
                            ]
                        }
                    ]
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "6,12": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "changeFloor",
                    "floorId": "MT15",
                    "loc": [
                        6,
                        0
                    ]
                }
            ]
        },
        "6,11": [],
        "6,7": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "changeFloor",
                    "floorId": "MT17",
                    "loc": [
                        6,
                        12
                    ]
                }
            ]
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {
        "6,11": [
            {
                "type": "setVolume",
                "value": 0,
                "time": 3000,
                "async": true
            },
            "\t[hero]\b[hero]不行了……抑制器到极限了……",
            "\t[hero]\b[hero]再涨一点我就要魔化了……",
            {
                "type": "setBlock",
                "number": "I356",
                "loc": [
                    [
                        6,
                        11
                    ]
                ]
            },
            "\t[hero]\b[hero]魔晶！？",
            "\t[hero]\b[hero]果然是从塔里跑出来的家伙。",
            "\t[hero]\b[hero]正好可以缓解一下。",
            {
                "type": "playSound",
                "name": "item.mp3"
            },
            {
                "type": "setValue",
                "name": "status:mana",
                "operator": "+=",
                "value": "20"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        11
                    ]
                ],
                "remove": true
            },
            "\t[hero]\b[hero]不行……消耗的还是太多了。",
            "\t[hero]\b[hero]既然这样……干脆就直接去塔里……",
            {
                "type": "moveHero",
                "steps": [
                    "up:3"
                ]
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "changeFloor",
                "floorId": "MT17",
                "loc": [
                    6,
                    12
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [70177,70169,70147,70210,70211,70211,70211,70211,70211,70212,70147,70173,70181],
    [70185,70177,70169,70147,70147,70147,70147,70147,70147,70147,70173,70181,70189],
    [70185,70185,70177,70178,70179,70179,70179,70179,70179,70180,70181,70189,70189],
    [70193,70185,70185,70203,70203,70203,70203,70203,70203,70203,70189,70189,70197],
    [70201,70193,70185,70203,70203,70203,70203,70203,70203,70203,70189,70197,70205],
    [70209,70201,70193,70203,70203,70203,70203,70203,70203,70203,70197,70205,70213],
    [ 20,70209,70201,70203,70203,70203,10105,70203,70203,70203,70205,70213, 20],
    [ 20, 20,70209,70211,70211,10112,10113,10114,70211,70211,70213, 20, 20],
    [ 20, 20, 20, 20,  0,  0,  0,  0,  0, 20, 20, 20, 20],
    [ 20, 20, 20, 20,  0,  0,  0,  0,  0, 20, 20, 20, 20],
    [ 20, 20, 20, 20,  0,  0,  0,  0,  0, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 17,  0, 17, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20,  0,409,  0, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [70143,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,70159],
    [70151,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,70167],
    [70095,  0,  0,  0,70175,  0,  0,  0,70175,  0,  0,  0,70005],
    [70103,70005,  0,  0,70183,  0,  0,  0,70183,  0,  0,  0,70013],
    [70111,70013,  0,  0,70005,10104,  0,10106,  0,  0,  0,70014,  0],
    [70119,  0,  0,  0,70013,  0,  0,  0,70014,  0,  0,  0,  0],
    [70127,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,70203,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,70211,10113,70211,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,147,147,147,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,147,147,147,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,147,147,147,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,147,147,147,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,147,147,147,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "bgm": "fightstart.mp3"
}