main.floors.MT162=
{
    "floorId": "MT162",
    "title": "最终之塔A7层",
    "name": "最终之塔A7层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": 16,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,3": [
            "\t[hero]\b[hero]不打算再搞你那骗人的把戏了吗？",
            "\t[黑衣人,E631]\b[this,6,3]呵呵，那已经没有意义了。",
            "\t[黑衣人,E631]\b[this,6,3]这场游戏就快要落幕了。",
            "\t[黑衣人,E631]\b[this,6,3]解锁主层大门的机关就在我的身后。",
            "\t[黑衣人,E631]\b[this,6,3]击败我，然后打开这个机关给你的那位朋友开路。",
            "\t[黑衣人,E631]\b[this,6,3]你能做的事就做完了。",
            "\t[黑衣人,E631]\b[this,6,3]是不是很简单？",
            "\t[hero]\b[hero]但看起来……你似乎有些自信能挡住在下。",
            "\t[黑衣人,E631]\b[this,6,3]哪有的事？我只是因为这里需要一个阻挡你的角色才会出现这里的。",
            "\t[黑衣人,E631]\b[this,6,3]毕竟塔主手中的牌已经出的差不多了。",
            "\t[黑衣人,E631]\b[this,6,3]唉，还需要我这个外援来帮忙，还真是够狼狈的。",
            "\t[hero]\b[hero]说起来……之前在下才想起来……",
            "\t[hero]\b[hero]你的变化能力简直与当初那个始祖之一的虚妄家如出一辙啊。",
            "\t[hero]\b[hero]这等精细程度可不是普通人能达到的。",
            "\t[hero]\b[hero]你们巴别塔的真实目的恐怕与这些始祖有关吧？",
            "\t[hero]\b[hero]你们在收集始祖的力量吗？",
            "\t[黑衣人,E631]\b[this,6,3]嘿嘿……既然你察觉出来了，那也没必要隐瞒了。",
            "\t[黑衣人,E631]\b[this,6,3]我的变化能力确实来自虚妄家。",
            "\t[黑衣人,E631]\b[this,6,3]在他被那个无名漂泊者杀死后，我们组织的人在虚妄之间的废墟中收集到了他的遗骸。",
            "\t[黑衣人,E631]\b[this,6,3]并成功将其力量提取了出来。",
            "\t[黑衣人,E631]\b[this,6,3]而之后的成果嘛……也如你所见，始祖的力量也可以沦为我们的力量！",
            "\t[黑衣人,E631]\b[this,6,3]那么……当我们收集到全部十二位始祖的力量后会发生什么？",
            "\t[黑衣人,E631]\b[this,6,3]你能够想象吗！？",
            "\t[黑衣人,E631]\b[this,6,3]颠覆世界的力量……",
            "\t[黑衣人,E631]\b[this,6,3]哈哈！这不让人期待吗！？",
            "\t[黑衣人,E631]\b[this,6,3]怎么样？我再一次邀请你加入我们。",
            "\t[黑衣人,E631]\b[this,6,3]你不是最爱研究魔塔吗！？那这个课题与我们的成果难道不足以令你动心吗！？",
            "\t[hero]\b[hero]在下对掌控世界并无什么兴趣。",
            "\t[hero]\b[hero]研究魔塔的目的仅仅是为了寻找世界的真理罢了。",
            "\t[hero]\b[hero]而你们这种为了野心不择手段的疯子……",
            "\t[hero]\b[hero]若是不铲除干净，可谓是比那些魔塔塔主们更威胁人类的存在！",
            "\t[黑衣人,E631]\b[this,6,3]啧……看来说不通了。",
            "\t[黑衣人,E631]\b[this,6,3]既然得不到你的帮助……那也就只有请你死在这里了！",
            "\t[黑衣人,E631]\b[this,6,3]来吧！让我们上演一出魔法师之间的厮杀吧！",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "5,8": [
            {
                "type": "setValue",
                "name": "flag:zzta",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "flags.zzta==2",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            7
                        ]
                    }
                ]
            }
        ],
        "7,8": [
            {
                "type": "setValue",
                "name": "flag:zzta",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "flags.zzta==2",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            7
                        ]
                    }
                ]
            }
        ],
        "5,5": [
            {
                "type": "setValue",
                "name": "flag:zzta",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flags.zzta==4)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            4
                        ]
                    }
                ]
            }
        ],
        "7,5": [
            {
                "type": "setValue",
                "name": "flag:zzta",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flags.zzta==4)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            6,
                            4
                        ]
                    }
                ]
            }
        ],
        "6,2": [
            {
                "type": "setBlock",
                "number": "N495",
                "loc": [
                    [
                        6,
                        2
                    ]
                ]
            },
            "\t[黑衣人,N495]\b[this,6,2]唔……看来还是你的造诣更胜一筹啊……",
            "\t[黑衣人,N495]\b[this,6,2]不过你也伤的不轻的样子，哈哈！",
            "\t[黑衣人,N495]\b[this,6,2]你之后应该也没有余力再战斗了吧？那我的任务姑且也算完成了。",
            "\t[hero]\b[hero]咳咳……出血了……魔力没有完全恢复么……但解决你还够用。",
            "\t[hero]\b[hero]你死前还有什么要说的吗？",
            "\t[黑衣人,N495]\b[this,6,2]可惜虚妄家的能力在决斗中派不上什么用场啊……",
            "\t[黑衣人,N495]\b[this,6,2]要是能收集到一个偏战斗型的始祖之力就好了。",
            "\t[黑衣人,N495]\b[this,6,2]本想坚持到最后看看能不能在这惶惑之间捡捡漏的。",
            "\t[黑衣人,N495]\b[this,6,2]看来我也只好提前退场了。",
            "\t[黑衣人,N495]\b[this,6,2]伊杰明，我们在下一个魔塔再见吧！",
            {
                "type": "animate",
                "name": "an",
                "loc": [
                    6,
                    2
                ],
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "waitAsync"
            },
            "\t[hero]\b[hero]可恶……没能彻底解决掉他。",
            "\t[hero]\b[hero]这个巴别塔看来已经没法忽视了。",
            "\t[hero]\b[hero]再放任下去迟早会让这个世界再一次变成大浩劫时的样子。",
            "\t[hero]\b[hero]看来以后有的忙了……",
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        3
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        3
                    ]
                ],
                "remove": true
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,1": [
            {
                "type": "setBlock",
                "number": "N526",
                "loc": [
                    [
                        6,
                        1
                    ]
                ]
            },
            {
                "type": "setValue",
                "name": "flag:zzt1",
                "value": "1"
            },
            "\t[hero]\b[hero]约瑟……",
            "\t[hero]\b[hero]接下来还得看你的了。"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,499,  0,499,  3,  0,509,  0,  3,500,  0,500,10024],
    [10026,  0, 33,  0,  3,  0,683,  0,  3,  0, 33,  0,10024],
    [10026,678,  3, 82,  3, 17,  0, 17,  3, 82,  3,678,10024],
    [10026,  0,  3, 34,  3,  3, 85,  3,  3, 34,  3,  0,10024],
    [10026,  0,677, 34,  3,675,  0,675,  3, 34,677,  0,10024],
    [10026, 81,  3,  3,  3,  0,  0,  0,  3,  3,  3, 81,10024],
    [10026,674,  0, 32,  3,  3, 85,  3,  3, 32,  0,674,10024],
    [10026,  0,  3,  0,  3,678,  0,678,  3,  0,  3,  0,10024],
    [10026, 32,  0,674,  3,  0,  0,  0,  3,674,  0, 32,10024],
    [10026,  3,  3, 81,  3,  3, 83,  3,  3, 81,  3,  3,10024],
    [10026, 88,  0,  0,677,  0,  0,  0,677,  0,  0, 32,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}