main.floors.MT172=
{
    "floorId": "MT172",
    "title": "米娅的酒馆",
    "name": "米娅的酒馆",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": -1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "end.mp3"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[伊杰明,N416]\b[this,12,10]二人的死亡给这个跨越数百年的故事划上了句号。",
        "\t[伊杰明,N416]\b[this,12,10]约瑟与惶惑卿随着名为惶惑之间的魔塔就此一起消失在世界上。",
        "\t[伊杰明,N416]\b[this,12,10]此后再也没人见过他们的身影。",
        "\t[伊杰明,N416]\b[this,12,10]惶惑之间的物语……就这样默默地消失在了历史的尘埃中。",
        "\t[伊杰明,N416]\b[this,12,10]故事就此结束。",
        "\t[孩子,N383]\b[this,9,9]……诶？",
        "\t[孩子,N469]\b[this,12,9]怎么这种结局啊！？",
        "\t[孩子,N701]\b[this,9,10]怎么就这样结束了啊！？",
        "\t[孩子,N383]\b[this,9,9]我们这里出现过的那座魔塔真的就发生了这样的故事吗！？",
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "playBgm",
            "name": "end.mp3",
            "keep": true
        },
        "\b[this,3,12]喂喂喂！别擅自修改故事的结局啊？",
        {
            "type": "setHeroOpacity",
            "opacity": 1,
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up:1"
            ]
        },
        {
            "type": "setBlock",
            "number": "N433",
            "loc": [
                [
                    3,
                    12
                ]
            ],
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[hero]\b[hero]我们这不是活的好好的？",
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    9,
                    9
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    9,
                    10
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    12,
                    9
                ]
            ]
        },
        "\t[伊杰明,N416]\b[this,12,10]哎呀呀……居然这么巧被你听到结尾了？",
        "\t[伊杰明,N416]\b[this,12,10]悲剧才有艺术性……我改的这个结局难道不浪漫吗？",
        "\t[hero]\b[hero]不敢苟同……而且你这家伙是故意恰好时间讲到这里让我们听的吧！？",
        "\t[伊杰明,N416]\b[this,12,10]嗯……这谁知道呢？",
        "\t[孩子,N469]\b[this,12,9]这就是当初救了村子的英雄约瑟吗？",
        "\t[孩子,N383]\b[this,9,9]那……那后面的难道是惶惑卿！？",
        "\t[怀特莉丝,N430]\b[this,3,12]……",
        "\t[hero]\b[hero]嘿……小鬼们，让本人来告诉你们最后的结局吧！",
        {
            "type": "setValue",
            "name": "flag:fz",
            "value": "1"
        },
        {
            "type": "changeFloor",
            "floorId": "MT155",
            "loc": [
                6,
                5
            ],
            "direction": "up"
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.fz==2)",
            "true": [
                "\t[hero]\b[hero]真实情况就是这样。",
                "\t[怀特莉丝,N430]\b[this,3,12]……",
                {
                    "type": "changePos",
                    "direction": "down"
                },
                "\t[hero]\b[hero]怀特莉丝……你脸怎么这么红？",
                "\t[怀特莉丝,N430]\b[this,3,12]啊啊啊！！！",
                "\t[怀特莉丝,N430]\b[this,3,12]你这家伙怎么一点不羞耻地就把这些事情讲出来了啊！",
                {
                    "type": "animate",
                    "name": "hand",
                    "loc": [
                        3,
                        11
                    ]
                },
                "\t[hero]\b[hero]哎呦……疼！",
                "\t[孩子,N383]\b[this,9,9]哇！这就是英雄约瑟啊！",
                "\t[孩子,N469]\b[this,12,9]我以后也要成为一个这样的人物！",
                "\t[伊杰明,N416]\b[this,12,10]呵呵……不愧是你……",
                "\t[伊杰明,N416]\b[this,12,10]确实……这个结局更符合你的风格。",
                "\t[米娅,N335]\b[this,4,5]啊，赫小姐刚才派鸽子来信说她要处理些事情……估计得晚上到。",
                "\t[伊杰明,N416]\b[this,12,10]没听她的加入勇者协会果然是个正确的选择。",
                "\t[伊杰明,N416]\b[this,12,10]公务缠身……啧啧……哪像我们这么自由？",
                {
                    "type": "changePos",
                    "direction": "right"
                },
                "\t[hero]\b[hero]嗯，这点我同意。",
                "\t[hero]\b[hero]不过看来今晚就能久违的聚一聚，还怪让人心潮澎湃的。",
                "\t[伊杰明,N416]\b[this,12,10]哈哈，可不是嘛？",
                "\t[伊杰明,N416]\b[this,12,10]米娅，记得晚上把你家珍藏的那瓶葡萄酒拿出来！",
                "\t[伊杰明,N416]\b[this,12,10]赫比较喜欢那个口味。",
                "\t[米娅,N335]\b[this,4,5]真是的！那酒之前就被你喝掉好多了啦！",
                "\t[hero]\b[hero]米娅！晚上再上一次你那道烤鸡！好久没吃了！怪想念的！",
                "\t[hero]\b[hero]怀特莉丝，你也可以尝尝看？绝对别有一番滋味！",
                "\t[怀特莉丝,N430]\b[this,3,12]真的假的？",
                "\t[米娅,N335]\b[this,4,5]好的！我现在厨艺已经进步神速了！你们就好好期待吧！",
                {
                    "type": "show",
                    "loc": [
                        [
                            1,
                            1
                        ]
                    ]
                },
                "\t[米娅父亲,N357]\b[this,1,1]呃……",
                "\t[伊杰明,N416]\b[this,12,10]呵呵……那么等赫来了后，就是你的主场了，约瑟。",
                "\t[hero]\b[hero]我？",
                "\t[伊杰明,N416]\b[this,12,10]轮到你来讲讲你们旅途中的那些故事了。",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "callSave"
                },
                {
                    "type": "confirm",
                    "text": "可以现在提交成绩（或再逛一逛）",
                    "yes": [
                        {
                            "type": "choices",
                            "text": "选择计分规则",
                            "choices": [
                                {
                                    "text": "生命",
                                    "action": [
                                        "分数为生命。",
                                        "额外的，每把绿钥匙增加1000000分。",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "core.itemCount('greenKey')*1000000"
                                        },
                                        {
                                            "type": "win",
                                            "reason": "故事与旅程仍在继续(生命榜)"
                                        }
                                    ]
                                },
                                {
                                    "text": "钥匙",
                                    "action": [
                                        "分数为1000+蓝钥匙*1000+黄钥匙*500",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "value": "1000+core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000"
                                        },
                                        "额外的，每把绿钥匙增加1000000分。",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "core.itemCount('greenKey')*1000000"
                                        },
                                        {
                                            "type": "win",
                                            "reason": "故事与旅程仍在继续(钥匙榜)"
                                        }
                                    ]
                                },
                                {
                                    "text": "综合",
                                    "action": [
                                        "分数为生命+蓝钥匙*1000+黄钥匙*500+魔力*50",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000+hero.mana*50"
                                        },
                                        "额外的，每把绿钥匙增加1000000分。",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "core.itemCount('greenKey')*1000000"
                                        },
                                        {
                                            "type": "win",
                                            "reason": "故事与旅程仍在继续(综合榜)"
                                        }
                                    ]
                                }
                            ]
                        }
                    ],
                    "no": [
                        {
                            "type": "setValue",
                            "name": "flag:fz",
                            "value": "3"
                        },
                        {
                            "type": "setHeroIcon",
                            "name": "brave.png"
                        },
                        {
                            "type": "changeFloor",
                            "floorId": "MT174",
                            "loc": [
                                3,
                                12
                            ],
                            "direction": "up"
                        }
                    ]
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "1,1": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [143,143,143,143,143,143,143,143,143,143,143,143,143],
    [143,357,90290,90039,90126,90127,143,143,  0,  0,  0,  0,  0],
    [143,90297,90298,90047,90134,90135,  0,  0,  0,  0,  0,  0,  0],
    [143,90305,90306,90161,90142,90143,90051,  0,  0,90048,90050,  0,90189],
    [143,  0,  0,  0,  0,  0,90052,  0,  0,90056,90058,562,90189],
    [143,90183,90049,90049,335,90049,90060,  0,  0,90056,90058,  0,90189],
    [143,90191,90065,90065,90065,90065,90068,  0,  0,90064,90066,  0,  0],
    [143,  0,  0,  0,90183,  0,  0,  0,  0,  0,  0,  0,  0],
    [143,  0,  0,  0,90183,  0,90048,90050,  0,  0,90048,90050,  0],
    [143,90169,  0,  0,90183,567,90056,90058,  0,385,90056,90058,469],
    [143,90169,  0,  0,90183,  0,90056,90058,  0,703,90056,90058,417],
    [143,90169,  0,  0,90191,  0,90064,90066,  0,  0,90064,90066,  0],
    [143,143,143,  0,143,143,143,143,143,143,143,143,143]
],
    "bgmap": [
    [90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90033,90033,90033,90033,90002,90002,90035,90033,90033,90033,90033],
    [90002,90003,90041,90041,90041,90041,90032,90034,90043,90041,90041,90041,90041],
    [90002,90003,90002,90002,90002,90002,90040,90042,90002,90002,90002,90002,90004],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90004],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90004],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90003,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002],
    [90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002,90002]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90039,90186,90039],
    [  0,  0,  0,90160,  0,  0,  0,90184,90183,  0,90047,  0,90047],
    [  0,  0,  0,  0,  0,  0,  0,  0,90191,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90084,  0,  0,  0,90085,  0,  0],
    [  0,  0,90100,90116,90049,90099,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90092,  0,  0,  0,90085,90108,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90110,90092,  0],
    [  0,  0,  0,  0,90183,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,90289,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,90168,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,90055,  0,  0,90055,  0],
    [  0,90053,  0,  0,  0,  0,  0,  0,90055,  0,  0,90055,  0],
    [  0,90064,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90191,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90191,90055,  0,  0,90055,90055,  0,  0,90055],
    [  0,  0,  0,  0,90191,90055,  0,  0,90055,90055,  0,  0,90055],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90116,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}