main.floors.MT174=
{
    "floorId": "MT174",
    "title": "米娅的酒馆",
    "name": "米娅的酒馆",
    "width": 23,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "sj": -1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[四重密室,ms.png]首先恭喜你能够一路过关来到这里。",
        "\t[四重密室,ms.png]我是编剧四重密室。",
        "\t[四重密室,ms.png]自第一次做了虚妄之间后，我就一直想出一部故事能更完整的作品。",
        "\t[四重密室,ms.png]于是就有了这部惶惑之间。",
        "\t[四重密室,ms.png]由于中间间隔时间好像有点长了，本人脑子也不太清醒。",
        "\t[四重密室,ms.png]所以作为续作的惶惑如果被深究的话，或许会被找出不少与前作虚妄有冲突的设定。",
        "\t[四重密室,ms.png]嗯……应该也没人会这么无聊去挖吧。",
        "\t[四重密室,ms.png]但总之……感谢你能通关本游戏。",
        "\t[四重密室,ms.png]希望你能喜欢这个故事。",
        {
            "type": "setCurtain",
            "time": 500
        }
    ],
    "eachArrive": null,
    "parallelDo": "",
    "events": {
        "5,9": [
            {
                "type": "choices",
                "text": "与谁对话？",
                "choices": [
                    {
                        "text": "约瑟",
                        "action": [
                            "\t[约瑟,N705]\b[this]这次的冒险可谓是一波三折啊。",
                            "\t[约瑟,N705]\b[this]不过在本人精湛的技艺与灵活的头脑下，自然什么魔塔都不在话下！哈哈哈！",
                            "\t[约瑟,N705]\b[this]没办法……我就是这么一个风度与实力并存的潇洒旅人。",
                            "\t[约瑟,N705]\b[this]其实原设定里我还有着不少炫酷的技能。",
                            "\t[约瑟,N705]\b[this]像是什么燕穿林，三伏，雾匿牙，刃戏之类的剑招。",
                            "\t[约瑟,N705]\b[this]这样才对得起我天才剑士的设定。",
                            "\t[约瑟,N705]\b[this]但是59没给我做！",
                            "\t[约瑟,N705]\b[this]导致只有鬼斩……然后是鬼斩！",
                            "\t[约瑟,N705]\b[this]这样的情况。",
                            "\t[约瑟,N705]\b[this]不得不说真是一大遗憾啊。",
                            {
                                "type": "turnBlock",
                                "direction": "right",
                                "loc": [
                                    [
                                        5,
                                        9
                                    ]
                                ]
                            }
                        ]
                    },
                    {
                        "text": "怀特莉丝",
                        "action": [
                            {
                                "type": "turnBlock",
                                "direction": "right",
                                "loc": [
                                    [
                                        5,
                                        9
                                    ]
                                ]
                            },
                            {
                                "type": "turnBlock",
                                "direction": "up",
                                "loc": [
                                    [
                                        5,
                                        10
                                    ]
                                ]
                            },
                            "\t[怀特莉丝,N430]\b[this,5,10]我是怀特莉丝。",
                            "\t[怀特莉丝,N430]\b[this,5,10]你们也可以尊称我为惶惑卿。",
                            "\t[怀特莉丝,N430]\b[this,5,10]身为塔之始祖……却被囚禁了几百年……",
                            "\t[怀特莉丝,N430]\b[this,5,10]真是屈辱啊！",
                            "\t[怀特莉丝,N430]\b[this,5,10]虽然大仇已报……但还是咽不下这口气！",
                            "\t[怀特莉丝,N430]\b[this,5,10]闻斯莫提！我还要再杀你一万遍啊！",
                            {
                                "type": "turnBlock",
                                "direction": "down",
                                "loc": [
                                    [
                                        8,
                                        5
                                    ]
                                ]
                            },
                            "\t[闻斯莫提,N611]\b[this,8,5]噫！已老实！求放过！",
                            {
                                "type": "turnBlock",
                                "direction": "right",
                                "loc": [
                                    [
                                        8,
                                        5
                                    ]
                                ]
                            },
                            {
                                "type": "turnBlock",
                                "direction": "right",
                                "loc": [
                                    [
                                        5,
                                        10
                                    ]
                                ]
                            }
                        ]
                    }
                ]
            }
        ],
        "8,9": [
            "\t[伊杰明,N416]\b[this]在下就是集万千才华于一身，掌握的魔法技术之多堪称繁星点点，游走于整个大陆，写下无数影响文坛的巨作的诗豪伊杰明。",
            "\t[伊杰明,N416]\b[this]嗯……没有我这个金牌辅助，这故事可没法进行下去呀。",
            "\t[伊杰明,N416]\b[this]所以还请各位赏脸支持一下由在下本人为主场的凝滞之间吧！",
            "\t[伊杰明,N416]\b[this]虽然以体量来说，只能算是夹在虚妄与惶惑外传作品。",
            "\t[伊杰明,N416]\b[this]但由在下担任主角，难道还不够有分量吗！？",
            "\t[伊杰明,N416]\b[this]在下的粉丝们！快前去支持我！",
            "\t[莉莉安,N709]\b[this,8,10]你真的有粉丝吗？",
            "\t[莉莉安,N709]\b[this,8,10]等等……这么一看的话……",
            "\t[莉莉安,N709]\b[this,8,10]岂不是这几部游戏里只有我是悲剧女主角！？",
            {
                "type": "turnBlock",
                "direction": "left",
                "loc": [
                    [
                        8,
                        9
                    ]
                ]
            }
        ],
        "4,6": [
            "\t[米娅,N335]\b[this,4,5]这里是米娅的酒馆哦！",
            "\t[米娅,N335]\b[this,4,5]悄悄说个秘密……",
            "\t[米娅,N335]\b[this,4,5]其实我是原案的女主！",
            "\t[米娅,N335]\b[this,4,5]但是可恶的作者中途把我给改了！",
            "\t[米娅,N335]\b[this,4,5]变成勉强当个吉祥物的定位了！",
            "\t[米娅,N335]\b[this,4,5]唔嗯嗯……越想越气啊！"
        ],
        "6,4": [
            "\t[米娅父亲,N357]\b[this,5,4]要不是有着米娅父亲这一层关系，我都进不来这酒馆。",
            "\t[米娅父亲,N357]\b[this,5,4]明明这是我开的啊？"
        ],
        "9,9": [
            "\t[赫,N426]\b[this]……",
            "\t[赫,N426]\b[this]呃……一下子有点不知道该说什么……",
            "\t[赫,N426]\b[this]总之我是赫，应该有玩家游玩中也发现了我就是绘塔中的那个小女孩。",
            "\t[赫,N426]\b[this]总之经过一番磨砺后，自己确实也算是接近当初那个画中的自己了。",
            "\t[赫,N426]\b[this]不过为什么最后一幕是我缺席啊！？",
            "\t[赫,N426]\b[this]作者你最好给我一个说法！",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "8,5": [
            "\t[闻斯莫提,N611]\b[this,8,5]最为篇幅最长的boss，我定是远远超越了那凝滞之间的恶魔，那绘塔的卢卡斯，那虚妄的虚妄家！",
            "\t[卢卡斯,N714]\b[this,11,5]嘿嘿……虽然我不算始祖……但至少比凝滞的恶魔强点，那东西都没资格进这个地方。",
            "\t[虚妄家,N713]\b[this,11,4]唉……版本更新后好消息是我定位变成了十二始祖之一。",
            "\t[虚妄家,N713]\b[this,11,4]但坏消息是……我是始祖里面最弱的一个！",
            {
                "type": "turnBlock",
                "direction": "right",
                "loc": [
                    [
                        8,
                        5
                    ]
                ]
            }
        ],
        "11,5": [
            "\t[闻斯莫提,N611]\b[this,8,5]最为篇幅最长的boss，我定是远远超越了那凝滞之间的恶魔，那绘塔的卢卡斯，那虚妄的虚妄家！",
            "\t[卢卡斯,N714]\b[this,11,5]嘿嘿……虽然我不算始祖……但至少比凝滞的恶魔强点，那东西都没资格进这个地方。",
            "\t[虚妄家,N713]\b[this,11,4]唉……版本更新后好消息是我定位变成了十二始祖之一。",
            "\t[虚妄家,N713]\b[this,11,4]但坏消息是……我是始祖里面最弱的一个！",
            {
                "type": "turnBlock",
                "direction": "left",
                "loc": [
                    [
                        11,
                        5
                    ]
                ]
            }
        ],
        "12,9": [
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        12,
                        10
                    ]
                ]
            },
            "\t[格兰姆,N410]\b[this]我是格兰姆。",
            "\t[芙朵,N436]\b[this,12,10]我是芙朵。",
            "\t[格兰姆,N410]\b[this]还能在这有个一席之地真是谢过了！",
            "\t[芙朵,N436]\b[this,12,10]其实我们原本设定也是队友之一。",
            "\t[格兰姆,N410]\b[this]结果后面就修改队友变成了我们的赫老师了。",
            {
                "type": "turnBlock",
                "direction": "left"
            },
            {
                "type": "turnBlock",
                "direction": "left",
                "loc": [
                    [
                        12,
                        10
                    ]
                ]
            }
        ],
        "13,9": [
            "\t[莉雅朵洛,N581]\b[this]真是无语了……",
            "\t[莉雅朵洛,N581]\b[this]执行个任务以为能发财。",
            "\t[莉雅朵洛,N581]\b[this]结果把命搭进去了。",
            "\t[莉雅朵洛,N581]\b[this]再也不相信人类了。",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "16,9": [
            "\t[克洛德,N590]\b[this]我高低也算个主角属性吧！",
            "\t[克洛德,N590]\b[this]我告诉你们！其实斩龙剑在设定里的定位是很高的！",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "16,10": [
            "\t[佛修斯,N607]\b[this]唉……果真人生就是悲剧……",
            "\t[佛修斯,N607]\b[this]一点也没错。",
            {
                "type": "turnBlock",
                "direction": "left"
            }
        ],
        "14,4": [
            "\t[黑骑士,this]\b[this]作为游戏中的重量级角色。",
            "\t[黑骑士,this]\b[this]这作者连个名字都不给我！",
            "\t[黑骑士,this]\b[this]我忍不了了！在这里必须得公布出来！",
            "\t[黑骑士,this]\b[this]我的名字是埃蒙德·纽特！",
            "\t[黑骑士,this]\b[this]而且我这么有故事的一个角色……是不是欠我一个黑骑士dlc啊！",
            "\t[黑骑士,this]\b[this]顺便告诉你们个秘密。",
            "\t[黑骑士,this]\b[this]最初的原案里还设定过我是穿越回过去的约瑟。"
        ],
        "18,9": [
            "\t[无名,N718]\b[this]……",
            "\t[无名,N718]\b[this]我是前作虚妄之间的主角无名。",
            "\t[无名,N718]\b[this]和本作的主角约瑟一样，是个漂泊者。",
            "\t[无名,N718]\b[this]嗯……按照设定我的名字就是无名这两个字。",
            "\t[无名,N718]\b[this]虚妄之间的结尾确实是四重密室写到后面摆烂了。",
            "\t[无名,N718]\b[this]导致我的结局看起来很随便（握拳）",
            "\t[无名,N718]\b[this]不过还是希望没玩过前作的能去游玩一下。",
            "\t[无名,N718]\b[this]支持我这位“前辈” 。",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "18,10": [
            "\t[莉姆,this]\b[this]我是虚妄之间的妖精莉姆！",
            "\t[莉姆,this]\b[this]说到魔塔，就不得不提陪伴勇者的妖精伙伴。",
            "\t[莉姆,this]\b[this]这是经典设定。",
            "\t[莉姆,this]\b[this]可惜……陪伴我的不是勇者……是一个神经不太对的漂泊者。",
            "\t[莉姆,this]\b[this]如果有人气投票的话，记得投我哦！"
        ],
        "21,9": [
            {
                "type": "choices",
                "text": "与谁对话？",
                "choices": [
                    {
                        "text": "希斯塔露",
                        "action": [
                            "\t[希斯塔露,N722]\b[this]大家好，我是虚妄之间中的圣女。",
                            "\t[希斯塔露,N722]\b[this]最近总能见到玩家群体里吐槽圣女鸡肋和花瓶。",
                            "\t[希斯塔露,N722]\b[this]而我想说的是……",
                            "\t[希斯塔露,N722]\b[this]四重密室就是要把我设定成工具人，我也很无奈啊！",
                            "\t[西德,N730]\b[this]要论工具人……我才是……",
                            "\t[卡修,E688]\b[this]嗯……",
                            {
                                "type": "turnBlock",
                                "direction": "left"
                            }
                        ]
                    },
                    {
                        "text": "温蒂",
                        "action": [
                            {
                                "type": "turnBlock",
                                "direction": "left"
                            },
                            {
                                "type": "turnBlock",
                                "direction": "up",
                                "loc": [
                                    [
                                        21,
                                        10
                                    ]
                                ]
                            },
                            "\t[温蒂,N726]\b[this,21,10]嗯？这酒馆还有我的份？",
                            "\t[温蒂,N726]\b[this,21,10]怎样都好啦……这烤鸡确实比烤蝙蝠好吃多了。",
                            {
                                "type": "turnBlock",
                                "direction": "left",
                                "loc": [
                                    [
                                        21,
                                        10
                                    ]
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "type": "turnBlock",
                "direction": "left",
                "loc": [
                    [
                        0,
                        0
                    ]
                ]
            }
        ],
        "18,5": [
            "\t[黑衣人,this]\b[this]话说……我身为设定里很有分量的角色……",
            "\t[黑衣人,this]\b[this]也和黑骑士一样没有名字啊！？",
            "\t[黑衣人,this]\b[this]总之我叫希斯汀！",
            "\t[黑衣人,this]\b[this]巴别塔这个组织一看就是作者用来挖坑的。",
            "\t[黑衣人,this]\b[this]填不填就不得而知了。",
            "\t[黑衣人,this]\b[this]唉……感觉游戏里我光吃瘪了。"
        ],
        "21,5": [
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        21,
                        4
                    ]
                ]
            },
            "\t[霍尔,N739]\b[this]……克拉克？我们这是到来哪了？",
            "\t[克拉克,N735]\b[this,21,3]没想到我们两还给算进去了！",
            "\t[克拉克,N735]\b[this,21,3]呃，这里说一下，我们来自魔塔《墓行》。",
            "\t[霍尔,N739]\b[this]和其他人不是一个世界观的。",
            "\t[克拉克,N735]\b[this,21,3]总之感谢作者愿意让我们露一下脸！",
            {
                "type": "turnBlock",
                "direction": "left"
            },
            {
                "type": "turnBlock",
                "direction": "left",
                "loc": [
                    [
                        21,
                        4
                    ]
                ]
            }
        ],
        "18,4": [
            "\t[村长,N440]\b[this]我偷偷溜进来的，别告诉别人啊。",
            {
                "type": "turnBlock",
                "direction": "right"
            }
        ],
        "3,12": [
            {
                "type": "confirm",
                "text": "要回到标题画面吗？",
                "yes": [
                    {
                        "type": "restart"
                    }
                ],
                "no": []
            }
        ],
        "2,6": [
            {
                "type": "choices",
                "choices": [
                    {
                        "text": "查看音乐列表",
                        "action": [
                            "魔塔《惶惑之间》配乐一览：\n⓪标题：Exposed - Down By The Hills\n①剧情曲1：ACE+ - 機の律動\n②提亚之森：V.A. - 光の輪廻\n③剧情曲2：RMXP - BGM曲026-Town04\n④剧情曲3：不详，来自其他魔塔作品\n⑤魔塔0-10层：Lightscape - Collapsing World\n⑥魔塔地下1-10层：Otokaze - 彩月​-​Sai​-​getsu-\n⑦遗迹：Otokaze - 雨道\n⑧第二次魔塔地下1-10层：Quazar - Funky Stars\n⑨黑骑士区：Janji - Horizon",
                            "⑩剧情曲4：Nightwish - She Is My Sin（纯音乐版）\n⑪森林之塔：m-taku - Komorebi\n⑫剧情曲5：RMXP - BGM曲017-Theme06\n⑬剧情曲6：不详，来自其他魔塔作品\n⑭熔岩之塔：ParagonX9 - Chaoz Airflow\n⑮冰原之塔：Feint - My Sunset (Original Mix)\n⑯约瑟回忆：雾江月 - Eternal Snow\n⑰ 最终之塔1-10层：BeMax - Sea of Tranquility\n⑱最终之塔11-20层：徐梦圆 - ninelie(Easylistening)\n⑲与惶惑卿的决战：RADWIMPS - 東京上空\n⑳结尾：Akinobu - Perfect World"
                        ]
                    },
                    {
                        "text": "切换音乐",
                        "action": [
                            {
                                "type": "choices",
                                "choices": [
                                    {
                                        "text": "指定音乐",
                                        "action": [
                                            {
                                                "type": "input",
                                                "text": "要换哪首歌呢？（输入0-20，之外的数字不切换音乐）"
                                            },
                                            {
                                                "type": "setValue",
                                                "name": "flag:ooo",
                                                "value": "flags.input"
                                            }
                                        ]
                                    },
                                    {
                                        "text": "随机音乐",
                                        "action": [
                                            {
                                                "type": "setValue",
                                                "name": "flag:ooo",
                                                "value": "Math.floor((Math.random() * 21))"
                                            }
                                        ]
                                    },
                                    {
                                        "text": "保持不变",
                                        "action": [
                                            {
                                                "type": "setValue",
                                                "name": "flag:ooo",
                                                "value": "-1"
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "type": "tip",
                                "text": "音乐${flags.ooo}号已开始加载"
                            },
                            {
                                "type": "switch",
                                "condition": "flags.ooo",
                                "caseList": [
                                    {
                                        "case": "0",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "00.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "1",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "fightstart.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "2",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "light.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "3",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "happy.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "4",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "wx.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "5",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "1-10.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "6",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "b1-b10.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "7",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "yj.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "8",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "b.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "9",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "3.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "10",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "bz.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "11",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "sl.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "12",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "jg.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "13",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "bd.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "14",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "ry.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "15",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "by.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "16",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "hy.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "17",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "zz.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "18",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "jw0.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "19",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "htls.mp3",
                                                "keep": true
                                            }
                                        ]
                                    },
                                    {
                                        "case": "20",
                                        "action": [
                                            {
                                                "type": "playBgm",
                                                "name": "end.mp3",
                                                "keep": true
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "text": "取消",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143],
    [143,90289,90290,90039,90126,90127,143,143,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,143],
    [143,90297,90298,90047,90134,90135,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,143],
    [143,90305,90306,90161,90142,90143,90051, 17,90191,90048,90050,  0,90189,90157,90158,90159,90189,90191,  0,90048,90050,  0,143],
    [143,  0,  0,  0,  0,359,90052,  0,  0,90056,90058,713,90189,  0,693,  0,90189,  0,442,90056,90058,736,143],
    [143,90183,90049,90049,335,90049,90060,  0,613,90056,90058,715,90189,  0,  0,  0,90189,  0,734,90056,90058,740,143],
    [143,90191,90065,90065,90065,90065,90068,  0,  0,90064,90066,  0,  0,  0,90189,  0,  0,  0,  0,90064,90066,  0,143],
    [143,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,143],
    [143,  0,  0,  0,90183,  0,90048,90050,  0,  0,90048,90050,  0,  0,90048,90050,  0,  0,  0,90048,90050,  0,143],
    [143,90169,  0,  0,90183,707,90056,90058,417,428,90056,90058,411,583,90056,90058,591,  0,720,90056,90058,723,143],
    [143,90169,  0,  0,90183,432,90056,90058,710,  0,90056,90058,437,  0,90056,90058,608,  0,124,90056,90058,727,143],
    [143,90169,  0,  0,90191,  0,90064,90066,  0,  0,90064,90066,  0,  0,90064,90066,  0,90169,  0,90064,90066,  0,143],
    [143,143,143,  0,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143,143]
],
    "bgmap": [
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,90004,90004,90004,90004,90004,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,90004,90004,90004,90004,90004,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,90004,90004,90004,90004,90004,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30001,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90039,90186,90039,90178,  0,90178,  0,90039,  0,90038,  0,90039,  0],
    [  0,  0,  0,90160,  0,  0,  0,90184,90183,  0,90047,  0,90047,90149,90150,90151,  0,90047,  0,  0,  0,90047,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90084,  0,  0,90100,90108,  0,  0,  0,  0,  0,  0,  0,  0,90108,90084,  0,  0],
    [  0,  0,90063,90116,90049,90099,  0,  0,  0,90108,90092,  0,  0,  0,  0,  0,  0,  0,  0,90092,90108,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90183,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90108,90092,  0,  0,90110,90094,  0,  0,90109,90093,  0,  0,  0,363,364,  0,  0],
    [  0,  0,  0,  0,  0,  0,90091,90108,  0,  0,90102,90110,  0,  0,90101,90109,  0,  0,  0,362,361,  0,  0],
    [  0,  0,  0,  0,90183,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,90033,90033,90033,90033,90033,  0,  0,90035,90033,90033,90033,90033,90033,90033,90033,90033,90033,90033,90033,90033,90033,  0],
    [  0,90041,90041,90041,90041,90041,90032,90034,90043,90041,90041,90041,90041,90041,90041,90041,90041,90041,90041,90041,90041,90041,  0],
    [  0,  0,  0,90168,  0,  0,90040,90042,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,90055,  0,  0,90055,  0,  0,90055,  0,  0,  0,90055,  0,  0,90055,  0],
    [  0,90048,  0,  0,  0,  0,  0,  0,90055,  0,  0,90055,  0,  0,  0,  0,  0,  0,90055,  0,  0,90055,  0],
    [  0,90067,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90191,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90191,90055,  0,  0,90055,90055,  0,  0,90055,90055,  0,  0,90055,  0,90055,  0,  0,90055,  0],
    [  0,  0,  0,  0,90191,90055,  0,  0,90055,90055,  0,  0,90055,90055,  0,  0,90055,  0,90055,  0,  0,90055,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90183,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90116,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}