main.floors.MT18=
{
    "floorId": "MT18",
    "title": "魔塔 1 层",
    "name": "魔塔 1 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": null,
    "weather": null,
    "firstArrive": [
        "\t[hero]\b[hero]（即使双人同时进入魔塔……也基本会被送入不同的空间。）",
        "\t[hero]\b[hero]（即使都处于构造一摸一样的第一层，也都是独立的空间。）",
        "\t[hero]\b[hero]（这就是为什么魔塔无法靠军队来讨伐的原因。）",
        "\t[hero]\b[hero]（但两人同时出现在一个空间的可能性也并不是没有，这一切都是看运气。）",
        "\t[hero]\b[hero]（不过那个家伙让我难以看透……或许遇不到才更走运些。）",
        {
            "type": "autoText",
            "text": "左侧状态栏内生命下方为抑制器的魔力\\i[mana]，每次战斗后会减少2点魔力（观剧和正常难度减少1点）。当抑制器魔力归零后，主角将丧失理智，游戏结束。",
            "time": 5000
        },
        "目前抑制器的魔力值处于危险状态，请尽快找寻补充抑制器魔力的魔晶块。",
        {
            "type": "choices",
            "text": "非正常难度下，1区的魔力可能有点吃紧，需要领取50魔力使游玩更轻松吗？（如果不领取，可获得成就道具绿钥匙，每一把在提交成绩时有大量分数）",
            "choices": [
                {
                    "text": "50魔力",
                    "action": [
                        {
                            "type": "setValue",
                            "name": "status:mana",
                            "operator": "+=",
                            "value": "50"
                        }
                    ]
                },
                {
                    "text": "绿钥匙",
                    "action": [
                        {
                            "type": "setValue",
                            "name": "item:greenKey",
                            "operator": "+=",
                            "value": "1"
                        }
                    ]
                }
            ]
        },
        {
            "type": "switch",
            "condition": "flags.hard",
            "caseList": [
                {
                    "case": "1",
                    "action": [
                        "观剧模式下的补给，额外获得5黄钥匙2蓝钥匙",
                        {
                            "type": "setValue",
                            "name": "item:yellowKey",
                            "operator": "+=",
                            "value": "5"
                        },
                        {
                            "type": "setValue",
                            "name": "item:blueKey",
                            "operator": "+=",
                            "value": "2"
                        }
                    ]
                },
                {
                    "case": "2",
                    "action": [
                        "正常模式下的补给，额外获得3黄钥匙1蓝钥匙",
                        {
                            "type": "setValue",
                            "name": "item:yellowKey",
                            "operator": "+=",
                            "value": "3"
                        },
                        {
                            "type": "setValue",
                            "name": "item:blueKey",
                            "operator": "+=",
                            "value": "1"
                        }
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,8": [
            "来到了新的区域，可以听听以下建议：\n1.魔力\\i[mana]在本游戏中是和生命力\\i[hp]同样重要的资源。如果魔力降低到了0，那游戏同样会立刻失败。在不过量使用技能\\i[skill1]、不击杀不必要的怪物、及时拿到补给资源\\i[I356]的情况下，完全不用担心魔力不够的情况，低难度尤其如此。\n2.现在击败怪物能提供金币\\i[money]了，金币在下一区域将能用于兑换武器、装备、道具等物品。如果你的血量和魔力充足，可以尽量多的击杀怪物。\n3.高难度下，魔力的使用是需要非常考究的。你必须需要使用技能来降低战斗伤害、击败闲置怪物获得更多金币。这些行动都会额外消耗你的魔力，稍有不慎就会陷入魔力匮乏的困局，请发挥你的智慧吧。",
            "4.现在有了新的资源钥匙，按珍贵程度分为黄钥匙\\i[yellowKey]、蓝钥匙\\i[blueKey]、红钥匙\\i[redKey]、绿钥匙\\i[greenKey]。你拥有的黄、蓝、红钥匙数量用对应的颜色以两位数字显示在状态栏。\n钥匙可以打开对应颜色的堵路的门，如消耗1把黄钥匙\\i[yellowKey]可以打开一扇黄门\\i[yellowDoor]。不同的门承担着障碍、绕怪、资源的交换等作用，并且门的数量远大于钥匙的数量，谨慎的选择钥匙的使用吧。\n最后，游玩建议是先拿到增加大量属性的剑和盾，优先用钥匙开启能获得宝石的门，以及在不得不与高强度怪物提前战斗时使用技能。",
            "此外，手机玩家要使用技能时，除了进入背包点击图标外，还可以点击难度的位置（观剧、正常）切换到数字键界面。该界面下数字1-4是技能的释放，5-6是存读档，7是轻按键。Alt键暂时不需要掌握。再次点击难度的位置就能换回初始界面啦。"
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "4,1": [
            "点击工具栏的该图标\\i[fly]可以让你快捷地在去过的楼层中传送，也可以用快捷键G使用。"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 21,353,  1, 46,  0, 88,  1,  0, 81,  0, 87,10024],
    [10026,  0, 31,  1,  1,  0,  1,  1,  0,  1,  1,  1,10024],
    [10026,217,  0,  1,  0,  0,  0,  1,233,  1, 21, 32,10024],
    [10026, 81,  1,  1,  0,  0,  0,  1,  0,  1, 31,354,10024],
    [10026,  0,  0,  1,  1,  0,  1,  1,  0,  1,  1, 82,10024],
    [10026,  0,  0,233,  0,  0,  0,248,  0,  1,  0,233,10024],
    [10026,  0,  0,  1,  0,  0,  0,  1,  0, 81,248,  0,10024],
    [10026, 81,  1,  1,  1,  0,  1,  1,  0,  1,  1,  1,10024],
    [10026,209,  0,  1, 21, 22, 21,  1,206,  1,  0, 21,10024],
    [10026,  0, 21,  1, 32, 21, 32,  1,  0, 81,  0, 21,10024],
    [10026, 31,352,  1, 21, 32, 21,  1,  0,  1, 21, 21,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,129,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}