main.floors.MT19=
{
    "floorId": "MT19",
    "title": "魔塔 2 层",
    "name": "魔塔 2 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": null,
    "weather": null,
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 22,  1,  0,  0,209,  0,233, 81,210,  1, 88,10024],
    [10026, 21,  1,206,  1,  0,353,  0,  1,  0,  0,  0,10024],
    [10026,  0, 81,  0,  1, 32,  0, 21, 82,248,  1,  0,10024],
    [10026,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,248,10024],
    [10026,  0,  0,  0,  1, 21,  0,  0,  1, 31,  0,  0,10024],
    [10026, 87,  0,233, 81,  0,  0,248, 81,  0,  0,  0,10024],
    [10026,  0,  0,  0,  1,  0,  0,  0,  1, 31,  0,  0,10024],
    [10026,  1,  1,  1,  1, 81,  1,  1,  1,  1,  1,233,10024],
    [10026,352,217,  0,  1,  0,  1, 21, 21,  0,  1,  0,10024],
    [10026,354,  1,  0,  1,209,  1, 21, 22,  0,  1,  0,10024],
    [10026, 31,  1,  0, 81,  0,  1,  0,  0,217, 81,  0,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}