main.floors.MT20=
{
    "floorId": "MT20",
    "title": "魔塔 3 层",
    "name": "魔塔 3 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": null,
    "weather": null,
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,353,354, 31, 21,  1,352,  0,  1,  0, 31, 31,10024],
    [10026,  0,  0,  0,  0,  1,  0, 21,  1, 81,  1,  1,10024],
    [10026, 82,  1,  1,210,  1, 21,  0,  1,209,  0,  0,10024],
    [10026,  0,  0,  0,  0,  1,  0,217, 81,  0,  0,233,10024],
    [10026,  1,  1, 81,  1,  1,  1,  1,  1,  1,  1, 81,10024],
    [10026, 88,  0,  0,248,  0,  0,  0,233,  0,  0,  0,10024],
    [10026,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,209,10024],
    [10026,  0,  0, 81,  0,  1,248,  1,  0,  0, 81,  0,10024],
    [10026, 86,  1,  1,  0,  1,  0,  1,248,248,  1,  0,10024],
    [10026,  0,  0,  1,  0,  1,  0,  1, 21, 21,  1,  0,10024],
    [10026, 35,  0,  1,  0,233,  0,  1, 21, 21,  1, 87,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}