main.floors.MT28=
{
    "floorId": "MT28",
    "title": "村长家",
    "name": "村长家",
    "width": 15,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up:2"
            ]
        },
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "playBgm",
            "name": "wx.mp3",
            "keep": true
        },
        "\t[hero]\b[hero]呦！怎么人还不少啊？",
        "\t[伊杰明,N416]\b[this,7,4]呵呵……怎么样，我就说他死不了吧？",
        "\t[赫,N426]\b[this,10,4]……",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    5,
                    6
                ]
            ]
        },
        "\t[村长,N440]\b[this,5,6]约瑟先生，您救了村里的人，我向你表示衷心的谢意。",
        "\t[村长,N440]\b[this,5,6]您就是我们村子的英雄。",
        "\t[hero]\b[hero]没事没事，不过是举手之劳。",
        "\t[村长,N440]\b[this,5,6]虽然再拜托你事情有些强人所难，但是……约瑟先生，我还是不得不恳求您救救我们村子。",
        "\t[伊杰明,N416]\b[this,7,4]放心放心，像约瑟这么富有正义感的游者自然是不会对此劫坐视不理的。哈哈哈。",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "left:1",
                "up:2"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    5,
                    6
                ]
            ]
        },
        "\t[hero]\b[hero]……是要集结战力对付魔塔吧。",
        "\t[hero]\b[hero]这里面的几个人就是村长你挑选出来的最适合挑战魔塔的人选了吧？",
        "\t[村长,N440]\b[this,5,6]是的。",
        "\t[村长,N440]\b[this,5,6]这是伊杰明大师，想必已经不需要介绍了。",
        "\t[hero]\b[hero]（这家伙什么时候又成大师了？）",
        "\t[伊杰明,N416]\b[this,7,4]没错，集万千才华于一身，掌握的魔法技术之多堪称繁星点点，游走于整个大陆，写下无数影响文坛的巨作的诗豪伊杰明，就是在下了。",
        "\t[hero]\b[hero]谁问你了？",
        "\t[村长,N440]\b[this,5,6]这位是王国的勇者，赫小姐。",
        "\t[赫,N426]\b[this,10,4]你好。",
        "\t[村长,N440]\b[this,5,6]以及她的负责带领的见习勇者芙朵小姐。",
        "\t[村长,N440]\b[this,5,6]另一位见习勇者是您上午救的格兰姆先生，现在安排在医疗所养伤。",
        "\t[赫,N426]\b[this,10,4]感谢你让格兰姆那小子捡回了条命。",
        "\t[hero]\b[hero]不客气。",
        "\t[村长,N440]\b[this,5,6]上午赫小姐一人在外探索时，发现了些很不妙的情况。",
        "\t[赫,N426]\b[this,10,4]方圆二十里左右的地界被不明的魔力给笼罩了。",
        "\t[赫,N426]\b[this,10,4]若是像我们这类对魔力有一定掌控力的人倒也可以突破出去。但这里的村民就绝对没可能。",
        "\t[赫,N426]\b[this,10,4]而且，这层魔力是在持续变化的。",
        "\t[伊杰明,N416]\b[this,7,4]就代表时间拖的越久，就越牢固。到时候就连我们都无法突破啦！",
        "\t[伊杰明,N416]\b[this,7,4]怎么样？很有意思吧？这就是一些高级魔塔才拥有的能力！",
        "\t[hero]\b[hero]也就是说……如果我们这几个有一定战斗力的人想逃的话……就只能趁现在。",
        "\t[hero]\b[hero]不过看你们的意思，都准备留在这里保护村子了。",
        "\t[伊杰明,N416]\b[this,7,4]呵呵……像赫小姐这样的王国勇者自然不会选择退缩。",
        "\t[伊杰明,N416]\b[this,7,4]而我则是相信，加上你，我们绝对有希望攻下这座魔塔。",
        "\t[hero]\b[hero]……你为什么这么有信心？",
        "\t[伊杰明,N416]\b[this,7,4]呵呵，你从黑骑士的手下活了下来，虽然不知道你是怎么做到的。",
        "\t[伊杰明,N416]\b[this,7,4]但这也证明你的实力够用了。",
        "\t[伊杰明,N416]\b[this,7,4]在我们准备充分的情况下，黑骑士也并非不能打败。",
        "\t[hero]\b[hero]准备充分？",
        "\t[伊杰明,N416]\b[this,7,4]你也经历过了吧？虽然魔塔中每一层都能分为多个不同的平行空间。",
        "\t[伊杰明,N416]\b[this,7,4]但我们也并非无法在同一层中相遇。",
        "\t[伊杰明,N416]\b[this,7,4]所以，如果我们能够同时出现在一起。",
        "\t[伊杰明,N416]\b[this,7,4]那胜算就能大幅提升。",
        "\t[hero]\b[hero]但如果做得到在同一层相遇这种事情，王国早就能组织勇者推平这些魔塔了。",
        "\t[伊杰明,N416]\b[this,7,4]这种事情未必做不到。",
        {
            "type": "move",
            "loc": [
                7,
                4
            ],
            "time": 200,
            "keep": true,
            "steps": [
                "left:3",
                "down:4",
                "right:5"
            ]
        },
        {
            "type": "changePos",
            "direction": "left"
        },
        "\t[伊杰明,N416]\b[this,9,8]约瑟，请把你的手伸出来。",
        "伊杰明握住约瑟的手。",
        {
            "type": "animate",
            "name": "yongchang",
            "loc": [
                9,
                8
            ]
        },
        "\t[hero]\b[hero]！！？",
        "\t[伊杰明,N416]\b[this,9,8]嗯，没问题了。还请再收下这个。",
        {
            "type": "setValue",
            "name": "item:I351",
            "operator": "+=",
            "value": "1"
        },
        "\t[hero]\b[hero]这是？",
        "\t[伊杰明,N416]\b[this,9,8]这是我旅途中探索各类魔塔时找到的。",
        "\t[伊杰明,N416]\b[this,9,8]配合上秘术·跃印，可以让你在某一层塔中呼唤另一位持有此物的人。",
        "\t[伊杰明,N416]\b[this,9,8]这样你就可以在其中一层将我们召唤过来了。",
        "\t[hero]\b[hero]竟然会有这样的东西？",
        "\t[伊杰明,N416]\b[this,9,8]啊……不过事件结束之后可要还给我啊。",
        "\t[伊杰明,N416]\b[this,9,8]我一共也只持有三个，现在都借用给你们了。",
        "\t[伊杰明,N416]\b[this,9,8]还有一件事，这东西的使用次数有限，恐怕最多只能使用四回。",
        "\t[伊杰明,N416]\b[this,9,8]如何增加次数我还没能研究出来。谨慎使用为好，不过我们也可以在塔内通过这个进行远程通信。",
        "\t[伊杰明,N416]\b[this,9,8]这样交流情报也会方便多了。",
        "\t[赫,N426]\b[this,10,4]如果你带着这东西来勇者组织的话……可是能给你无法想象的报酬的。",
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    9,
                    8
                ]
            ]
        },
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[伊杰明,N416]\b[this,9,8]哈哈……饶了我吧。我可不想被强制收编。",
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    9,
                    8
                ]
            ]
        },
        "\t[伊杰明,N416]\b[this,9,8]像我们这种人自由惯了，可受不了什么组织的条条框框。对吧？约瑟先生？",
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    9,
                    8
                ]
            ]
        },
        "\t[hero]\b[hero]呵……这点我倒是同意。",
        "\t[赫,N426]\b[this,10,4]既然如此……我也不勉强二位。",
        "\t[赫,N426]\b[this,10,4]我明天会去塔那里看看，二位若是有意也可以同行。",
        "\t[赫,N426]\b[this,10,4]时候不早，我们就先回去休息了。",
        "\t[赫,N426]\b[this,10,4]你们也早点回去调整调整吧。",
        "\t[芙朵,N436]\b[this,12,6]各位再见。",
        {
            "type": "move",
            "loc": [
                12,
                6
            ],
            "time": 200,
            "async": true,
            "steps": [
                "down:3",
                "left:1",
                "down:3"
            ]
        },
        {
            "type": "move",
            "loc": [
                10,
                4
            ],
            "time": 200,
            "steps": [
                "right:2",
                "down:5",
                "left:1",
                "down:3"
            ]
        },
        {
            "type": "waitAsync"
        },
        "\t[村长,N440]\b[this,5,6]约瑟先生，伊杰明大师。你们也早点休息吧，有什么需要的都可以通知我。",
        "\t[伊杰明,N416]\b[this,9,8]嗯，正好今天也很累了。",
        "\t[伊杰明,N416]\b[this,9,8]那么我们就告辞了。",
        {
            "type": "setVolume",
            "value": 0,
            "time": 500,
            "async": true
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "moveHero",
            "time": 200,
            "async": true,
            "steps": [
                "right:1",
                "down:4"
            ]
        },
        {
            "type": "move",
            "loc": [
                9,
                8
            ],
            "time": 200,
            "keep": true,
            "steps": [
                "right:2",
                "down:4"
            ]
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setValue",
            "name": "flag:dzw",
            "value": "3"
        },
        {
            "type": "show",
            "loc": [
                [
                    34,
                    11
                ]
            ],
            "floorId": "MT7"
        },
        {
            "type": "setBlock",
            "number": "A367",
            "loc": [
                [
                    37,
                    8
                ]
            ],
            "floorId": "MT7"
        },
        {
            "type": "setBlock",
            "number": "A368",
            "loc": [
                [
                    37,
                    9
                ]
            ],
            "floorId": "MT7"
        },
        {
            "type": "changeFloor",
            "floorId": "MT7",
            "loc": [
                37,
                10
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.hqs==1)",
            "true": [
                {
                    "type": "hide",
                    "loc": [
                        [
                            11,
                            12
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "setBlock",
                    "number": "N416",
                    "loc": [
                        [
                            7,
                            4
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N426",
                    "loc": [
                        [
                            10,
                            4
                        ]
                    ]
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[村长,N440]\b[this,5,6]没想到……战况这么惨烈……",
                "\t[村长,N440]\b[this,5,6]我们一定会用上村里一切资源治疗伊杰明大师与赫小姐的！",
                "\t[村长,N440]\b[this,5,6]村民会世世代代铭记你们的努力！",
                {
                    "type": "setBlock",
                    "number": "N360",
                    "loc": [
                        [
                            11,
                            12
                        ]
                    ],
                    "time": 500
                },
                {
                    "type": "move",
                    "loc": [
                        11,
                        12
                    ],
                    "time": 100,
                    "keep": true,
                    "steps": [
                        "up:3"
                    ]
                },
                "\t[猎人,N357]\b[this,11,9]不好了！村长！",
                "\t[猎人,N357]\b[this,11,9]森林……森林附近……又长出了三座魔塔！",
                {
                    "type": "changePos",
                    "direction": "down"
                },
                "\t[hero]\b[hero]你……说什么？",
                {
                    "type": "setVolume",
                    "value": 0,
                    "time": 500,
                    "async": true
                },
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "waitAsync"
                },
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "setVolume",
                    "value": 100,
                    "time": 1
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT94",
                    "loc": [
                        6,
                        8
                    ],
                    "direction": "up"
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "0,12": [
            {
                "type": "choices",
                "text": "要去尝试游玩与本塔同一世界观的作品\n《虚妄之间》（另一位漂泊者无名的故事）或\n《凝滞之间》（吟游诗人伊杰明在另一座魔塔的故事）吗？\n选择选项之后就能提交本塔成绩了。",
                "choices": [
                    {
                        "text": "玩《凝滞之间》",
                        "action": [
                            {
                                "type": "function",
                                "function": "function(){\nwindow.open(\"https://h5mota.com/games/nzzjmt/\");\n}"
                            }
                        ]
                    },
                    {
                        "text": "玩《虚妄之间》",
                        "action": [
                            {
                                "type": "function",
                                "function": "function(){\nwindow.open(\"https://h5mota.com/games/xwzjmt/\");\n}"
                            }
                        ]
                    },
                    {
                        "text": "不玩",
                        "action": []
                    }
                ]
            },
            {
                "type": "choices",
                "text": "选择计分规则",
                "choices": [
                    {
                        "text": "生命",
                        "action": [
                            "分数为生命。",
                            "额外的，每把绿钥匙增加1000000分。",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('greenKey')*1000000"
                            },
                            {
                                "type": "win",
                                "reason": "回到村子(生命榜)"
                            }
                        ]
                    },
                    {
                        "text": "钥匙",
                        "action": [
                            "分数为1000+蓝钥匙*1000+黄钥匙*500",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "value": "1000+core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000"
                            },
                            "额外的，每把绿钥匙增加1000000分。",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('greenKey')*1000000"
                            },
                            {
                                "type": "win",
                                "reason": "回到村子(钥匙榜)"
                            }
                        ]
                    },
                    {
                        "text": "综合",
                        "action": [
                            "分数为生命+蓝钥匙*1000+黄钥匙*500+魔力*50",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000+hero.mana*50"
                            },
                            "额外的，每把绿钥匙增加1000000分。",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('greenKey')*1000000"
                            },
                            {
                                "type": "win",
                                "reason": "回到村子(综合榜)"
                            }
                        ]
                    }
                ]
            }
        ],
        "0,0": [
            "第三版到此结束，感谢您的游玩。",
            {
                "type": "choices",
                "text": "要去尝试游玩与本塔同一世界观的作品\n《虚妄之间》（另一位漂泊者无名的故事）或\n《凝滞之间》（吟游诗人伊杰明在另一座魔塔的故事）吗？\n选择选项之后就能提交本塔成绩了。",
                "choices": [
                    {
                        "text": "玩《凝滞之间》",
                        "action": [
                            {
                                "type": "function",
                                "function": "function(){\nwindow.open(\"https://h5mota.com/games/nzzjmt/\");\n}"
                            }
                        ]
                    },
                    {
                        "text": "玩《虚妄之间》",
                        "action": [
                            {
                                "type": "function",
                                "function": "function(){\nwindow.open(\"https://h5mota.com/games/xwzjmt/\");\n}"
                            }
                        ]
                    },
                    {
                        "text": "不玩",
                        "action": []
                    }
                ]
            },
            {
                "type": "choices",
                "text": "选择计分规则",
                "choices": [
                    {
                        "text": "生命",
                        "action": [
                            "分数为生命。",
                            "额外的，每把绿钥匙增加1000000分。",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('greenKey')*1000000"
                            },
                            {
                                "type": "win",
                                "reason": "击败黑骑士(生命榜)"
                            }
                        ]
                    },
                    {
                        "text": "钥匙",
                        "action": [
                            "分数为1000+蓝钥匙*1000+黄钥匙*500",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "value": "1000+core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000"
                            },
                            "额外的，每把绿钥匙增加1000000分。",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('greenKey')*1000000"
                            },
                            {
                                "type": "win",
                                "reason": "击败黑骑士(钥匙榜)"
                            }
                        ]
                    },
                    {
                        "text": "综合",
                        "action": [
                            "分数为生命+蓝钥匙*1000+黄钥匙*500+魔力*50",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('yellowKey')*500+core.itemCount('blueKey')*1000+hero.mana*50"
                            },
                            "额外的，每把绿钥匙增加1000000分。",
                            {
                                "type": "setValue",
                                "name": "status:hp",
                                "operator": "+=",
                                "value": "core.itemCount('greenKey')*1000000"
                            },
                            {
                                "type": "win",
                                "reason": "击败黑骑士(综合榜)"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [143,143,143,143,143,143,143,143,143,143,143,143,143,143,143],
    [143,30017,30017,30017,30017,30017,30017,30017,30017,30017,30017,30017,30017,30017,143],
    [143,30025,30025,30025,30025,30025,30025,30025,30025,30025,30025,30025,30025,30025,143],
    [143,30104,30105,30080,30081,30082,  0,30051,30052,30052,30053,  0,30106,30107,143],
    [143,  0,  0,  0,  0,  0,  0,416,  0,  0,426,  0,  0,  0,143],
    [143,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,143],
    [143,  0,  0,  0,  0,442,30048,30049,30049,30049,30049,30050,437,  0,143],
    [143,30109,  0,  0,  0,  0,30056,30057,30057,30057,30057,30058,  0,30109,143],
    [143,30109,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30109,143],
    [143,30109,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30109,143],
    [143,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,143],
    [143,30110,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30110,143],
    [143,143,143,143,143,143,143,143,143,143,143,  0,143,143,143]
],
    "bgmap": [
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000],
    [30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000,30000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,30088,30089,30064,30065,30066,30047,  0,30115,  0,  0,30047,30090,  0,  0],
    [  0,30096,30097,30072,30073,30074,30055,30043,30044,30044,30045,30055,30098,30099,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,30040,30041,30041,30041,30041,30042,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,30085,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30085,  0],
    [  0,30085,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30085,  0],
    [  0,30085,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30085,  0],
    [  0,30102,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30102,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,30039,  0,  0,30039,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30039,  0,  0,  0,  0,  0,  0,30039,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,30039,  0,  0,30039,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,30117,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,30125,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}