main.floors.MT30=
{
    "floorId": "MT30",
    "title": "遗迹A 始",
    "name": "遗迹A 始",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "unfollow",
            "name": "hero.png"
        },
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "follow",
            "name": "yjm.png"
        },
        {
            "type": "moveHero",
            "time": 1,
            "steps": [
                "up:1"
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        "\t[hero]\b[hero]咳咳！有没有搞错！？",
        "\t[hero]\b[hero]你也没说是落进水里后再传送的呀！？",
        "\t[伊杰明,N416]\b[hero,1]嘿嘿……在下也没说是不碰水啊。",
        "\t[伊杰明,N416]\b[hero,1]距离有限嘛……水面上面的距离不够我们传送到这里的。",
        "\t[hero]\b[hero]咳咳！该死……现在浑身湿透了……",
        "\t[hero]\b[hero]这种状态还怎么探索？",
        "\t[伊杰明,N416]\b[hero,1]不用担心……在下可是专门学习过烘干魔法的。",
        "\t[伊杰明,N416]\b[hero,1]不用十分钟，咱们身上就没有一滴水了！",
        "\t[hero]\b[hero]你会的魔法还真不少……",
        "\t[hero]\b[hero]那么，你应该也准备好回去的方法了吧？",
        "\t[伊杰明,N416]\b[hero,1]呵呵，这是自然，在下早就在出发前画好传送阵了。",
        "\t[伊杰明,N416]\b[hero,1]等我们结束后，就可以直接传送回来了。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1,
            "keep": true
        },
        {
            "type": "setHeroOpacity",
            "opacity": 0,
            "time": 1
        },
        {
            "type": "setValue",
            "name": "flag:dzw",
            "value": "7"
        },
        {
            "type": "changeFloor",
            "floorId": "MT7",
            "loc": [
                18,
                15
            ]
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.dzw==8)",
            "true": [
                {
                    "type": "loadBgm",
                    "name": "yj.mp3"
                },
                {
                    "type": "moveHero",
                    "steps": [
                        "up:1"
                    ]
                },
                {
                    "type": "changePos",
                    "direction": "down"
                },
                {
                    "type": "setCurtain",
                    "time": 1
                },
                "\t[伊杰明,N416]\b[hero,1]等我们结束后，就可以直接传送回来了。",
                "\t[hero]\b[hero]还挺周到的嘛。",
                "\t[hero]\b[hero]说起来，在这个遗迹就不需要单人闯塔了。",
                "\t[hero]\b[hero]还是第一次体验双人合作探索啊。",
                "\t[伊杰明,N416]\b[hero,1]嘿嘿……能和在下一起经历这场旅途，约瑟先生，您可谓是受到幸运之神的眷顾了。",
                "\t[hero]\b[hero]哼哼……那是我要说的话。",
                {
                    "type": "setValue",
                    "name": "flag:dzw",
                    "value": "9"
                },
                {
                    "type": "setValue",
                    "name": "flag:lhjn",
                    "value": "'火球术'"
                },
                {
                    "type": "setValue",
                    "name": "flag:lh",
                    "value": "0"
                },
                {
                    "type": "setValue",
                    "name": "item:I473",
                    "operator": "+=",
                    "value": "1"
                },
                {
                    "type": "function",
                    "function": "function(){\nflags.__visited__ = { MT1: true, MT2: true, MT3: true, MT4: true, MT5: true, MT6: true, MT7: true, MT8: true, MT9: true, MT10: true, MT11: true, MT12: true, MT13: true, MT14: true, MT15: true, MT16: true, MT28: true, MT29: true, MT30: true }\n}"
                },
                {
                    "type": "setValue",
                    "name": "flag:pmf",
                    "value": "1"
                },
                {
                    "type": "autoText",
                    "text": "现在可以在背包里使用伊杰明的支援技能了（快捷键2）\n该区域需要频繁用到它，请务必善用。",
                    "time": 5000
                },
                {
                    "type": "setVolume",
                    "value": 100,
                    "time": 1
                },
                {
                    "type": "playBgm",
                    "name": "yj.mp3",
                    "keep": true
                }
            ]
        },
        {
            "type": "if",
            "condition": "(flags.dzw==10)",
            "true": [
                {
                    "type": "moveHero",
                    "steps": [
                        "down:1"
                    ]
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[hero]\b[hero]啧……结果带回去的比我想象的要少啊……",
                "\t[伊杰明,N416]\b[hero,1]考虑到时间和工具的问题，我们手头这些这已经算是大丰收了。",
                "\t[伊杰明,N416]\b[hero,1]在王都，这些魔晶矿足够买下两栋大宅了。",
                "\t[hero]\b[hero]啧……别说这个。我听不得这些……",
                "\t[hero]\b[hero]你能够理解一个无法住在城市里的漂泊者，手握一堆财宝，却无福享受的痛苦吗？",
                "\t[伊杰明,N416]\b[hero,1]呵呵……在下倒是觉得，在外面那广阔的世界中冒险要比腐烂在城市的荣华更有吸引力。",
                "\t[hero]\b[hero]那你还真是个骨子里的冒险者。",
                "\t[hero]\b[hero]而我就真的是被逼无奈啦！",
                {
                    "type": "moveHero",
                    "steps": [
                        "down:3"
                    ]
                },
                "\t[hero]\b[hero]好了，就是这里了吧？",
                "\t[hero]\b[hero]快开启你的传送法阵吧！",
                "\t[hero]\b[hero]我已经快受不了这地下的阴湿味了。",
                "\t[伊杰明,N416]\b[hero,1]稍等片刻。",
                {
                    "type": "animate",
                    "name": "yongchang",
                    "loc": [
                        6,
                        10
                    ]
                },
                "\t[伊杰明,N416]\b[hero,1]……",
                {
                    "type": "animate",
                    "name": "yongchang",
                    "loc": [
                        6,
                        10
                    ]
                },
                "\t[伊杰明,N416]\b[hero,1]……嗯？？？",
                "\t[hero]\b[hero]你……你该不会想说……",
                "\t[hero]\b[hero]出问题了吧？",
                "\t[伊杰明,N416]\b[hero,1]相信我……约瑟先生……",
                "\t[伊杰明,N416]\b[hero,1]我们这真的只是碰到了小概率事件……",
                "\t[伊杰明,N416]\b[hero,1]但还有一个好消息是……",
                "\t[伊杰明,N416]\b[hero,1]在下还会一个时间为七分钟的水下呼吸魔法。",
                "\t[伊杰明,N416]\b[hero,1]咱们还能游回去。",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "confirm",
                    "text": "现在可以提交成绩",
                    "yes": [
                        {
                            "type": "choices",
                            "text": "选择计分规则",
                            "choices": [
                                {
                                    "text": "生命",
                                    "action": [
                                        "分数为生命。",
                                        "额外的，每把绿钥匙增加1000000分。",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "core.itemCount('greenKey')*1000000"
                                        },
                                        {
                                            "type": "win",
                                            "reason": "离开遗迹(生命榜)"
                                        }
                                    ]
                                },
                                {
                                    "text": "钥匙",
                                    "action": [
                                        "分数为1000+蓝钥匙*1000+黄钥匙*500",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "value": "1000+flags.yjh*500+flags.yjl*1000"
                                        },
                                        "额外的，每把绿钥匙增加1000000分。",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "core.itemCount('greenKey')*1000000"
                                        },
                                        {
                                            "type": "win",
                                            "reason": "离开遗迹(钥匙榜)"
                                        }
                                    ]
                                },
                                {
                                    "text": "综合",
                                    "action": [
                                        "分数为生命+蓝钥匙*1000+黄钥匙*500+魔力*50",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "flags.yjh*500+flags.yjl*1000+hero.mana*50"
                                        },
                                        "额外的，每把绿钥匙增加1000000分。",
                                        {
                                            "type": "setValue",
                                            "name": "status:hp",
                                            "operator": "+=",
                                            "value": "core.itemCount('greenKey')*1000000"
                                        },
                                        {
                                            "type": "win",
                                            "reason": "离开遗迹(综合榜)"
                                        }
                                    ]
                                }
                            ]
                        }
                    ],
                    "no": []
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT7",
                    "loc": [
                        18,
                        17
                    ],
                    "direction": "down"
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,2": {
            "floorId": "MT31",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,149,149,149,80041,80096,80097,80098,80041,149,149,149,149],
    [149,149,149,149,80049,80104,80105,80106,80049,149,149,149,149],
    [149,10041,10041,10042,356, 31,  0, 31,356,10040,10041,10041,149],
    [149,10049,10049,10050, 32,  0,  0,  0, 32,10048,10049,10049,149],
    [149,80057,80057,80057,80057,80057,  0,80057,80057,80057,80057,80057,149],
    [149,80065,80065,80065,80065,80065,  0,80065,80065,80065,80065,80065,149],
    [149,80065,80065,80065,80065,80065,  0,80065,80065,80065,80065,80065,149],
    [149,149,149,149, 21,  0,  0,  0, 21,149,149,149,149],
    [149,149,149,149,149, 21,  0, 21,149,149,149,149,149],
    [149,149,149,149,149,149,  0,149,149,149,149,149,149],
    [149,149,149,149,149,149,  0,149,149,149,149,149,149],
    [149,149,149,149,149,149,149,149,149,149,149,149,149]
],
    "bgmap": [
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80024,80025,80025,80025,80026,80000,80000,80000,80000],
    [80000,80000,80000,80000,80032,80033,80033,80033,80034,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80017,80017,80017,80017,80017,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80025,80025,80025,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80025,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80025,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,80007,  0,  0,  0,  0,  0,  0,  0,80007,  0,  0],
    [  0,  0,80015,  0,  0,  0,  0,  0,  0,  0,80015,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80041,80041,80041,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80049,80049,80049,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80131,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80131,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80139,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}