main.floors.MT31=
{
    "floorId": "MT31",
    "title": "遗迹A 正下",
    "name": "遗迹A 正下",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[hero]\b[hero]嘿……这里怎么的魔物怎么都是黑白两种颜色？",
        "\t[hero]\b[hero]这情况还是第一次见。",
        "\t[伊杰明,N416]\b[hero,1]嗯……严格来说他们不算是魔物。",
        "\t[伊杰明,N416]\b[hero,1]是曾经的魔塔消亡后，留下的魔物残体与诅咒结合而成幻灵。",
        "\t[伊杰明,N416]\b[hero,1]虽大体保留了原来魔物的战力，但仅限于在遗迹内活动。",
        "\t[伊杰明,N416]\b[hero,1]分情况还可能会产生异变，从而形成一种与原本的魔塔截然不同的规则。",
        "\t[hero]\b[hero]原来还有这么一层说法。",
        "\t[hero]\b[hero]魔塔我是解决过不少……这种遗迹还是头一次。",
        "\t[hero]\b[hero]那么，依你看，这两种颜色的幻灵是代表了这遗迹有什么规则吗？",
        "\t[伊杰明,N416]\b[hero,1]这个嘛……以在下多年的经验来看……也只能看出代表了两种不同的属性。",
        "\t[伊杰明,N416]\b[hero,1]具体的效果……还得尝试一番。",
        {
            "type": "switch",
            "condition": "flags.hard",
            "caseList": [
                {
                    "case": "1",
                    "action": [
                        "观剧模式下的补给，额外获得5黄钥匙2蓝钥匙",
                        {
                            "type": "setValue",
                            "name": "item:yellowKey",
                            "operator": "+=",
                            "value": "5"
                        },
                        {
                            "type": "setValue",
                            "name": "item:blueKey",
                            "operator": "+=",
                            "value": "2"
                        }
                    ]
                },
                {
                    "case": "2",
                    "action": [
                        "正常模式下的补给，额外获得3黄钥匙1蓝钥匙",
                        {
                            "type": "setValue",
                            "name": "item:yellowKey",
                            "operator": "+=",
                            "value": "3"
                        },
                        {
                            "type": "setValue",
                            "name": "item:blueKey",
                            "operator": "+=",
                            "value": "1"
                        }
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,11": [
            "本区域的关键点有以下几项：\n1.光暗的转换，只需要记住白色黑色的怪物交替打就可以。如白-黑-白-黑……\n2.支援技能的释放。这个最为关键，由于支援技能的释放频率十分高而且没有成本，所以当能够释放支援技能的时候就无脑释放即可，注意左上角技能冷却完毕的提醒。",
            "3.装备的选择。确保你的饰品至少有3个，镜像结界在本区域是一个特别高效的饰品，推荐购入。\n此外，手机玩家要使用技能时，除了进入背包点击图标外，还可以点击难度的位置（观剧、正常）切换到数字键界面。该界面下数字1-4是技能的释放，5-6是存读档，7是轻按键。Alt键暂时不需要掌握。再次点击难度的位置就能换回初始界面啦。"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT30",
            "loc": [
                6,
                2
            ]
        },
        "12,11": {
            "floorId": "MT32",
            "loc": [
                0,
                11
            ]
        },
        "0,5": {
            "floorId": "MT33",
            "loc": [
                12,
                5
            ]
        },
        "9,0": {
            "floorId": "MT34",
            "loc": [
                9,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "5,11": [
            "\t[伊杰明,N416]\b[hero,1]……这感觉是？",
            "\t[约瑟,N365]\b[hero]身上充斥着暗属性的力量……",
            "\t[约瑟,N365]\b[hero]也就是说击杀后，我们身上会出现那个幻灵所代表的属性力量吗？",
            "\t[伊杰明,N416]\b[hero,1]嗯……我其他的攻击魔法全部被转换成了暗属性。",
            "\t[约瑟,N365]\b[hero]也就是说……我们用不了其他属性的能力了？",
            "\t[伊杰明,N416]\b[hero,1]不不不，用是能用的。只是最终属性会被强制转换。"
        ],
        "2,11": [
            "\t[约瑟,N365]\b[hero]啧……感觉难缠了许多。",
            "\t[约瑟,N365]\b[hero]在双方属性相同的情况下……我们对他们的伤害会被大大减弱。",
            "\t[伊杰明,N416]\b[hero,1]而它们对我们的伤害则不被影响。",
            "\t[伊杰明,N416]\b[hero,1]原来是这样的规则么……"
        ],
        "1,8": [
            "\t[约瑟,N365]\b[hero]这回……变成了光属性……",
            "\t[伊杰明,N416]\b[hero,1]而这次以暗属性打光属性则没有之前暗属性打暗属性费力。",
            "\t[伊杰明,N416]\b[hero,1]原来如此……在这里击杀幻灵会变成幻灵的属性，而同属性状态下，我们对它们的伤害会降低。",
            "\t[伊杰明,N416]\b[hero,1]呵呵……有趣！",
            "\t[伊杰明,N416]\b[hero,1]这就是为什么我如此着迷于魔塔的原因啊！",
            "\t[约瑟,N365]\b[hero]能有省力的打法自然再好不过。",
            "\t[约瑟,N365]\b[hero]希望这里也能有魔晶给我补给……"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [149,149,149,149,149,149,149,149,149, 91,149,149,149],
    [149,80040,80041,80041,80041,80041,80041,80041,80042,  0,80040,80042,149],
    [149,80048,80049,80049,80049,80049,80049,80049,80050, 81,80048,80050,149],
    [80042,  0, 31,  0,475,  0, 21,  0,484,  0, 31,  0,149],
    [80050, 29,149,149,149,149,  0,149,149,149,149, 28,149],
    [ 92,  0,80040,80041,80041,80041,481,80040,80041,80041,80042,  0,149],
    [149, 82,80048,80049,80049,80049,  0,80048,80049,80049,80050,475,149],
    [149,  0,  0,  0,478,  0, 31,  0,474,  0,  0,  0,149],
    [149,478,80041,80041,80041,80041,80041,80042,149, 81,149,477,149],
    [149,  0,80057,80057,80057,80057,80057,80089,149,479,149,  0,80040],
    [149, 32,80065,80065,80065,80065,80065,80065,149, 27,149, 31,80048],
    [149,  0,474,  0,  0,474,  0, 22,149, 32,149,  0, 94],
    [149,149,149,149,149,149, 93,149,149,149,149,149,149]
],
    "bgmap": [
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80025,80025,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80025,80025,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80025,80025,80000,80000],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80000],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80000],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80000],
    [80000,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80000],
    [80000,80033,80033,80033,80033,80033,80033,80033,80027,80025,80025,80025,80025],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80025,80025,80025,80025],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80025,80025,80025,80025],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80025,80025,80025,80025],
    [80000,80017,80017,80017,80017,80017,80017,80017,80000,80025,80025,80025,80025],
    [80000,80000,80000,80000,80000,80000,80025,80000,80000,80000,80000,80000,80000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,129,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80131,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80131,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80139,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}