main.floors.MT40=
{
    "floorId": "MT40",
    "title": "遗迹A&B 末&始",
    "name": "遗迹A&B 末&始",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,7": [
            "A门后面是正确的道路。\nB门后面不是正确的道路。\nB门后面是正确的道路。\nC门后面不是正确的道路。\n这四句话只有一句在说谎。",
            {
                "type": "if",
                "condition": "(flags.mt!==1)",
                "true": [
                    "\t[约瑟,N365]\b[hero]这是……",
                    "\t[伊杰明,N416]\b[hero,1]想不到这个遗迹居然还留有谜题。",
                    "\t[伊杰明,N416]\b[hero,1]看来之前的塔主也是个有闲情雅致的角色啊。",
                    "\t[约瑟,N365]\b[hero]那么你应该很擅长这种谜题吧？",
                    "\t[伊杰明,N416]\b[hero,1]啧啧，在下愿意放弃这次的表现机会。",
                    "\t[伊杰明,N416]\b[hero,1]让给约瑟先生，你来决定。",
                    "\t[约瑟,N365]\b[hero]别是想不出来找的借口吧？",
                    "\t[约瑟,N365]\b[hero]也罢……毕竟这次是我主动找你帮忙。",
                    "\t[约瑟,N365]\b[hero]那我就稍微露一手给你瞧瞧吧。",
                    {
                        "type": "setValue",
                        "name": "flag:mt",
                        "value": "1"
                    }
                ]
            }
        ],
        "5,4": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[约瑟,N365]\b[hero]这幅景象……看来是发挥失误了……",
                "\t[伊杰明,N416]\b[hero,1]呵呵，约瑟先生，看来你未来要学习的东西还很多啊。",
                "\t[约瑟,N365]\b[hero]啧……那你为什么不提醒我！？",
                "\t[伊杰明,N416]\b[hero,1]哎呀，浪费一把钥匙提升难度，也是魔塔的一种乐趣嘛。",
                "\t[伊杰明,N416]\b[hero,1]要为我们的生活增添挑战和开拓精神！",
                "\t[约瑟,N365]\b[hero]可恶啊……我受够你这个魔塔控了！"
            ]
        },
        "7,4": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[约瑟,N365]\b[hero]这幅景象……看来是发挥失误了……",
                "\t[伊杰明,N416]\b[hero,1]呵呵，约瑟先生，看来你未来要学习的东西还很多啊。",
                "\t[约瑟,N365]\b[hero]啧……那你为什么不提醒我！？",
                "\t[伊杰明,N416]\b[hero,1]哎呀，浪费一把钥匙提升难度，也是魔塔的一种乐趣嘛。",
                "\t[伊杰明,N416]\b[hero,1]要为我们的生活增添挑战和开拓精神！",
                "\t[约瑟,N365]\b[hero]可恶啊……我受够你这个魔塔控了！"
            ]
        },
        "9,4": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[约瑟,N365]\b[hero]这幅景象……看来是发挥失误了……",
                "\t[伊杰明,N416]\b[hero,1]呵呵，约瑟先生，看来你未来要学习的东西还很多啊。",
                "\t[约瑟,N365]\b[hero]啧……那你为什么不提醒我！？",
                "\t[伊杰明,N416]\b[hero,1]哎呀，浪费一把钥匙提升难度，也是魔塔的一种乐趣嘛。",
                "\t[伊杰明,N416]\b[hero,1]要为我们的生活增添挑战和开拓精神！",
                "\t[约瑟,N365]\b[hero]可恶啊……我受够你这个魔塔控了！"
            ]
        },
        "3,4": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[约瑟,N365]\b[hero]嗯……考虑到只有一扇门在说谎。",
                "\t[约瑟,N365]\b[hero]那么正确的就是这扇了吧！",
                {
                    "type": "openDoor",
                    "loc": [
                        3,
                        4
                    ]
                },
                "\t[约瑟,N365]\b[hero]嘿……小菜一碟～",
                "\t[伊杰明,N416]\b[hero,1]怎么样？很有成就感吧？",
                "\t[伊杰明,N416]\b[hero,1]这也是探索魔塔的乐趣之一呀。",
                "\t[约瑟,N365]\b[hero]老实说我根本就不喜欢弯弯绕绕的东西。",
                "\t[约瑟,N365]\b[hero]还是尽快结束探索，好回去吃晚饭吧！",
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT37",
            "loc": [
                6,
                0
            ]
        },
        "6,2": {
            "floorId": "MT41",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {
        "6,10": [
            "\t[约瑟,N365]\b[hero]这个大块头看起来可不好对付……",
            "\t[伊杰明,N416]\b[hero,1]一半白一半黑……那么无论如何它都会获得状态的增强了。",
            "\t[伊杰明,N416]\b[hero,1]最好考虑一下到底让它获得哪种状态的增强会更容易对付些。"
        ]
    },
    "afterBattle": {
        "6,10": [
            "激战后护盾受损，减少80点。",
            {
                "type": "setValue",
                "name": "status:mdef",
                "operator": "-=",
                "value": "80"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {
        "5,4": [
            "up"
        ],
        "7,4": [
            "up"
        ],
        "9,4": [
            "up"
        ]
    },
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,149,149,80040,80041,80096,80097,80098,80041,80042,149,149,149],
    [149,149,149,80048,80049,80104,80105,80106,80049,80050,149,149,149],
    [149,149,149,  0, 21, 21, 22, 21, 21,  0,149,149,149],
    [149,149,149, 85,149, 85,149, 85,149, 85,149,149,149],
    [149,149,80041,  0,80041,  0,80041,  0,80041,  0,80041,149,149],
    [149,149,80049, 81,80049, 81,80049, 81,80049, 81,80049,149,149],
    [149,149, 34,  0,  0,  0,10147,  0,  0,  0, 34,149,149],
    [149,149, 34,356,356,  0,  0,  0,356,356, 34,149,149],
    [149,149, 81,149,149,  0,  0,  0,149,149, 81,149,149],
    [149,149, 32,149,149,  0,486,  0,149,149, 32,149,149],
    [149,149,149,149,149,149,  0,149,149,149,149,149,149],
    [149,149,149,149,149,149, 93,149,149,149,149,149,149]
],
    "bgmap": [
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80041,80041,80041,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80049,80049,80049,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,10180,  0,10171,  0,10169,  0,10178,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}