main.floors.MT50=
{
    "floorId": "MT50",
    "title": "遗迹B 末",
    "name": "遗迹B 末",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[约瑟,N365]\b[hero]这个就是这遗迹的最终boss了吧？",
        "\t[约瑟,N365]\b[hero]是过去的塔主尸体变化的？",
        "\t[伊杰明,N416]\b[hero,1]遗迹的boss不一定就是塔主的尸体，这要取决于这座塔曾经留下的最强生物是什么。",
        "\t[伊杰明,N416]\b[hero,1]大部分遗迹都是由于塔主被人杀死后，来者又没有净化这座魔塔。",
        "\t[伊杰明,N416]\b[hero,1]这才会生成遗迹这种东西。",
        "\t[伊杰明,N416]\b[hero,1]所以遗迹的boss是塔主变化的可能性是比较小的。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "MT49",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,10": [
            {
                "type": "setVolume",
                "value": 0,
                "time": 1500,
                "async": true
            },
            "遗迹结算，钥匙将被清空。",
            "每剩余3把黄钥匙，奖励1把绿钥匙，最多2把。\n剩余2把蓝钥匙奖励1把绿钥匙，剩余3把及以上蓝钥匙，则改为奖励2把绿钥匙。\n剩余50魔力及以上，奖励1把绿钥匙。\n钥匙数量将被记录，计分时将读取此时的钥匙数量。",
            {
                "type": "setValue",
                "name": "flag:yjh",
                "value": "core.itemCount('yellowKey')"
            },
            {
                "type": "setValue",
                "name": "flag:yjl",
                "value": "core.itemCount('blueKey')"
            },
            {
                "type": "if",
                "condition": "(core.itemCount('yellowKey')>=3)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "operator": "-=",
                        "value": "3"
                    },
                    {
                        "type": "setValue",
                        "name": "item:greenKey",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(core.itemCount('yellowKey')>=3)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "value": "0"
                    },
                    {
                        "type": "setValue",
                        "name": "item:greenKey",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(core.itemCount('blueKey')>=2)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "item:blueKey",
                        "operator": "-=",
                        "value": "2"
                    },
                    {
                        "type": "setValue",
                        "name": "item:greenKey",
                        "operator": "+=",
                        "value": "1"
                    },
                    {
                        "type": "if",
                        "condition": "(core.itemCount('blueKey')>=1)",
                        "true": [
                            {
                                "type": "setValue",
                                "name": "item:blueKey",
                                "value": "0"
                            },
                            {
                                "type": "setValue",
                                "name": "item:greenKey",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(hero.mana>=50)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "item:greenKey",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            "\t[约瑟,N365]\b[hero]那么现在让我们来迎接胜利的果实吧～",
            {
                "type": "moveHero",
                "steps": [
                    "up:3"
                ]
            },
            "\t[伊杰明,N416]\b[hero,1]呵呵……这里居然藏着这么多魔晶矿。",
            "\t[伊杰明,N416]\b[hero,1]即使是我也第一次见到这等数量。",
            "\t[约瑟,N365]\b[hero]还等什么？让我们开采个干净！",
            "\t[伊杰明,N416]\b[hero,1]稍等！约瑟先生，开采魔晶矿需要特殊的方式。",
            "\t[伊杰明,N416]\b[hero,1]胡乱开采只会让品质大打折扣。",
            "\t[伊杰明,N416]\b[hero,1]让我们耐心点，慢慢来。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "setValue",
                "name": "flag:dzw",
                "value": "10"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "changeFloor",
                "floorId": "MT30",
                "loc": [
                    6,
                    7
                ],
                "direction": "down"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,149,149,149,149,80041,149,80041,149,149,149,149,149],
    [149,149,149,149,80041,80049,80041,80049,80041,149,149,149,149],
    [149,149,149,80040,80049,101,80049,101,80049,80042,149,149,149],
    [149,149,149,80048,101,102,101,102,101,80050,149,149,149],
    [149,149,149,101,102,101,102,101,102,101,149,149,149],
    [149,149,149,102,101,102,  0,102,101,102,149,149,149],
    [149,149,149,149,102,  0,  0,  0,102,149,149,149,149],
    [149,149,149,149,149,  0,  0,  0,149,149,149,149,149],
    [149,149,149,149,149,  0,487,  0,149,149,149,149,149],
    [149,149,149,149,149,149,  0,149,149,149,149,149,149],
    [149,149,149,149,149,149, 93,149,149,149,149,149,149]
],
    "bgmap": [
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025],
    [80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025,80025]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}