main.floors.MT51=
{
    "floorId": "MT51",
    "title": "塔顶",
    "name": "塔顶",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[黑衣人,N495]\b[this,6,8]他们来了",
        "\t[黑衣人,N495]\b[this,6,8]你认为你的黑骑士能够挡住他们吗？",
        "\t[塔主]\b[this,6,6]……",
        "\t[塔主]\b[this,6,6]……无所谓",
        "\t[黑衣人,N495]\b[this,6,8]无所谓吗？你现在可还是一副半身不遂的状态。",
        "\t[黑衣人,N495]\b[this,6,8]难道你还有什么底牌吗？",
        "\t[塔主]\b[this,6,6]比起他们……我更好奇你和你的组织。",
        "\t[塔主]\b[this,6,6]背叛人类……帮助魔塔……你们究竟打的什么算盘。",
        "\t[黑衣人,N495]\b[this,6,8]啧……组织自然是有他们的理念。",
        "\t[黑衣人,N495]\b[this,6,8]而我只是觉得这么做有趣罢了，正好我对现在的人类社会也没什么好感。",
        "\t[黑衣人,N495]\b[this,6,8]话说……像我们这类人……",
        "\t[黑衣人,N495]\b[this,6,8]你的那个时代……有见过吗？",
        "\t[塔主]\b[this,6,6]……",
        "\t[黑衣人,N495]\b[this,6,8]我其实一直很好奇我们组织究竟延续多久了。",
        "\t[黑衣人,N495]\b[this,6,8]好像几百年前就有过记录。",
        "\t[黑衣人,N495]\b[this,6,8]嗯……不知道你是诞生于多久之前的呢？",
        "\t[黑衣人,N495]\b[this,6,8]我看这座塔至少也有个几百年历史了。",
        "\t[塔主]\b[this,6,6]像你们这类人……自然也是每个时代都会有的……",
        "\t[塔主]\b[this,6,6]疯子罢了。",
        "\t[黑衣人,N495]\b[this,6,8]哈哈！您说的就对极了！一帮出卖灵魂的疯子！每个成员之间的思想自己人都看不透！",
        "\t[塔主]\b[this,6,6]……",
        "\t[黑衣人,N495]\b[this,6,8]不过站在你的角度上，在自身行动受限的情况下，有我协助始终是帮了大忙吧？难道不应该感谢我吗？",
        "\t[塔主]\b[this,6,6]你想要什么？",
        "\t[黑衣人,N495]\b[this,6,8]哈哈，我们这类不是工作，不需要报酬。",
        "\t[黑衣人,N495]\b[this,6,8]我们组织成员的驱动力只有两种东西。",
        "\t[塔主]\b[this,6,6]……",
        "\t[黑衣人,N495]\b[this,6,8]使命和乐趣。",
        "\t[塔主]\b[this,6,6]邪教徒和乐子人么……真是有够无聊的存在。",
        "\t[黑衣人,N495]\b[this,6,8]那么，我就先去玩玩。",
        "\t[黑衣人,N495]\b[this,6,8]我对他们里的那个魔法师还是挺感兴趣的。",
        "\t[塔主]\b[this,6,6]……",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    8
                ]
            ]
        },
        {
            "type": "setVolume",
            "value": 0,
            "time": 1000,
            "async": true
        },
        {
            "type": "move",
            "loc": [
                6,
                8
            ],
            "time": 500,
            "async": true,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "changeFloor",
            "floorId": "MT61",
            "loc": [
                5,
                4
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.hqs==1)",
            "true": [
                {
                    "type": "setBlock",
                    "number": "N498",
                    "loc": [
                        [
                            6,
                            8
                        ]
                    ]
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[塔主]\b[this,6,6]你被摆了一道啊……",
                "\t[黑衣人,N495]\b[hero]切……就算你不传送我，我也能脱身。",
                "\t[塔主]\b[this,6,6]是你贪玩大意的性格得到的结果。",
                "\t[塔主]\b[this,6,6]看来所谓的巴别塔成员……也不过如此。",
                "\t[黑衣人,N495]\b[hero]那你呢？失去了你引以为傲的最强战力黑骑士……",
                "\t[黑衣人,N495]\b[hero]我倒想知道你接下来还能怎么办？",
                "\t[塔主]\b[this,6,6]……",
                "\t[塔主]\b[this,6,6]确实可惜……但……",
                "\t[塔主]\b[this,6,6]并不足以致命。",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "setHeroOpacity",
                    "opacity": 1
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT9",
                    "loc": [
                        6,
                        5
                    ],
                    "direction": "up"
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025],
    [10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025],
    [10025,10025,10028,10033,10033,10033,10033,10033,10033,10033,10027,10025,10025],
    [10025,10025,10026,10040,10041,10041,10041,10041,10041,10042,10024,10025,10025],
    [10025,10025,10026,10048,10049,10049,10049,10049,10049,10050,10024,10025,10025],
    [10025,10025,10026,  0,  0,  0,101,  0,  0,  0,10024,10025,10025],
    [10025,10025,10026,  0,  0,  0,102,  0,  0,  0,10024,10025,10025],
    [10025,10025,10026,  0,  0,  0,  0,  0,  0,  0,10024,10025,10025],
    [10025,10025,10026,  0,  0,  0,498,  0,  0,  0,10024,10025,10025],
    [10025,10025,10026,  0,  0,  0,  0,  0,  0,  0,10024,10025,10025],
    [10025,10025,10020,10017,10017,10018, 89,10016,10017,10017,10019,10025,10025],
    [10025,10025,10025,10025,10025,10020,10017,10019,10025,10025,10025,10025,10025],
    [10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025,10025]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}