main.floors.MT81=
{
    "floorId": "MT81",
    "title": "塔B 10 层",
    "name": "塔B 10 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,7": [
            "\t[hero]\b[hero]居然有魔法史莱姆……这种史莱姆的强度与普通史莱姆根本就是天差地别。",
            "\t[hero]\b[hero]它们甚至要比同水平的人类魔法师更厉害……",
            "\t[hero]\b[hero]而且是几万只史莱姆中才可能出现一只的稀有度。",
            "\t[hero]\b[hero]小一点的魔塔塔主要是能收集到一只都能当宝了。",
            "\t[hero]\b[hero]这位塔主还真舍得放啊……",
            "\t[hero]\b[hero]嘿……那么你的这份大礼就由在下好好收下了！",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,6": [
            "\t[hero]\b[hero]只有一个开关。",
            "\t[hero]\b[hero]看来得依靠其他人使用护符了。",
            "\t[hero]\b[hero]漆黑的骑士啊。",
            "\t[hero]\b[hero]让我们谱写出一曲战斗的挽歌吧。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,3": [
            {
                "type": "setValue",
                "name": "flag:huang19",
                "value": "1"
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,10024],
    [10026,  4,  4,  4,  4,  1,  1,  1,  4,  4,  4,  4,10024],
    [10026,  1,  1,  1,  1,  1,510,  1,  1,  1,  1,  1,10024],
    [10026,  0, 34,  0,  1,  0,  0,  0,  1,  0, 34,  0,10024],
    [10026,356,  0,499,  1,  0,  0,  0,  1,500,  0,501,10024],
    [10026,  0,227,  0,  1,  0,534,  0,  1,  0,227,  0,10024],
    [10026,  1, 81,  1,  1,  1,  0,  1,  1,  1, 81,  1,10024],
    [10026,  0,  0,  0,524,  0,  0,  0,524,  0,  0,  0,10024],
    [10026, 81,  1, 81,  1, 81,  1, 82,  1, 82,  1, 82,10024],
    [10026,  0,  1, 32,  1, 32,  1, 34,  1, 34,  1, 34,10024],
    [10026, 88,  1, 32,  1, 32,  1, 34,  1, 34,  1, 34,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}