main.floors.MT83=
{
    "floorId": "MT83",
    "title": "塔C 2 层",
    "name": "塔C 2 层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,1": [
            "赫的技能机制说明：\n可以在选择赫的作战方式了，在背包里使用或者按下快捷键1/2/3就能生效。\n选择作战方式后，进行一场战斗后锁定该作战方式（这场战斗也应用效果）\n锁定后需要再经历两场战斗才能更改为新的作战方式（以魔力值显示在状态栏）\n如果你是手机端，可以点击右下角的（'观剧'，'正常'）切换为有快捷键123的界面\n需要查看怪物手册时再点击相同位置即可切换回来。\n根据近期要战斗的敌人特点来选择最合适的作战方式吧。"
        ]
    },
    "changeFloor": {
        "3,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "11,8": [
            {
                "type": "setValue",
                "name": "flag:huang4",
                "value": "1"
            }
        ],
        "1,9": [
            {
                "type": "setValue",
                "name": "flag:lan4",
                "value": "1"
            }
        ]
    },
    "autoEvent": {
        "6,11": {
            "0": {
                "condition": "flags.hong4",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            }
        },
        "1,6": {
            "0": {
                "condition": "flags.hong3",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10028,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10033,10027],
    [10026, 34,  1, 88,  1, 21, 21,  1,  0, 81,  0, 21,10024],
    [10026,499,  1,  0,  0, 22, 21,  1,224,  1,501, 21,10024],
    [10026, 21,  1,  0,  1, 21, 21,  1,  0,  1, 34, 21,10024],
    [10026,225,  1,224,  1,  1,  1,  1, 81,  1,  1,  1,10024],
    [10026,  0,  1,  0,  0,  0,  0,  0,  0,  0,224,  0,10024],
    [10026,511,  1,  1,  1,  1,225,  1,  1,  1,  1, 81,10024],
    [10026,  0,  0,224,  0,  0,  0,  0, 81,  0,  1, 32,10024],
    [10026,  1,  1,  1, 82,  1,  1,522,  1,  0,  1,510,10024],
    [10026,509,  0,226,  0, 31,  0,  0,  1,523,  1,  1,10024],
    [10026,  1,  1,  1,  0,  1, 81,  1,  1,  0, 21, 21,10024],
    [10026, 87,  0,225,  0,  1,511, 33,  1,500, 31, 31,10024],
    [10020,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10017,10019]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,129,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}