main.floors.MT9=
{
    "floorId": "MT9",
    "title": "提亚村南部入口",
    "name": "提亚村南部入口",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "setVolume",
            "value": 100,
            "time": 1
        },
        {
            "type": "playBgm",
            "name": "wx.mp3"
        },
        "\t[杰农,N395]\b[this,5,5]快去通知村长，森林里出现了魔物暴乱！",
        "\t[守卫,N391]\b[this,6,3]冷静点！到底出什么事了？",
        "\t[杰农,N395]\b[this,5,5]森林里不知道为什么出现了很多的魔物……我们出去狩猎时被袭击了！",
        "\t[杰农,N395]\b[this,5,5]先前来村里的勇者为了掩护我们撤离，和魔物交战了。",
        "\t[杰农,N395]\b[this,5,5]但恐怕他也撑不了太久……",
        "\t[杰农,N395]\b[this,5,5]而且我们还有两个兄弟受伤了，没能逃走。",
        "\t[杰农,N395]\b[this,5,5]得快点集结人手啊！",
        "\t[守卫,N391]\b[this,6,3]明白了，我这就立刻去叫人！",
        {
            "type": "move",
            "loc": [
                6,
                3
            ],
            "time": 200,
            "steps": [
                "up:3"
            ]
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1,
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "down:3"
            ]
        },
        "\t[米娅,N335]\b[hero]杰农叔，出什么事了？",
        "\t[米娅,N335]\b[hero]你受伤了！？",
        "\t[杰农,N395]\b[this,5,5]米娅啊……森林里不知道为什么出现了大量魔物，你这段时间可千万不能进森林。",
        "\t[约瑟,N365]\b[hero,1]你们还有人困在里面是吧？",
        "\t[杰农,N395]\b[this,5,5]这位是？",
        "\t[约瑟,N365]\b[hero,1]时间紧迫，他们大概在哪个位置？",
        "\t[杰农,N395]\b[this,5,5]在……森林的西南处。长着很多愈合草的地方。",
        {
            "type": "setBlock",
            "number": "N335",
            "loc": [
                [
                    6,
                    3
                ]
            ]
        },
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "changePos",
            "loc": [
                6,
                2
            ],
            "direction": "down"
        },
        {
            "type": "unfollow",
            "name": "hero.png"
        },
        {
            "type": "moveHero",
            "steps": [
                "right:1",
                "down:4",
                "left:7"
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    12
                ]
            ],
            "floorId": "MT6",
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "MT10",
            "loc": [
                12,
                6
            ],
            "direction": "left"
        }
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flags.stq==1)",
            "true": [
                {
                    "type": "if",
                    "condition": "(flags.sw==1)",
                    "true": [],
                    "false": [
                        {
                            "type": "setVolume",
                            "value": 0,
                            "time": 3000,
                            "async": true
                        },
                        {
                            "type": "moveHero",
                            "steps": [
                                "right:5",
                                "up:1"
                            ]
                        },
                        "\t[守卫,N391]\b[this,5,2]！",
                        "\t[守卫,N391]\b[this,5,2]谢天谢地……你还活着！",
                        "\t[hero]\b[hero]姑且没死。",
                        "\t[守卫,N391]\b[this,5,2]对了，村长说要见你。如果看到你活着回来的话。",
                        "\t[守卫,N391]\b[this,5,2]就在东北方的那间屋子。",
                        "\t[hero]\b[hero]唉，就不能让我先睡上一觉么。",
                        {
                            "type": "setValue",
                            "name": "flag:sw",
                            "value": "1"
                        },
                        {
                            "type": "waitAsync"
                        },
                        {
                            "type": "pauseBgm"
                        }
                    ]
                }
            ]
        },
        {
            "type": "if",
            "condition": "(flags.hqs==1)",
            "true": [
                {
                    "type": "hide",
                    "loc": [
                        [
                            5,
                            2
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "show",
                    "loc": [
                        [
                            6,
                            2
                        ]
                    ]
                },
                {
                    "type": "show",
                    "loc": [
                        [
                            5,
                            6
                        ]
                    ]
                },
                {
                    "type": "show",
                    "loc": [
                        [
                            7,
                            6
                        ]
                    ]
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[守卫,N391]\b[this,6,2]约瑟先生！？这……这是怎么了？",
                "\t[hero]\b[hero]快来人！叫上最好的医生！",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT28",
                    "loc": [
                        7,
                        8
                    ],
                    "direction": "up"
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "5,2": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[守卫,N391]\b[this]快去找村长吧，就在东北方的那间屋子。",
                {
                    "type": "turnBlock",
                    "direction": "down",
                    "loc": [
                        [
                            5,
                            2
                        ]
                    ]
                }
            ]
        },
        "5,6": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "7,6": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        },
        "6,2": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,0": {
            "floorId": "MT7",
            "loc": [
                25,
                44
            ]
        },
        "0,6": {
            "floorId": "MT10",
            "loc": [
                12,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 91, 20, 20, 20, 20, 20, 20],
    [ 20, 20,40077,40078,20015,  0,  0,  0,20007,40077,40078, 20, 20],
    [ 20,40084,40085,40086,40087,391,391,  0,40084,40085,40086,40087, 20],
    [ 20,40092,40093,40094,40095,  0,391,  0,40092,40093,40094,40095, 20],
    [ 20,40100,40101,40102,40103,  0,  0,  0,40100,40101,40102,40103, 20],
    [ 20,  0,40109,40110,20019,398,  0,  0,20020,40109,40110,  0, 20],
    [ 92,  0,  0,  0,  0,419,  0,429,  0,  0,  0,20012, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [60000,60000,60000,60000,60000,60000,145,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,145,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,145,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,145,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,145,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,145,145,145,60000,60000,60000,60000,60000],
    [145,145,145,145,145,145,145,145,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000],
    [60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000,60000]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,40108,  0,  0,40111,  0,  0,  0,40108,  0,  0,40111,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "bgm": null,
    "weather": [
        "cloud",
        3
    ]
}