main.floors.MT95=
{
    "floorId": "MT95",
    "title": "森林之塔1层",
    "name": "森林之塔1层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "sl.mp3"
        },
        "\t[hero]\b[hero]没开玩笑吧……",
        "\t[hero]\b[hero]里面居然是森林……",
        "\t[hero]\b[hero]而且……这里的空气还真是清新啊……",
        "\t[hero]\b[hero]这真的是魔塔内部？",
        "\t[hero]\b[hero]完全看不出来啊。",
        {
            "type": "setHeroIcon",
            "name": "o.png"
        },
        "\t[怀特莉丝,N430]\b[hero]比起这个……这塔倒是给我一种熟悉的感觉……",
        "\t[怀特莉丝,N430]\b[hero]或许与我失去的记忆也有关系……",
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        "\t[hero]\b[hero]你这么一说……",
        "\t[hero]\b[hero]我也感觉这也股与之前的魔塔不一样的味道。",
        {
            "type": "setHeroIcon",
            "name": "o.png"
        },
        "\t[怀特莉丝,N430]\b[hero]花草……树木……。",
        "\t[怀特莉丝,N430]\b[hero]是精灵族的气息么……",
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        "\t[hero]\b[hero]这你也能感觉出来？",
        "\t[hero]\b[hero]我记得……精灵族好像几十年前就已经消身匿迹了。",
        "\t[hero]\b[hero]莫非你的实际年龄……",
        {
            "type": "animate",
            "name": "hand",
            "loc": [
                6,
                12
            ]
        },
        "\t[hero]\b[hero]哎呀……好疼啊……",
        {
            "type": "setHeroIcon",
            "name": "o.png"
        },
        "\t[怀特莉丝,N430]\b[hero]随意揣测少女的年龄可是很失礼的。",
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        "\t[hero]\b[hero]你都这样了……还在乎这个么……",
        {
            "type": "playBgm",
            "name": "sl.mp3",
            "keep": true
        },
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "3000"
        },
        {
            "type": "setValue",
            "name": "status:mana",
            "value": "50"
        },
        {
            "type": "setValue",
            "name": "item:yellowKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:blueKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:ltf",
            "value": "1"
        },
        {
            "type": "function",
            "function": "function(){\ncore.setFlag('skill', 0); // 关闭技能状态\ncore.setFlag('skillName', '无');\nflags.sc = \"#FFFFFF\";\nflags.sr = 0\n}"
        },
        "生命、魔力、钥匙已重置。\n现在只能在靠近楼梯时使用楼层飞行器。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "6,3": [
            {
                "type": "setHeroIcon",
                "name": "o.png"
            },
            "\t[怀特莉丝,N430]\b[hero]啊……那个怨灵就是维持这层狙击标记的魔力来源。",
            {
                "type": "setHeroIcon",
                "name": "hero.png"
            },
            "\t[hero]\b[hero]也就是说干掉这怨灵就就不会受到狙击了吧。"
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 33, 20, 33, 33, 20, 87, 20, 33, 33, 20, 28, 20],
    [ 20, 29, 20, 33, 33, 84,543, 84, 33, 33, 20, 28, 20],
    [ 20, 29, 20, 33, 33, 20, 83, 20, 33, 33, 20, 27, 20],
    [ 20, 82, 20, 20, 20, 20, 83, 20, 20, 20, 20, 27, 20],
    [ 20,  0, 81,547,  0,548,  0,548,  0,547,  0,  0, 20],
    [ 20, 22, 20, 20, 20, 20, 81, 20, 20, 20, 20, 83, 20],
    [ 20,  0, 81, 22, 20, 20, 29, 20, 20, 33, 23, 23, 20],
    [ 20, 20, 20, 20, 20, 20, 81, 20, 20, 20, 20, 20, 20],
    [ 20, 21, 21, 33, 20, 20,  0, 20, 20, 33, 23, 21, 20],
    [ 20, 82, 20, 20, 20, 20,548, 20, 20, 20, 20, 82, 20],
    [ 20,  0, 21,  0,547,  0,  0,  0,547,  0, 22,  0, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000],
    [70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000,70000]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "sj": 0
}