main.floors.MT100=
{
    "floorId": "MT100",
    "title": "主塔 100 层",
    "name": "100",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "canlie.mp3",
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    3
                ]
            ],
            "floorId": "MT99",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    6
                ]
            ],
            "floorId": "MT99",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    6
                ]
            ],
            "floorId": "MT99",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    3,
                    1
                ]
            ],
            "floorId": "MT99",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    1
                ]
            ],
            "floorId": "MT99",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    1
                ]
            ],
            "floorId": "MT99",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    9,
                    1
                ]
            ],
            "floorId": "MT99",
            "remove": true
        },
        {
            "type": "confirm",
            "text": "确认要跳过剧情吗?",
            "yes": [],
            "no": [
                {
                    "type": "follow",
                    "name": "hero.png"
                },
                {
                    "type": "follow",
                    "name": "hanyingshu.png"
                },
                {
                    "type": "jumpHero",
                    "loc": [
                        11,
                        12
                    ],
                    "time": 500
                },
                "\t[奕开,hero]\b[hero]快走！",
                {
                    "type": "moveHero",
                    "steps": [
                        "left:8",
                        "up:2"
                    ]
                },
                {
                    "type": "unfollow"
                },
                {
                    "type": "changePos",
                    "direction": "down"
                },
                {
                    "type": "setBlock",
                    "number": "N334",
                    "loc": [
                        [
                            3,
                            11
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1055",
                    "loc": [
                        [
                            3,
                            12
                        ]
                    ]
                },
                "\t[奕开,hero]\b[hero]终于逃出来了。",
                "\t[立天,N331]\b[this,3,11]奕开，你怎么能这么快找过来？",
                "\t[奕开,hero]\b[hero]哈哈，我刚来的时候，遇到一个叫寒锋的，他说死也不会告诉我，晶弥立天和韩樱姝在偏殿。哈哈哈哈，怎么会有这么蠢的人，哈哈哈哈！",
                "\t[立天,N331]\b[this,3,11]……",
                "\t[立天,N331]\b[this,3,11]他是我的人……",
                "\t[奕开,hero]\b[hero]……",
                "\t[奕开,hero]\b[hero]咳咳，那个寒锋队长还挺英勇的哈……",
                "\t[韩樱姝,N1036]\b[this,3,12]奕开，你不应该来的。反倒把你自己也置于危险之中了。",
                "\t[立天,N331]\b[this,3,11]没错，奕开，你何苦来送命呢？",
                "\t[奕开,hero]\b[hero]你们都是我最重要的人，我岂能不来？",
                "\t[韩樱姝,N1036]\b[this,3,12]唉，你能救下我们，事实上没有表面这么简单。立天的支持者们在背后帮了不少忙，所以你才能把我们救出来。",
                "\t[奕开,hero]\b[hero]我知道，不过有一点我不明白，为什么章贵妃抓到你们不直接杀了，而要让你们结婚后再杀死？",
                "\t[立天,N331]\b[this,3,11]她要是直接杀死我和樱姝，那我背后的人和韩家的人岂会同意，到时候便是一场大战了。",
                "\t[韩樱姝,N1036]\b[this,3,12]让我与立天成婚，一是遵从韩家与皇帝订下的婚约。二来，成婚当天，便杀了立天，把杀死皇子的罪过推到韩家头上，逼韩家站队章贵妃的儿子，真是好毒的一步棋。",
                "\t[奕开,hero]\b[hero]皇帝陛下呢？他也不管管吗？",
                "\t[立天,N331]\b[this,3,11]父皇已经很久没有出现了，谁知道父皇到底去了哪里。也正因为皇帝不出现，才会出现如今这个局面。",
                "\t[？？？]给我搜！把整座山林都搜上一遍，活要见人，死要见尸！",
                {
                    "type": "setBlock",
                    "number": "N1164",
                    "loc": [
                        [
                            11,
                            10
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1166",
                    "loc": [
                        [
                            12,
                            9
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1166",
                    "loc": [
                        [
                            12,
                            10
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1166",
                    "loc": [
                        [
                            12,
                            11
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1166",
                    "loc": [
                        [
                            11,
                            12
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1166",
                    "loc": [
                        [
                            10,
                            12
                        ]
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1166",
                    "loc": [
                        [
                            9,
                            12
                        ]
                    ]
                },
                {
                    "type": "changePos",
                    "direction": "right"
                },
                {
                    "type": "turnBlock",
                    "direction": "right",
                    "loc": [
                        [
                            3,
                            11
                        ]
                    ]
                },
                {
                    "type": "turnBlock",
                    "direction": "right",
                    "loc": [
                        [
                            3,
                            12
                        ]
                    ]
                },
                "\t[立天,N331]\b[this,3,11]不好，是邱菱这个混蛋",
                "\t[奕开,hero]\b[hero]可恶啊！",
                "\t[邱菱,N1164]\b[this,11,10]把整个林子仔仔细细地给我搜一遍！不要放过一个角落！",
                "\t[众侍卫,N1166]是！",
                "\t[奕开,hero]\b[hero]这样下去不行，他们迟早会搜到这里来的，我去引来他们，你俩找机会逃脱！",
                "\t[立天,N331]\b[this,3,11]不，他们的目标是我，你们两个没必要牵扯进来。何况……我的灵魂是破碎的，我活不过三年了……",
                "\t[奕开,hero]\b[hero]！！！",
                "\t[立天,N331]\b[this,3,11]你们还有大好的时光，不要把生命浪费在我这个将死之人这里了。",
                "\t[韩樱姝,N1036]\b[this,3,12]立天，你想的太简单了，我俩早已牵扯进来了，岂是想走就走的？",
                "\t[奕开,hero]\b[hero]没错，身为侍卫，怎么能让皇子去冒险，你哪怕只剩下一天，我也不能让你去犯险。",
                "\t[立天,N331]\b[this,3,11]我这不是犯险，我的生命所剩不多，如果能为我的两个挚友死去，那将是值得的，你们本来就能活下去，不要放弃自己的生命来救我这个废物",
                "\t[韩樱姝,N1036]\b[this,3,12]听我说，今天他们搜山，我们必然是无法全身而退了。待会一个人引来他们之后，还有两个人要穿过重重包围。所以，武功最强的奕开，你决不能死。",
                "\t[韩樱姝,N1036]\b[this,3,12]立天，你是皇子，你的生命不是你一个人的，今晚你能逃出来，死去的绝不只有几个帮助我们拦路的守卫，更有不少暗中保护我们的忠臣良将，他们誓死保卫你出来，你就去赴死了，对得住他们吗？",
                "\t[韩樱姝,N1036]\b[this,3,12]因此，我才是最适合引开他们的人。",
                "\t[奕开,hero]\b[hero]樱姝！",
                {
                    "type": "turnBlock",
                    "direction": "up",
                    "loc": [
                        [
                            3,
                            12
                        ]
                    ]
                },
                "\t[韩樱姝,N1036]\b[this,3,12]再见了，开哥哥，再见了，立天。",
                "\t[立天,N331]\b[this,3,11]樱姝！",
                {
                    "type": "turnBlock",
                    "direction": "right",
                    "loc": [
                        [
                            3,
                            12
                        ]
                    ]
                },
                {
                    "type": "move",
                    "loc": [
                        3,
                        12
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "right:5"
                    ]
                },
                {
                    "type": "move",
                    "loc": [
                        3,
                        11
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "down:1"
                    ]
                },
                {
                    "type": "turnBlock",
                    "direction": "right",
                    "loc": [
                        [
                            3,
                            12
                        ]
                    ]
                },
                "\t[立天,N331]\b[this,3,12]樱姝！",
                {
                    "type": "jumpHero",
                    "loc": [
                        3,
                        11
                    ],
                    "time": 500
                },
                "\t[奕开,hero]\b[hero]嘘！",
                "\t[立天,N331]\b[this,3,11]樱姝！唔……",
                "\t[韩樱姝,N1036]\b[this,8,12]喂，大蠢蛋，我在这呢！",
                {
                    "type": "jump",
                    "from": [
                        8,
                        12
                    ],
                    "to": [
                        11,
                        6
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "turnBlock",
                    "direction": "up",
                    "loc": [
                        [
                            11,
                            6
                        ]
                    ]
                },
                "\t[韩樱姝,N1036]\b[this,11,6]哈哈，来追我呀！",
                {
                    "type": "jump",
                    "from": [
                        11,
                        6
                    ],
                    "to": [
                        6,
                        5
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "turnBlock",
                    "direction": "right",
                    "loc": [
                        [
                            6,
                            5
                        ]
                    ]
                },
                "\t[邱菱,N1164]\b[this,11,10]给我追！",
                {
                    "type": "jump",
                    "from": [
                        11,
                        10
                    ],
                    "to": [
                        9,
                        5
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "jump",
                    "from": [
                        12,
                        9
                    ],
                    "to": [
                        10,
                        4
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "jump",
                    "from": [
                        12,
                        10
                    ],
                    "to": [
                        10,
                        5
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "jump",
                    "from": [
                        12,
                        11
                    ],
                    "to": [
                        10,
                        6
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "jump",
                    "from": [
                        9,
                        12
                    ],
                    "to": [
                        11,
                        4
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "jump",
                    "from": [
                        10,
                        12
                    ],
                    "to": [
                        11,
                        5
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "jump",
                    "from": [
                        11,
                        12
                    ],
                    "to": [
                        11,
                        6
                    ],
                    "time": 500,
                    "keep": true
                },
                "\t[邱菱,N1164]\b[this,9,5]喂，贱人，眼前就是悬崖了，看你往哪跑！告诉我，那两个小子在哪，饶你一命！",
                {
                    "type": "jumpHero",
                    "loc": [
                        8,
                        11
                    ],
                    "time": 500
                },
                {
                    "type": "changePos",
                    "direction": "up"
                },
                {
                    "type": "jump",
                    "from": [
                        3,
                        12
                    ],
                    "to": [
                        7,
                        11
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "turnBlock",
                    "direction": "up",
                    "loc": [
                        [
                            7,
                            11
                        ]
                    ]
                },
                "\t[奕开,hero]\b[hero]樱姝……",
                "\t[立天,N331]\b[this,7,11]樱姝！",
                "\t[韩樱姝,N1036]\b[this,6,5]哼，我不知道他们在哪，今天，我虽然死去，但我的朋友不会放过你的！",
                {
                    "type": "move",
                    "loc": [
                        6,
                        5
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "left:1"
                    ]
                },
                {
                    "type": "jump",
                    "from": [
                        5,
                        5
                    ],
                    "to": [
                        5,
                        9
                    ],
                    "time": 500
                },
                "\t[奕开,hero]\b[hero]樱姝！",
                "\t[立天,N331]\b[this,7,11]樱姝！",
                "\t[奕开,hero]\b[hero]立天，现在不是悲伤的时候，咱们快走吧！",
                "\t[立天,N331]\b[this,7,11]好，咱们一定回来报仇！",
                {
                    "type": "hide",
                    "loc": [
                        [
                            7,
                            11
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "setBlock",
                    "number": "N1165",
                    "loc": [
                        [
                            5,
                            12
                        ]
                    ],
                    "floorId": "MT90"
                },
                {
                    "type": "setBlock",
                    "number": "N333",
                    "loc": [
                        [
                            1,
                            12
                        ]
                    ],
                    "floorId": "MT90"
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT90",
                    "loc": [
                        2,
                        12
                    ],
                    "direction": "right"
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            9,
                            5
                        ]
                    ],
                    "floorId": "MT100",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            4
                        ]
                    ],
                    "floorId": "MT100",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            5
                        ]
                    ],
                    "floorId": "MT100",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            6
                        ]
                    ],
                    "floorId": "MT100",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            11,
                            4
                        ]
                    ],
                    "floorId": "MT100",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            11,
                            5
                        ]
                    ],
                    "floorId": "MT100",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            11,
                            6
                        ]
                    ],
                    "floorId": "MT100",
                    "remove": true
                },
                "\t[撒罗德,N1165]\b[this,5,12]等你们很久了！",
                "\t[奕开,hero]\b[hero]我跟你拼了！",
                {
                    "type": "jumpHero",
                    "loc": [
                        4,
                        12
                    ],
                    "time": 500
                },
                {
                    "type": "animate",
                    "name": "hand",
                    "loc": [
                        4,
                        12
                    ]
                },
                {
                    "type": "jumpHero",
                    "loc": [
                        2,
                        12
                    ],
                    "time": 500
                },
                "\t[奕开,hero]\b[hero]啊！",
                {
                    "type": "jumpHero",
                    "loc": [
                        4,
                        12
                    ],
                    "time": 500
                },
                {
                    "type": "animate",
                    "name": "hand",
                    "loc": [
                        4,
                        12
                    ]
                },
                {
                    "type": "jumpHero",
                    "loc": [
                        2,
                        12
                    ],
                    "time": 500
                },
                "\t[奕开,hero]\b[hero]再来！",
                {
                    "type": "jumpHero",
                    "loc": [
                        4,
                        12
                    ],
                    "time": 500
                },
                {
                    "type": "animate",
                    "name": "hand",
                    "loc": [
                        4,
                        12
                    ]
                },
                {
                    "type": "jumpHero",
                    "loc": [
                        2,
                        12
                    ],
                    "time": 500
                },
                {
                    "type": "jump",
                    "from": [
                        1,
                        12
                    ],
                    "to": [
                        3,
                        12
                    ],
                    "time": 500,
                    "keep": true
                },
                "\t[立天,N331]\b[this,3,12]你快走！",
                "\t[奕开,hero]\b[hero]我不走！我今天来救你们俩，结果樱姝死了，你还要被抓走！我真是失败啊啊啊啊啊！",
                "\t[立天,N331]\b[this,3,12]奕开，你不是失败的，樱姝不会怪你，我也不会怪你，这不是你的错。",
                "\t[立天,N331]\b[this,3,12]我真怀念从前在学院与你打闹的日子，那是我最美好的时光……可是我好贪心，好不容易重逢，却又要离别……",
                "\t[立天,N331]\b[this,3,12]如果有来生，我们再做好兄弟吧！",
                "\t[奕开,hero]\b[hero]立天，你要做什么！",
                "\t[撒罗德,N1165]\b[this,5,12]你们说够了没?",
                "\t[立天,N331]\b[this,3,12]住手！你们要的人是我，放了他！",
                "\t[撒罗德,N1165]\b[this,5,12]你有什么资格与我谈条件?",
                "\t[立天,N331]\b[this,3,12]我知道你们想要杀我，不过肯定不是现在。如果我现在就死了，到时候支持我的势力，我的外祖父，永亲王，还有各位大臣，还有掌握兵权的立环公主，都不会善罢甘休的！你看着办吧！",
                "\t[撒罗德,N1165]\b[this,5,12]哼！",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                "撒罗德分神之际，奕开眼前一黑，只觉得天旋地转……",
                {
                    "type": "hide",
                    "loc": [
                        [
                            5,
                            12
                        ]
                    ],
                    "floorId": "MT90",
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            3,
                            12
                        ]
                    ],
                    "floorId": "MT90",
                    "remove": true
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT68",
                    "loc": [
                        2,
                        3
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N1125",
                    "loc": [
                        [
                            4,
                            3
                        ]
                    ],
                    "floorId": "MT68"
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[奕开,hero]\b[hero]王学长！",
                "\t[王磊,N1116]\b[this,4,3]你还在那磨磨蹭蹭不走做什么？我再不出手，你就被杀了。",
                "\t[奕开,hero]\b[hero]王学长，你为什么不救立天！为什么不杀了撒罗德?",
                "\t[王磊,N1116]\b[this,4,3]我说了，我代表的是灵兽学院，我出手意味着灵兽学院插手皇室的皇位争夺了。你懂吗？",
                "\t[奕开,hero]\b[hero]可是……",
                "\t[王磊,N1116]\b[this,4,3]你放心，立天短时间不会有事的，他们没有韩樱姝逼韩家站队，那总得留着立天削弱立天背后的势力才敢动手。",
                "\t[王磊,N1116]\b[this,4,3]否则的话，那就是直接与立天背后的势力开战了。",
                "\t[王磊,N1116]\b[this,4,3]咱们赶紧回灵兽学院吧！"
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "floorId": "MT1",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "floorId": "MT1",
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "MT1",
            "loc": [
                6,
                11
            ],
            "direction": "up"
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    3
                ]
            ],
            "floorId": "MT68",
            "remove": true
        },
        "\t[奕开,hero]\b[hero]怎么回事！晏夫学长呢？",
        "\t[王磊,N1116]灵兽学院出事了！你赶紧去\r[red]54层西侧\r[]找金院长和金若美！",
        {
            "type": "show",
            "loc": [
                [
                    1,
                    6
                ]
            ],
            "floorId": "MT54"
        },
        {
            "type": "setBlock",
            "number": "upFloor",
            "loc": [
                [
                    1,
                    6
                ]
            ],
            "floorId": "MT54"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,12": {
            "floorId": "MT90",
            "loc": [
                0,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {
        "6,5": [
            "left"
        ],
        "3,10": [
            "up"
        ],
        "7,4": [
            "up"
        ],
        "8,4": [
            "up"
        ],
        "9,4": [
            "up"
        ],
        "10,4": [
            "up"
        ],
        "11,4": [
            "up"
        ],
        "12,4": [
            "up"
        ]
    },
    "cannotMoveIn": {
        "6,5": [
            "left"
        ],
        "3,10": [
            "up"
        ],
        "7,4": [
            "up"
        ],
        "8,4": [
            "up"
        ],
        "9,4": [
            "up"
        ],
        "10,4": [
            "up"
        ],
        "11,4": [
            "up"
        ],
        "12,4": [
            "up"
        ]
    },
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,20333,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80304,80305,80305,80305,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80296,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80296,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80296,  0,  0],
    [  0,  0,20333,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20341,  0,20273,20274,20275,  0,  0,  0,  0,  0,  0],
    [  0,  0,20341,  0,  0,  0,  0,  0,  0,  0,  0,  0, 88]
],
    "bgmap": [
    [20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390],
    [20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390],
    [20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390],
    [20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390,20390],
    [20390,20390,20390,20390,20390,20390,20390,20334,20334,20334,20334,20334,20334],
    [20390,20390,20390,20390,20390,20390,20341,  0,  0,  0,  0,  0,  0],
    [20390,20390,20390,20390,20390,20390,  0,  0,  0,  0,  0,  0,  0],
    [20390,20390,20390,20390,20390,20390,80312,80313,80313,80313,  0,  0,  0],
    [20390,20390,20390,20390,20390,20390,80312,80313,80313,80313,  0,  0,  0],
    [20390,20390,20390,20390,20390,20390,80312,80313,80313,80313,  0,  0,  0],
    [20390,20390,20390,20334,20334,20334,20334,20334,20334,20334,  0,  0,  0],
    [20390,20390,20390,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20390,20390,20390,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20048,  0,  0,20051,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,20049,20050,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20056,20057,20058,20059,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20064,20065,20066,20067,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20072,20073,20074,20075,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,20324,20324,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        12,
        12
    ]
}