main.floors.MT101=
{
    "floorId": "MT101",
    "title": "主塔 101 层",
    "name": "101",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X101592",
    "bgm": "BOSS.mp3",
    "firstArrive": [
        {
            "type": "jumpHero",
            "loc": [
                6,
                6
            ],
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "left"
        },
        "\t[奕开,hero]\b[hero]金学姐?金学姐，在吗？",
        {
            "type": "setBlock",
            "number": "N1141",
            "loc": [
                [
                    11,
                    6
                ]
            ]
        },
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[奕开,hero]\b[hero]你是什么人？",
        {
            "type": "jumpHero",
            "loc": [
                5,
                6
            ],
            "time": 500,
            "async": true
        },
        {
            "type": "move",
            "loc": [
                11,
                6
            ],
            "time": 500,
            "keep": true,
            "async": true,
            "steps": [
                "left:1"
            ]
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "jumpHero",
            "loc": [
                3,
                6
            ],
            "time": 500,
            "async": true
        },
        {
            "type": "move",
            "loc": [
                10,
                6
            ],
            "time": 500,
            "keep": true,
            "async": true,
            "steps": [
                "left:1"
            ]
        },
        {
            "type": "waitAsync"
        },
        "\t[奕开,hero]\b[hero]我想起来了，你就是上次我离开灵兽学院的时候，碰到那个问路的！",
        "\t[???,N1140]\b[this,9,6]废话真多，受死吧！",
        {
            "type": "animate",
            "name": "yongchang",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "setBlock",
            "number": "N557",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        "\t[金若美,N555]\b[this,6,6]住手！",
        "\t[???,N1140]\b[this,9,6]你就是玄金琉璃的现任主人，金若美吧！",
        "\t[金若美,N555]\b[this,6,6]正是。阁下想必就是灵兽榜上排名第三的黑魔兽主人，魔法岛二皇子，巫浩阁下吧。",
        "\t[巫浩,N1140]\b[this,9,6]百年前，数十年前，玄金琉璃都一直是排名第六，你不是我的对手。",
        "\t[奕开,hero]\b[hero]学姐，我来帮你",
        "\t[金若美,N555]\b[this,6,6]你躲远些，这种级别的战斗，不是你一个五阶训练师能插手的！",
        "\t[奕开,hero]\b[hero]……",
        {
            "type": "setBlock",
            "number": "N336",
            "loc": [
                [
                    10,
                    5
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N1155",
            "loc": [
                [
                    10,
                    7
                ]
            ]
        },
        "\t[???,N335]\b[this,10,5]哈哈哈哈哈！金若美，你看起来挺镇定自若的嘛！",
        "\t[黎峰,N1154]\b[this,10,7]不知你敢不敢一打三呢？",
        "\t[金若美,N555]\b[this,6,6]……你们是?",
        "\t[???,N335]\b[this,10,5]我是灵兽榜上排名并列第三，千手猩皇现任主人，魔法岛将军巫豹。",
        "\t[黎峰,N1154]\b[this,10,7]灵兽榜上排名第九，暗夜幽蝠现任主人，魔法岛法师黎峰。",
        "\t[奕开,hero]\b[hero]嘶(倒吸一口凉气)……这场战斗真和我没有任何关系了……",
        "\t[邓天博,N1128]魔法岛看起来很嚣张啊！",
        {
            "type": "animate",
            "name": "yongchang",
            "loc": [
                5,
                5
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "yongchang",
            "loc": [
                5,
                6
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "yongchang",
            "loc": [
                5,
                7
            ],
            "async": true
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "setBlock",
            "number": "N1130",
            "loc": [
                [
                    5,
                    6
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N349",
            "loc": [
                [
                    5,
                    5
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N1126",
            "loc": [
                [
                    5,
                    7
                ]
            ]
        },
        "\t[巫浩,N1140]\b[this,9,6]想必三位便是灵兽榜上排名第七，冰炮玄武之主邓天博；灵兽榜上排名第八，远古石皇之主王磊；灵兽榜上排名第十，飞天神雀之主晏夫了。",
        "\t[奕开,hero]\b[hero]灵兽榜上排名前十就来了七个，看来这里免不了一场大战了。",
        "\t[巫豹,N335]\b[this,10,5]哈哈哈哈哈！你们几个排名靠后，我们三打四，也算是让让你们了",
        "\t[晏夫,N347]\b[this,5,5]哼，魔法岛竟敢先挑起战争，当真是不怕世界国呀。",
        "\t[巫豹,N335]\b[this,10,5]什么狗屁世界国，天晶帝国吞并了太多的国家，如今也只剩下魔法岛了，我们现在不趁着天晶帝国还没消化那些国家，难道等天晶帝国消化所有的国家之后，再吞并魔法岛么？",
        {
            "type": "jump",
            "from": [
                6,
                6
            ],
            "to": [
                4,
                6
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    4,
                    6
                ]
            ]
        },
        "\t[金若美,N555]\b[this,4,6]这里很快就要打起来了，你赶紧离开。我交代你一件事。",
        "\t[奕开,hero]\b[hero]学姐请讲",
        "\t[金若美,N555]\b[this,4,6]根据我们这些时候的观察，你的火系天赋异于常人，实力也很强大。甚至，你的血能够催化魔焰星君的炽火果……所以，你大概率是魔焰星君主人的转世",
        "\t[奕开,hero]\b[hero]???怎么扯到转世上来了。",
        "\t[金若美,N555]\b[this,4,6]百年前，各国便举行了一场灵兽排行，不久后，便发生了大战。灵兽榜上排名前二十的灵兽排名至今从未变动，但它们的主人都在上次灵兽大战中战死……",
        "\t[金若美,N555]\b[this,4,6]如今，其他十八只灵兽都已经找到了它们主人的转世，只剩下魔焰星君和独天神兽还未找到主人，因此它们一直在隐居。",
        "\t[金若美,N555]\b[this,4,6]本来，我们还想等你再变强一些再去找魔焰星君，现在看来，你不得不赶紧去找魔焰星君了！",
        "\t[奕开,hero]\b[hero]魔焰星君、黑魔兽、千手猩皇三个灵兽并列第三。只是魔焰星君在何处呀?",
        "\t[金若美,N555]\b[this,4,6]魔焰星君就在三大禁地之一的\r[red]火龙山谷。\r[]你尽快过去找到魔焰星君，才能扭转战局。",
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    4,
                    6
                ]
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    1,
                    11
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N343",
            "loc": [
                [
                    1,
                    11
                ]
            ]
        },
        "可以去找金莫提交成绩（灵兽学院更新了下期剧情的彩蛋）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,11": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "choices",
                    "text": "\t[金莫,N343]选择提交成绩",
                    "choices": [
                        {
                            "text": "提交",
                            "action": [
                                {
                                    "type": "win",
                                    "reason": "普通结局"
                                }
                            ]
                        },
                        {
                            "text": "再逛逛",
                            "action": []
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "12,6": {
            "floorId": "MT54",
            "loc": [
                1,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10013,10013,10013,10013,10013,10013,10013,10013,10013,10013,10013,10013,10013],
    [10013,  0,  0,  0,  0,40082,40083,40084,  0,  0,  0,  0,10013],
    [10013,40080,40081,  0,  0,40090,40091,40092,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 88],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10013],
    [10013,10013,10013,10013,10013,10013,10013,10013,10013,10013,10013,10013,10013]
],
    "bgmap": [

],
    "fgmap": [
    [  0,40064,40065,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,40072,40073,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        12,
        6
    ]
}