main.floors.MT17=
{
    "floorId": "MT17",
    "title": "主塔 17 层",
    "name": "17",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X101592",
    "bgm": "sanbu.mp3",
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "floorId": "MT4",
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    1,
                    7
                ]
            ],
            "floorId": "MT0",
            "remove": true
        },
        {
            "type": "setBlock",
            "number": "upFloor",
            "loc": [
                [
                    0,
                    7
                ]
            ],
            "floorId": "MT0"
        },
        {
            "type": "jumpHero",
            "loc": [
                6,
                1
            ],
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        "\t[奕开,hero]\b[hero]樱姝!",
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    6,
                    7
                ]
            ]
        },
        "\t[韩樱姝,N1036]\b[this,6,7]开哥哥!",
        {
            "type": "moveHero",
            "async": true,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "move",
            "loc": [
                6,
                7
            ],
            "time": 500,
            "keep": true,
            "async": true,
            "steps": [
                "up:2"
            ]
        },
        {
            "type": "waitAsync"
        },
        "\t[韩樱姝,N1036]\b[this,6,7]恭喜你拿到了开学测试的第一名啊",
        "\t[奕开,hero]\b[hero]樱姝，你的成绩也挺好呀",
        "\t[韩樱姝,N1036]\b[this,6,7]很不幸，我和你不一样。老师说，我的个人武力算是同龄人里面顶尖的，可是训练师能力极差。",
        "\t[韩樱姝,N1036]\b[this,6,7]已经训练了一段日子了，学院要求我们去各处灵兽多的地方，捕捉一些灵兽，最多可以组队三个人。",
        "\t[奕开,hero]\b[hero]好，依咱俩的实力，应该是没有问题的。",
        {
            "type": "setBlock",
            "number": "N331",
            "loc": [
                [
                    6,
                    1
                ]
            ]
        },
        "\t[立天,N331]\b[this,6,1]奕开，你在这里做什么？我找你很久了!",
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[奕开,hero]\b[hero]立天?",
        "\t[韩樱姝,N1036]\b[this,6,7]你是谁?",
        "\t[立天,N331]\b[this,6,1]我是奕开的主子，他是我的贴身侍卫，你又是什么人？",
        "\t[韩樱姝,N1036]\b[this,6,7]哼，主子?你是什么东西，也敢让开哥哥当你的侍卫!",
        "\t[奕开,hero]\b[hero]别吵了，立天与我是挚友，樱姝是我的红颜，你们二人都是我最重要的朋友，",
        "\t[立天,N331]\b[this,6,1]哼。奕开，我也要和你一起去捕捉灵兽。",
        "\t[奕开,hero]\b[hero]立天，你也去?",
        "\t[立天,N331]\b[this,6,1]怎么，不行吗?打扰你们二人世界了?",
        "\t[奕开,hero]\b[hero]也不是，行吧。那咱一起去。我计划去\r[red]学院西侧的杏子岭\r[]，你们觉得怎么样",
        "\t[立天,N331]\b[this,6,1]可以。",
        "\t[韩樱姝,N1036]\b[this,6,7]走吧。",
        "\t[立天,N331]\b[this,6,1]奕开，你帮我拿东西。",
        "\t[韩樱姝,N1036]\b[this,6,7]?喂，你是不是搞错了，我一个女孩子都没有让人拿东西",
        "\t[立天,N331]\b[this,6,1]他是我的侍卫，你有意见吗？",
        "\t[韩樱姝,N1036]\b[this,6,7]哼！",
        {
            "type": "follow",
            "name": "hero.png"
        },
        {
            "type": "follow",
            "name": "hanyingshu.png"
        },
        {
            "type": "changeFloor",
            "floorId": "MT0",
            "loc": [
                3,
                7
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    1
                ]
            ],
            "floorId": "MT17",
            "remove": true
        },
        "\t[立天,N331]没想到，在这里竟然有一条通往杏子岭的路。",
        "\t[奕开,hero]\b[hero]灵兽军事学院是帝国最强的军事力量，当然要隐藏的很深了。咱们快走吧"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": "MT16",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [30006,30007,  0,  0,  0,  0, 88,  0,  0,  0,30007,  0,30023],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [30023,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30006],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30023],
    [30006,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,1036,  0,  0,  0,  0,  0,  0],
    [30023,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30006],
    [30048,30049,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [30059,30060,30061,  0,  0,  0,30047,30048,30049,  0,  0,  0,  0],
    [30059,30060,30060,30061,  0,30057,30058,30059,30060,30061,30047,30048,30049]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20120,20121],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20128,20129],
    [20049,20050,  0,20049,20050,  0,  0,  0,  0,  0,  0,20136,20137]
],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        0
    ]
}