main.floors.MT41=
{
    "floorId": "MT41",
    "title": "主塔 41 层",
    "name": "41",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X101592",
    "bgm": "bxsgzz.mp3",
    "firstArrive": [
        {
            "type": "confirm",
            "text": "确认要跳过剧情吗?",
            "yes": [
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "setBlock",
                    "number": "N1006",
                    "loc": [
                        [
                            11,
                            6
                        ]
                    ]
                }
            ],
            "no": [
                "\t[沈清妍,npc0]\b[this,6,6]快点过来啦",
                {
                    "type": "changePos",
                    "direction": "right"
                },
                {
                    "type": "moveHero",
                    "steps": [
                        "right:5"
                    ]
                },
                "\t[奕开,hero]\b[hero]你也过去?",
                "\t[沈清妍,npc0]\b[this,6,6]听说邓天博学长在你入学不久曾指导过你如何训练灵兽，是不是呀",
                "\t[奕开,hero]\b[hero]嗯嗯。",
                "\t[沈清妍,npc0]\b[this,6,6]那太好了，你们熟悉，你可以帮我引荐一下吗，让学长指点我一二。",
                "\t[奕开,hero]\b[hero]……行吧。",
                "\t[沈清妍,npc0]\b[this,6,6]谢谢你哦",
                {
                    "type": "setBlock",
                    "number": "N1006",
                    "loc": [
                        [
                            11,
                            6
                        ]
                    ]
                },
                "\t[???,N1006]\b[this,11,6]两位好呀",
                {
                    "type": "turnBlock",
                    "direction": "right",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ]
                },
                "\t[沈清妍,npc0]\b[this,6,6]?大叔，你谁呀？",
                "\t[???,N1006]\b[this,11,6]这个不重要",
                "\t[沈清妍,npc0]\b[this,6,6]有病?",
                "\t[???,N1006]\b[this,11,6]很快，你们二位，就会化作一团灰烬了。",
                "\t[沈清妍,npc0]\b[this,6,6]?",
                "\t[???,N1006]\b[this,11,6]出来吧，火焰骷髅!",
                {
                    "type": "setBlock",
                    "number": "E717",
                    "loc": [
                        [
                            9,
                            6
                        ]
                    ]
                },
                "\t[火焰骷髅,E717]\b[this,9,6]吼!",
                {
                    "type": "setBlock",
                    "number": "N1020",
                    "loc": [
                        [
                            1,
                            6
                        ]
                    ]
                },
                "\t[??,N1020]\b[this,1,6]今天是个好日子呀~",
                {
                    "type": "move",
                    "loc": [
                        1,
                        6
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "right:1"
                    ]
                },
                "\t[??,N1020]\b[this,2,6]!!!打扰了!",
                {
                    "type": "changePos",
                    "direction": "left"
                },
                {
                    "type": "turnBlock",
                    "direction": "left",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ]
                },
                "\t[沈清妍,npc0]\b[this,6,6]萧宜大哥~",
                "\t[???,N1006]\b[this,11,6]火焰骷髅!别让他们跑了",
                {
                    "type": "jump",
                    "from": [
                        9,
                        6
                    ],
                    "to": [
                        1,
                        6
                    ],
                    "time": 500,
                    "keep": true
                },
                "\t[火焰骷髅,E717]\b[this,1,6]吼!",
                "\t[萧谊,N1020]\b[this,2,6]可恶啊，你干嘛拉我下水",
                "\t[沈清妍,npc0]\b[this,6,6]萧谊，对不起了，我俩可打不过这只三阶灵兽，多个人就多一分活下来的希望。",
                "\t[萧谊,N1020]\b[this,2,6]……我也打不过啊",
                "\t[奕开,hero]\b[hero]没事，咱们进石洞吧",
                "\t[沈清妍,npc0]\b[this,6,6]石洞?你们进去过吗？听说这里面是灵兽学院的迷宫……",
                "\t[奕开,hero]\b[hero]对我们来说是迷宫，对这个不是灵兽学院的家伙，恐怕也是迷宫吧",
                "\t[沈清妍,npc0]\b[this,6,6]好，那快走",
                {
                    "type": "jump",
                    "from": [
                        2,
                        6
                    ],
                    "to": [
                        6,
                        1
                    ],
                    "time": 500
                },
                {
                    "type": "turnBlock",
                    "direction": "up",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ]
                },
                {
                    "type": "jump",
                    "from": [
                        6,
                        6
                    ],
                    "to": [
                        6,
                        1
                    ],
                    "time": 500
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "0,6": {
            "floorId": "MT16",
            "loc": [
                12,
                6
            ]
        },
        "12,6": {
            "floorId": "MT53",
            "loc": [
                0,
                6
            ]
        }
    },
    "beforeBattle": {
        "1,6": [
            "\t[火焰骷髅,E717]\b[this]吼！"
        ]
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [30667,30444,30646,30653,20431,20431,20422,20431,20431,30444,30653,30444,30667],
    [30653,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30444],
    [30653,  0,30652,  0,30654,  0,  0,  0,30652,  0,30654,  0,30667],
    [30667,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30444],
    [30444,  0,  0,  0,  0,30652,  0,  0,  0,  0,  0,  0,30444],
    [30444,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20037,20237],
    [ 88,  0,  0,  0,  0,  0,134,  0,  0,  0,  0,  0, 87],
    [30444,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20038,30444],
    [30444,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30653],
    [30667,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30444],
    [30444,  0,  0,  0,  0,  0,  0,  0,  0,30652,  0,  0,30444],
    [30646,  0,  0,30652,  0,  0,  0,  0,  0,  0,  0,  0,30646],
    [30444,30667,30646,30444,30653,30646,30654,30444,30667,30444,30667,30653,30653]
],
    "bgmap": [
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000,20000],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20204,20205],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20212,20213],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20220,20221],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20228,20229],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20240,20241,20242,20243,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20248,20249,20250,20251,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        0,
        6
    ]
}