main.floors.MT42=
{
    "floorId": "MT42",
    "title": "主塔 42 层",
    "name": "42",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10001",
    "bgm": "bxsgzz.mp3",
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    1,
                    6
                ]
            ],
            "floorId": "MT41",
            "remove": true
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[???,moneyShop]主人。",
        "\t[???,N1116]万古石皇，何事？",
        "\t[万古石皇,moneyShop]主人，有人闯入了您的洞中。",
        "\t[???,N1116]此等小事，何必告诉我",
        "\t[万古石皇,moneyShop]是这样的，一个三阶火焰骷髅追杀灵兽学院的三个学生，您是灵兽学院的守护者，要不要去救……",
        "\t[???,N1116]才三阶灵兽，灵兽学院的四阶训练师和五阶训练师呢？都死光了吗？屁大点事就找我，我还以为是魔法岛入侵了呢",
        "\t[万古石皇,moneyShop]可是……",
        "\t[???,N1116]闭嘴，不救就不救，要是死了也是他们命该绝，继续挖石道。",
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "if",
            "condition": "(flag:hard===0)",
            "true": [
                "强力炸弹*1(可以炸一层，出去boss层，任意炸一层获得一层宝物总该能过了吧)\n推荐套装：双紫幻灭或者骷髅套装",
                {
                    "type": "setValue",
                    "name": "item:I485",
                    "operator": "+=",
                    "value": "1"
                }
            ],
            "false": []
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "MT41",
            "loc": [
                6,
                0
            ]
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10022,10022,10022,10022,10022,10022,10022,10022,10022,10022,10022,10022,10022],
    [10022,  0,  0,890,  0,  0, 87,  0,280,  0,  0,444,10022],
    [10022, 81,10022,10022,10022, 21,  0, 21,10022,  0,266,  0,10022],
    [10022,373,10022,444,10022,10022,564,10022,10022,10022, 81,10022,10022],
    [10022,370,560,380,10022,383,384,385,10022,379,  0,444,10022],
    [10022,10022,10022, 81,10022,10022,10022,10022,10022,10022,562,10022,10022],
    [10022, 21,  0,  0,908,552,  0,552,908,  0,  0,376,10022],
    [10022,10022,10022,280,10022,  0,355,  0,10022,444,  0,  0,10022],
    [10022,446,10022,  0,10022,444,  0,444,10022,10022,10022,266,10022],
    [10022,389,10022, 21,10022,10022, 81,10022,10022,  0,444,  0,10022],
    [10022,562,10022,444,10022,  0,560,  0,10022, 82,10022,10022,10022],
    [10022,  0, 81,  0,10022,  0,  0,  0,10022,635,382, 24,10022],
    [10022,10022,10022,10022,10022,10022, 88,10022,10022,10022,10022,10022,10022]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ]
}