main.floors.MT5=
{
    "floorId": "MT5",
    "title": "主塔 5 层",
    "name": "5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "ruozha.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,4": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    {
                        "type": "if",
                        "condition": "(item:I366===1)",
                        "true": [
                            "\t[金莫,N343]\b[this]恭喜你获得了自己的灵兽",
                            "\t[奕开,hero]\b[hero]谢谢院长",
                            "\t[金莫,N343]\b[this]不过，这只是个开始罢了，现在，你要进行开学测试，我希望你可以拿到一个好成绩。",
                            "\t[奕开,hero]\b[hero]定当全力以赴!",
                            "\t[金莫,N343]\b[this]很好，我现在为你开启开学测试!",
                            {
                                "type": "changeFloor",
                                "floorId": "MT6",
                                "loc": [
                                    6,
                                    1
                                ]
                            },
                            {
                                "type": "hide",
                                "loc": [
                                    [
                                        9,
                                        4
                                    ]
                                ],
                                "floorId": "MT5",
                                "remove": true
                            }
                        ],
                        "false": []
                    }
                ],
                "false": [
                    {
                        "type": "if",
                        "condition": "(flag:kaixueshilian===1)",
                        "true": [
                            "\t[金莫,N343]\b[this]准备好了获得你的灵兽吗",
                            "\t[金莫,N343]\b[this]既然准备好了，那你就进去接受试炼吧！",
                            {
                                "type": "hide",
                                "loc": [
                                    [
                                        7,
                                        6
                                    ]
                                ],
                                "remove": true
                            },
                            {
                                "type": "setValue",
                                "name": "switch:A",
                                "value": "true"
                            }
                        ],
                        "false": [
                            "\t[金莫,N343]\b[this]灵兽试炼是灵兽军事学院对学生的一场试炼，让学生拥有第一只灵兽",
                            "\t[金莫,N343]\b[this]现在灵兽试炼还没开始，你先去别处看看吧"
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "12,3": {
            "floorId": "MT1",
            "loc": [
                0,
                3
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "1,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT5_2_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "3,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT5_2_8",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {
        "2,10": [
            "\t[奕开,hero]\b[hero]啊，捕获了第一只灵兽!",
            "找金莫提交任务再装备"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {
        "2,8": {
            "0": {
                "condition": "flag:door_MT5_2_8==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT5_2_8",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [ 27,201,  0, 22,  0,31804, 31,152,  0,30424,  0,  0,31804],
    [152,152, 31,  0, 30,152, 29,152,  0,  0,  0,  0, 88],
    [152,152,  0,202,  0,152,201,152,  0,343,  0,  0,  0],
    [152,152,30387, 81,152,152, 81,152,  0,  0,  0,  0,  0],
    [152,  0,  0,  0,  0,30424,  0, 85,  0,  0,  0,  0,30300],
    [152,203,  0,203,  0,201,  0,152,  0,  0,152,152,152],
    [152,152, 85,152,152,30023, 81,152,152,152,152,152,152],
    [152, 33,  0, 21,152,  0,202,  0,202, 28,152,152,152],
    [152,  0,366,  0,152, 29,  0, 32,152,31701,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152],
    [152,152,152,152,152,152,152,152,152,152,152,152,152]
],
    "bgmap": [

],
    "fgmap": [
    [30514,  0,  0,30041,  0,  0,20539,20540,  0,30520,31804,  0,30388],
    [  0,  0,30384,  0,  0,  0,20547,20548,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [30514,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30295],
    [31804,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30220,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,31814],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,31804,  0],
    [  0,  0,  0,31771,31772,31773,30501,  0,  0,  0,  0,31776,31777],
    [  0,  0,31804,31782,31783,31784,30502,  0,30220,  0,  0,31785,31786],
    [30388,  0,  0,31791,31792,31793,30503,  0,  0,  0,30388,  0,30041]
],
    "bg2map": [

],
    "fg2map": [

]
}