main.floors.MT53=
{
    "floorId": "MT53",
    "title": "主塔 53 层",
    "name": "53",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X101592",
    "bgm": "zq.mp3",
    "firstArrive": [
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[邓天博,N1128]\b[this,9,6]奕开，你怎么现在才来呀",
        "\t[奕开,hero]\b[hero]抱歉啊，邓学长，我昨晚被人追杀，进入了北边的密洞里面，绕了好久才出来。",
        "\t[邓天博,N1128]\b[this,9,6]你被人追杀?还去了北边的密洞?王磊没有出手救你吗？",
        "\t[奕开,hero]\b[hero]王磊?邓学长所说的，可是远古石皇之主，王学长?",
        "\t[沈清妍,npc0]\b[this,2,5]邓学长，那密洞里面只有一堆虫子，还有一个大大的毒蜈蚣，根本就没有人。",
        "\t[邓天博,N1128]\b[this,9,6]我知道了，奕开，你多加小心。我这里有一个灵兽，送给你防身吧，如果遇到敌人，可以冻住敌人一阵子。",
        {
            "type": "setValue",
            "name": "item:I1065",
            "operator": "+=",
            "value": "1"
        },
        "\t[奕开,hero]\b[hero]谢谢学长。",
        "\t[沈清妍,npc0]\b[this,2,5]学长，学长，还有我呢！",
        "\t[邓天博,N1128]\b[this,9,6]…………罢了，也给你一瓶灵兽进阶的药水吧。",
        "\t[沈清妍,npc0]\b[this,2,5]…………",
        "\t[沈清妍,npc0]\b[this,2,5]谢谢学长。",
        "\t[邓天博,N1128]\b[this,9,6]没事你可以走了。",
        "\t[沈清妍,npc0]\b[this,2,5]……好叭",
        {
            "type": "hide",
            "loc": [
                [
                    2,
                    5
                ]
            ],
            "remove": true
        },
        "\t[邓天博,N1128]\b[this,9,6]奕开，你没有惹什么人吗？",
        "\t[奕开,hero]\b[hero]我不记得惹了什么人呀",
        "\t[邓天博,N1128]\b[this,9,6]也罢，你自己当心一些。(该死的王磊，在自己掌管的区域不保护学弟学妹，我定要好好教训你一番)",
        "\t[邓天博,N1128]\b[this,9,6]对了，过几天就是学校举行的灵兽团战赛了，意在让我们学会团战协作，你找到好的伙伴没?",
        "\t[奕开,hero]\b[hero]我找到了，多谢学长关心，不过，那个团战赛在哪里开始呀",
        "\t[邓天博,N1128]\b[this,9,6]在学院\r[red]西边\r[]，你快去看看吧。我还有别的事，先走啦",
        {
            "type": "hide",
            "loc": [
                [
                    9,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "show",
            "loc": [
                [
                    0,
                    6
                ]
            ],
            "floorId": "MT3"
        },
        {
            "type": "setBlock",
            "number": "upFloor",
            "loc": [
                [
                    0,
                    6
                ]
            ],
            "floorId": "MT3"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,6": {
            "floorId": "MT41",
            "loc": [
                12,
                6
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [30520,31821,30383,30424,30221,30383,30220,30520,31821,30221,30447,30220,31821],
    [30447,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30383],
    [30220,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30447],
    [31821,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,31804],
    [30383,  0,  0,  0, 17, 17, 17, 17, 17,  0,  0,  0,31803],
    [30424,  0,135,  0, 17, 17, 17, 17, 17,  0,  0,  0,30520],
    [ 88,  0,  0,  0,  0,  0,  0,  0,  0,1129,  0,  0,30447],
    [30221,  0,  0,  0, 17, 17, 17, 17, 17,  0,  0,  0,31821],
    [30383,  0,  0,  0, 17, 17, 17, 17, 17,  0,  0,  0,30424],
    [30520,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30383],
    [31804,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30424],
    [30424,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,31821],
    [30447,31821,31803,31821,30520,30383,30520,30424,31803,30221,30447,30520,31804]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,151,151,151,151,151,  0,  0,  0,  0],
    [  0,  0,  0,  0,151,151,151,151,151,  0,  0,  0,  0],
    [  0,  0,  0,  0,151,151,151,151,151,  0,  0,  0,  0],
    [  0,  0,  0,  0,151,151,151,151,151,  0,  0,  0,  0],
    [  0,  0,  0,  0,151,151,151,151,151,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,10145,10145,10145,10145,10145,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        0,
        6
    ]
}