main.floors.MT56=
{
    "floorId": "MT56",
    "title": "主塔 56 层",
    "name": "56",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X101592",
    "bgm": "bxsgzz2.mp3",
    "firstArrive": [
        "\t[奕开,hero]\b[hero]那里有一个小宝库，可惜没有入口，难道……我要花钱购买一把破墙镐才行吗？"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 88,  0, 26,  0,794, 20, 21,378, 81,787, 87, 20],
    [ 20, 20, 20, 20, 20,  0, 20,447,552, 20,447,  0, 20],
    [ 20,448,389,  0, 20,447, 20,  0,794, 20, 20, 81, 20],
    [ 20,448,389,223, 81,  0, 20, 20, 83, 20,  0,246, 20],
    [ 20,448,389,  0, 20,787,  0,631,  0, 20,903,405, 20],
    [ 20, 20, 20, 20, 20,  0, 20, 20,277, 20,  0,448, 20],
    [ 20, 21,  0,277, 81,794, 81, 81,  0, 82,601, 21, 20],
    [ 20, 20, 82, 20, 20, 20, 20, 20, 81, 20, 20, 20, 20],
    [ 20,  0,325, 20,387,390,388, 20,326, 20, 21,383, 20],
    [ 20, 21,  0, 20,387,390,388, 20,  0,561,  0,385, 20],
    [ 20,447,447, 20,387,390,388, 20,447, 20, 21,384, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        1,
        1
    ]
}