main.floors.MT57=
{
    "floorId": "MT57",
    "title": "主塔 57 层",
    "name": "57",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X101592",
    "bgm": "bxsgzz2.mp3",
    "firstArrive": [
        "\t[奕开,hero]\b[hero]立天，樱姝，你们知道战斗时攻击提升40%是什么意思吗，它会直接给我提升属性吗？",
        "\t[立天,N331]你说的可是集齐6只火系灵兽的效果?比如你是1000攻击力，装备上6只火系灵兽后，依然是1000攻击力，但战斗时是按照1400攻击力计算，所以不用担心没有提升属性。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 87,  0,631,  0,449,  0,223, 82,787,  0, 88, 20],
    [ 20,787, 20, 20, 20, 20, 81, 20, 20,  0,  0,447, 20],
    [ 20, 21,447,  0, 20,448,601,397, 20, 20, 81, 20, 20],
    [ 20, 20, 20,1059, 20, 20, 20, 20, 20,  0,794,447, 20],
    [ 20,448, 20,277, 20, 21,  0,325,1060,  0,  4,1058,  4],
    [ 20,1082, 20,  0, 20,  0,447,  0, 20,1063,  4,441,  4],
    [ 20,794, 20,383, 81,787, 20, 84, 20, 24,  4,521,  4],
    [ 20,  0,561,  0, 20, 83, 20, 23, 20,399,  4,522,  4],
    [ 20,447,  0, 82, 20, 22, 20,395, 20,400,  4,523,  4],
    [ 20, 81, 20, 21, 20,391, 20,396, 20,401,  4,524,  4],
    [ 20,448, 20,450, 20,392, 20,397, 20,402,  4,484,  4],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20,  4,  4,  4]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        11,
        1
    ]
}