main.floors.MT65=
{
    "floorId": "MT65",
    "title": "主塔 65 层",
    "name": "65",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X101592",
    "bgm": "bxsgzz2.mp3",
    "firstArrive": [
        {
            "type": "unfollow"
        },
        {
            "type": "jumpHero",
            "loc": [
                6,
                10
            ],
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[斐安娜,N988]\b[this,6,9]哟，你就是入学测试第一名奕开吧，本姑娘是斐安娜郡主，你敢跟我抢团队赛第三名，仔细伤着我！",
        "\t[韩樱姝,N1036]\b[this,7,11]该打就打，难道你是郡主我们就不敢了?",
        "\t[斐安娜,N988]\b[this,6,9]哼，奕开，就你一个武功高强，训练师能力也高的，带着一个只会武功的，一个不会武功的俩拖油瓶，能赢吗？",
        "\t[斐安娜,N988]\b[this,6,9]喂，那个小子，你站后面低着头做什么？和本姑娘对战，有什么见不得人的?",
        "\t[立天,N331]\b[this,5,11]……",
        "\t[立天,N331]\b[this,5,11](抬起头)哼，斐安娜，你好啊",
        "\t[斐安娜,N988]\b[this,6,9]！！",
        "\t[斐安娜,N988]\b[this,6,9]你是……晶弥……",
        "\t[立天,N331]\b[this,5,11]嘘，我叫立天。",
        "\t[斐安娜,N988]\b[this,6,9]啊，好的，立天同学，我的身体不适，这个第三名就让给你们吧。",
        "\t[斐安娜的队友]郡主……",
        "\t[斐安娜,N988]\b[this,6,9]还不快走！",
        "\t[斐安娜的队友]是！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        "\t[奕开,hero]\b[hero]立天，她认出你了……",
        "\t[立天,N331]\b[this,5,11](点点头)我想她不会到处宣扬的。",
        "\t[韩樱姝,N1036]\b[this,7,11]你俩在打什么哑迷呀?还不快去挑战第二名。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    11
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    11
                ]
            ],
            "remove": true
        },
        {
            "type": "follow",
            "name": "hero.png"
        },
        {
            "type": "follow",
            "name": "hanyingshu.png"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,5": [
            "\t[沈清妍,npc0]\b[this,6,5]第二名让给你吧。",
            "\t[奕开,hero]\b[hero]啊哈？你的子雪清治愈术那么厉害，还有你两个队友的联合技能，居然没有拿到第一名?",
            "\t[沈清妍,npc0]\b[this,6,5]可不是我放水，第一名那三个不要脸的，三个二阶灵兽组成队，你们三个手里就你一个二阶灵兽，你女朋友的灵兽都不听话，我觉得你们赢不了",
            "\t[奕开,hero]\b[hero]哦哦，你直接把第二名让我们了，不考虑战斗一下?",
            "\t[沈清妍,npc0]\b[this,6,5]你的本事我也见识了，我们队伍里但凡有一个水系灵兽，我绝不会让出第二名。你那个火系灵兽，一言不合就自爆，我在密洞里面见识了，去找荆云试试吧，也让第一名知道你的厉害，不过你们应该也赢不了。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,3": [
            "\t[荆云,N997]\b[this,6,3]奕开，你们三个想挑战三个二阶灵兽的组合?",
            "\t[奕开,hero]\b[hero]正是！",
            "\t[荆云,N997]\b[this,6,3]那就来吧！",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,1": [
            {
                "type": "setValue",
                "name": "item:I494",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "setValue",
                "name": "item:I495",
                "operator": "+=",
                "value": "1"
            },
            "\t[奕开,hero]\b[hero]赢了！",
            "\t[韩樱姝,N1036]没想到我们也能赢，太好了！",
            "\t[立天,N331]奕开，那我去买点东西，今晚咱在宿舍吃大餐！",
            "\t[韩樱姝,N1036]我也要吃大餐！",
            "\t[奕开,hero]\b[hero]嘿嘿，好，晚上见！",
            {
                "type": "unfollow"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 87, 20, 20, 20, 20, 20, 20],
    [ 20,388, 22,223, 20,  0,570,  0, 20,223, 22,387, 20],
    [ 20, 20, 20, 81, 20,  0,  0,  0, 20, 81, 20, 20, 20],
    [ 20,399, 20,448, 20, 20,997, 20, 20,448, 20,454, 20],
    [ 20,400, 20,  0, 20,  0,  0,  0, 20,  0, 20,453, 20],
    [ 20,401, 20,601, 20,  0,133,  0, 20,601, 20,452, 20],
    [ 20,402, 20,  0, 20, 20, 83, 20, 20,  0, 20,451, 20],
    [ 20,1063, 20,  0, 20,447,  0,447, 20,  0, 20, 84, 20],
    [ 20,448,  0,561, 81,  0,  0,  0, 81,561,  0,448, 20],
    [ 20, 20, 81, 20, 20, 20,988, 20, 20, 20, 81, 20, 20],
    [ 20,  0,246,  0, 20,  0,  0,  0, 20,  0,246,  0, 20],
    [ 20,448,389,448, 20,334, 88,1055, 20,448,389,448, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        11
    ]
}