main.floors.MT79=
{
    "floorId": "MT79",
    "title": "主塔 79 层",
    "name": "79",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X10006",
    "bgm": "aybhs.mp3",
    "firstArrive": [
        "\t[奕开,hero]\b[hero]火焰遗迹的树，这一定是当年魔焰星君所栽的火焰神树，能够不断凝聚火焰的力量，是火系灵兽梦寐以求的宝物啊！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,7": [
            {
                "type": "jumpHero",
                "loc": [
                    6,
                    6
                ],
                "time": 500
            },
            {
                "type": "changePos",
                "direction": "up"
            },
            "\t[奕开,hero]\b[hero]拿到了，炽火果。",
            {
                "type": "setBlock",
                "number": "N1001",
                "loc": [
                    [
                        6,
                        9
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "N1001",
                "loc": [
                    [
                        5,
                        10
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "N1001",
                "loc": [
                    [
                        7,
                        10
                    ]
                ]
            },
            {
                "type": "changePos",
                "direction": "down"
            },
            "\t[奕开,hero]\b[hero]你们是什么人！",
            "\t[???,N1001]\b[this,6,9]哼，真是踏破铁鞋无觅处，得来全不费工夫啊",
            {
                "type": "jump",
                "from": [
                    6,
                    9
                ],
                "to": [
                    6,
                    7
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "animate",
                "name": "hand",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[奕开,hero]\b[hero]啊！",
            {
                "type": "jump",
                "from": [
                    6,
                    7
                ],
                "to": [
                    6,
                    9
                ],
                "time": 500,
                "keep": true
            },
            "\t[???,N1001]\b[this,6,9]小子，受死吧！",
            "\t[???,N1001]\b[this,5,10]不好了，有其他天晶帝国的人赶过来了。",
            "\t[???,N1001]\b[this,6,9]哼，小子，算你命好，不过等你们离开火焰遗迹，自有人收你的命！咱们走！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        10
                    ]
                ],
                "remove": true
            },
            "\t[奕开,hero]\b[hero]其他天晶帝国的人……该死，这些人不是天晶帝国的人！",
            {
                "type": "confirm",
                "text": "确认要跳过剧情吗?",
                "yes": [],
                "no": [
                    "\t[奕开,hero]\b[hero]可恶的魔法岛的混蛋，所有成熟的炽火果都被他们抢了，啊啊啊啊啊啊！",
                    "奕开的血溅到了没有成熟的炽火果上……",
                    "\t[奕开,hero]\b[hero]……",
                    "\t[奕开,hero]\b[hero]我的血……居然可以催熟魔焰星君种下的炽火果！",
                    "奕开用自己的血催熟了几枚炽火果，成功将自己所有的火系灵兽晋级五阶灵兽……",
                    "\t[奕开,hero]\b[hero]我终于成为五阶训练师啦！哈哈哈哈！该离开火焰遗迹了。",
                    {
                        "type": "setBlock",
                        "number": "N1001",
                        "loc": [
                            [
                                6,
                                5
                            ]
                        ],
                        "floorId": "MT68"
                    },
                    {
                        "type": "setBlock",
                        "number": "N1001",
                        "loc": [
                            [
                                6,
                                6
                            ]
                        ],
                        "floorId": "MT68"
                    },
                    {
                        "type": "setBlock",
                        "number": "N1001",
                        "loc": [
                            [
                                6,
                                7
                            ]
                        ],
                        "floorId": "MT68"
                    },
                    {
                        "type": "setBlock",
                        "number": "N1156",
                        "loc": [
                            [
                                7,
                                6
                            ]
                        ],
                        "floorId": "MT68"
                    },
                    {
                        "type": "changeFloor",
                        "floorId": "MT68",
                        "loc": [
                            10,
                            6
                        ],
                        "direction": "left"
                    },
                    "\t[奕开,hero]\b[hero]!!!",
                    "\t[???,N1001]\b[this,6,6]呵，小子，又见面了!",
                    "\t[奕开,hero]\b[hero]你们抢了我的炽火果，还敢在这里堵我!",
                    {
                        "type": "jumpHero",
                        "loc": [
                            8,
                            6
                        ],
                        "time": 500
                    },
                    "\t[???,N1154]\b[this,7,6]滚！",
                    {
                        "type": "animate",
                        "name": "hand",
                        "loc": [
                            7,
                            6
                        ]
                    },
                    {
                        "type": "jumpHero",
                        "loc": [
                            10,
                            6
                        ],
                        "time": 500
                    },
                    "\t[奕开,hero]\b[hero]啊！(这是什么人，竟然如此强大！该死，这附近这么多人和灵兽的尸体!)",
                    "\t[奕开,hero]\b[hero]你们魔法岛的王八蛋，竟敢杀死天晶帝国的人！",
                    "\t[???,N1001]\b[this,6,6]叫什么叫，魔法岛与天晶帝国早就说不死不休了，今天，一个天晶帝国的人也别想活着离开火焰遗迹!",
                    "\t[奕开,hero]\b[hero]笑话，这里这么多五阶训练师，我不信你们能杀死我们！",
                    "\t[???,N1001]\b[this,6,6]五阶训练师算什么东西，你知道眼前这位么？大名鼎鼎的灵兽榜上排名第九，暗夜幽蝠之主，黎峰!",
                    "\t[奕开,hero]\b[hero]！！！",
                    "\t[黎峰,N1154]\b[this,7,6]小子，你可以去死了!",
                    {
                        "type": "animate",
                        "name": "yongchang",
                        "loc": [
                            9,
                            6
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "wizard",
                        "loc": [
                            [
                                9,
                                6
                            ]
                        ],
                        "floorId": "MT68"
                    },
                    "\t[???,wizard]\b[this,9,6]黎峰，你拥有暗夜幽蝠，欺负这些低阶训练师，岂不是有失身份？",
                    "\t[黎峰,N1154]\b[this,7,6]呵，老头，这些年不见，你脾气见长啊，区区灵珠树，也敢在暗夜幽蝠面前叫嚣么？",
                    "\t[???,wizard]\b[this,9,6]黎峰，灵珠树再不济，也是排名十一，这里可是天晶帝国的领土，只要有强大的灵兽过来支援，我未必就怕你！",
                    "\t[黎峰,N1154]\b[this,7,6]是嘛？这里这么多训练师，我看你在我手里可以救下几个",
                    {
                        "type": "animate",
                        "name": "thunder",
                        "loc": [
                            9,
                            6
                        ]
                    },
                    {
                        "type": "animate",
                        "name": "thunder",
                        "loc": [
                            7,
                            6
                        ]
                    },
                    {
                        "type": "animate",
                        "name": "thunder",
                        "loc": [
                            9,
                            5
                        ]
                    },
                    {
                        "type": "animate",
                        "name": "thunder",
                        "loc": [
                            8,
                            7
                        ]
                    },
                    "暗夜幽蝠疯狂对人群发动着攻击，灵珠树为保护众人，处处受到掣肘，一时间处于下风。",
                    "\t[黎峰,N1154]\b[this,7,6]我看你还能坚持多久!",
                    "\t[???,wizard]\b[this,9,6]咳咳(喘气)",
                    "\t[奕开,hero]\b[hero]前辈!(该死啊，我为什么这么弱，什么也做不了，只能眼睁睁看着前辈不断被消耗，魔法岛的家伙，明显是想利用我们消耗前辈，然后连同灵珠树一起杀掉……)",
                    "\t[???,wizard]\b[this,9,6]我没事，我坚持不住了还可以跑，你们人太少了，如果有上百个五阶训练师，一定可以对他造成威胁，几十个五阶训练师太少了……(咳咳……)",
                    "\t[奕开,hero]\b[hero](灵兽榜上第九和第十一居然差距这么大，需要上百个五阶训练师来填补……今天当真要完了吗？)",
                    {
                        "type": "animate",
                        "name": "yongchang",
                        "loc": [
                            2,
                            6
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "N1126",
                        "loc": [
                            [
                                2,
                                6
                            ]
                        ],
                        "floorId": "MT68"
                    },
                    "\t[王磊,N1116]\b[this,2,6]着!",
                    {
                        "type": "animate",
                        "name": "thunder",
                        "loc": [
                            6,
                            6
                        ]
                    },
                    "\t[???,N1001]\b[this,6,6]啊！",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                5
                            ]
                        ],
                        "floorId": "MT68",
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                6
                            ]
                        ],
                        "floorId": "MT68",
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                7
                            ]
                        ],
                        "floorId": "MT68",
                        "remove": true
                    },
                    "\t[黎峰,N1154]\b[this,7,6]！！",
                    {
                        "type": "turnBlock",
                        "direction": "left",
                        "loc": [
                            [
                                7,
                                6
                            ]
                        ]
                    },
                    "\t[王磊,N1116]\b[this,2,6]还不快滚，难道你觉得暗夜幽蝠能在远古石皇和灵珠树联手下赢么？",
                    "\t[黎峰,N1154]\b[this,7,6]哼，后会有期！",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                7,
                                6
                            ]
                        ],
                        "floorId": "MT68",
                        "remove": true
                    },
                    "\t[???,wizard]\b[this,9,6]呵呵，幸好你来了，否则这里就惨了",
                    "\t[王磊,N1116]\b[this,2,6]保卫天晶帝国的百姓，是我等责任。",
                    "\t[???,wizard]\b[this,9,6]唉，我这把老骨头，先去休息了",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                9,
                                6
                            ]
                        ],
                        "floorId": "MT68",
                        "remove": true
                    },
                    {
                        "type": "moveHero",
                        "steps": [
                            "left:3"
                        ]
                    },
                    "\t[奕开,hero]\b[hero]王学长，你为何不灭了那个家伙啊",
                    "\t[王磊,N1116]\b[this,2,6]排名前十的灵兽个个都是顶尖高手，跟它拼下去，这里的人会死更多，而且我也留不住它。",
                    "\t[奕开,hero]\b[hero]哦，那我们回去吧",
                    "\t[王磊,N1116]\b[this,2,6]有一件不知道对你来说是不是值得高兴的事情。",
                    "\t[奕开,hero]\b[hero]值得高兴的事情?",
                    "\t[王磊,N1116]\b[this,2,6]是的，前两天，皇室来人了，把晶弥•立天和韩樱姝带走了。",
                    "\t[奕开,hero]\b[hero]啊?这有什么值得高兴的?",
                    "\t[王磊,N1116]\b[this,2,6]这两个人，一个不会武功，一个不会训练灵兽，还屡屡与你组队，压迫你，现在两个压迫都没了，难道不值得高兴吗？",
                    "\t[奕开,hero]\b[hero]你！",
                    "\t[奕开,hero]\b[hero]你不会说话别说！立天和樱姝是自愿去的吗？你们为什么不阻止那些人？",
                    "\t[王磊,N1116]\b[this,2,6]皇室来的人带了皇帝陛下的旨意，我们怎么阻拦，你是要让灵兽学院与皇室为敌吗？",
                    "\t[奕开,hero]\b[hero]不，你不懂，立天来这里是躲避别人害他的，樱姝也是乐意留在灵兽学院的，他们强行带走立天和樱姝，一定是想对他们不利！我得去救他！",
                    "\t[王磊,N1116]\b[this,2,6]你去救他们?",
                    "\t[奕开,hero]\b[hero]这不是你所希望的吗？如若不然，你等我会学院再告诉我也不迟啊。",
                    "\t[王磊,N1116]\b[this,2,6]行吧，你去救也的确合适，我们灵兽学院四大守护者虽然能够行，但我们所代表的是整个灵兽学院，我们出手就相当于灵兽学院和皇室公然为敌了。",
                    "\t[奕开,hero]\b[hero]我就不一样，我是晶弥•立天的侍卫，又与韩樱姝是青梅竹马，我去最合适不过了。",
                    "\t[王磊,N1116]\b[this,2,6]但愿你能成功吧！",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                2,
                                6
                            ]
                        ],
                        "floorId": "MT68",
                        "remove": true
                    }
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        8
                    ]
                ],
                "floorId": "MT4",
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "floorId": "MT17",
                "remove": true
            },
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        0
                    ]
                ],
                "floorId": "MT68"
            },
            {
                "type": "setBlock",
                "number": "upFloor",
                "loc": [
                    [
                        6,
                        0
                    ]
                ],
                "floorId": "MT68"
            },
            {
                "type": "changeFloor",
                "floorId": "MT68",
                "loc": [
                    6,
                    1
                ],
                "direction": "up"
            },
            "\t[奕开,hero]\b[hero]看来，这就是去皇宫的路了。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5],
    [  5,451,  5,451,386,840,  0, 21,  5, 21,451, 21,  5],
    [  5,450,  5,  5,  5,  5,  5,  0,  5,  5,840,  5,  5],
    [  5,685,  5,  0,840, 33, 33, 33, 81,450,  0, 21,  5],
    [  5,685, 81,924,  5,  5,  5,  5,  5,  0,839,  0,  5],
    [  5,685,  5, 21,  5,100072,100073,100074,  5,  5, 81,  5,  5],
    [  5, 21,  5,450,  5,  0,  0,  0,  5,  0,  0,450,  5],
    [  5,1034,  5, 21,  5,  0,257,  0,  5,  0,841,  0,  5],
    [  5,  5,  5,  5,  5,  5, 84,  5,  5,  5, 81,  5,  5],
    [  5,375,376,  0,  5,450,  0,381,  5,553,  0,553,  5],
    [  5,375,376,842, 81,  0,  0,  0,842,  0, 21,  0,  5],
    [  5,375,376,  0,  5,381,  0,450,  5,553,  0, 88,  5],
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,100041,100042,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,100048,100049,100050,100051,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,100056,100057,100058,100059,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,100064,100065,100066,100067,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,368,367,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,369,367,368,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,367,370,367,369,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,368,368,370,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "flyPoint": [
        11,
        11
    ]
}