main.floors.SL1=
{
    "floorId": "SL1",
    "title": "魔塔 1 层",
    "name": "魔塔1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "ybmmdfh.mp3",
    "firstArrive": [
        "\t[阿史,hero]\b[hero]好快的速度……",
        "\t[阿史,hero]\b[hero]世间竟然有如此强大的史莱姆……",
        "\t[绿史莱姆老祖,N1208]\b[this,6,6]比我强大的史莱姆多了去了",
        "\t[阿史,hero]\b[hero]不知怎么称呼您呢？",
        "\t[绿史莱姆老祖,N1208]\b[this,6,6]你可以叫我绿史莱姆老祖。",
        "\t[阿史,hero]\b[hero]老祖，您为何不杀了魔王，为史莱姆族报仇?",
        "\t[绿史莱姆老祖,N1208]\b[this,6,6]我连魔龙都打不过，怎么可能打得过魔王……魔王出现的第一时间，我便赶来了，没想到还是晚了一步……",
        "\t[阿史,hero]\b[hero]老祖都不是魔王的对手，史莱姆一族，该如何是好……",
        "\t[绿史莱姆老祖,N1208]\b[this,6,6]史莱姆一族比你想象中的强大。在远古时期，史莱姆一族曾追随神明击败\r[red]域外邪魔\r[]，因此被\r[red]域外邪魔\r[]诅咒，永远只能成为最下等的怪物，被魔王奴役……",
        "\t[阿史,hero]\b[hero]如今，我们史莱姆一族已经被魔王抛弃，外有勇者为敌，该如何是好。",
        "\t[绿史莱姆老祖,N1208]\b[this,6,6]你可以先去5层找黄金史莱姆，它也许有让你变强的方法。哦，你的天赋惊人，我把我的能力送给你吧！",
        {
            "type": "setValue",
            "name": "item:book",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "item:fly",
            "operator": "+=",
            "value": "1"
        },
        "\t[阿史,hero]\b[hero]这是……",
        "\t[绿史莱姆老祖,N1208]\b[this,6,6]这是我的“透视之眼”和“空间传送”。你去找其他史莱姆，集齐它们所有的能力，也许可以和魔王一战。",
        {
            "type": "openShop",
            "id": "shop1",
            "open": true
        },
        "\t[绿史莱姆老祖,N1208]\b[this,6,6]如果可以，你集齐了金币就来找我提升能力吧！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": [
            {
                "type": "if",
                "condition": "(item:superPotion===1)",
                "true": [
                    "\t[阿史,hero]\b[hero]老祖，您看看这是什么？",
                    {
                        "type": "setValue",
                        "name": "item:superPotion",
                        "operator": "-=",
                        "value": "1"
                    },
                    "\t[绿史莱姆老祖,N1208]\b[this]啊，这是……",
                    "\t[绿史莱姆老祖,N1208]\b[this]这好像是用一颗勇敢正义的真心所制作的圣水……",
                    "\t[阿史,hero]\b[hero]啊？",
                    "\t[绿史莱姆老祖,N1208]\b[this]是的，只有勇敢正义的真心，才能制作这种可以使人生命值翻倍的至宝。",
                    "\t[绿史莱姆老祖,N1208]\b[this]曾经，有一个勇敢的骑士队长率领一支骑士队进入魔塔，想要将邪恶的魔塔推翻，但是后来，骑士队长突然臣服于魔王，成为了魔王最忠实的狗。",
                    "\t[绿史莱姆老祖,N1208]\b[this]让我试试！",
                    {
                        "type": "animate",
                        "name": "light2",
                        "loc": [
                            6,
                            6
                        ]
                    },
                    {
                        "type": "animate",
                        "name": "light3",
                        "loc": [
                            6,
                            6
                        ]
                    },
                    {
                        "type": "setValue",
                        "name": "item:I504",
                        "operator": "+=",
                        "value": "1"
                    },
                    "\t[阿史,hero]\b[hero]成功了！",
                    "\t[绿史莱姆老祖,N1208]\b[this]加油吧，小史莱姆，你的路是充满荆棘的，希望你可以斩断路上的荆棘，获得成功。"
                ],
                "false": []
            },
            {
                "type": "openShop",
                "id": "shop1",
                "open": true
            }
        ],
        "6,2": [
            "\t[阿绿,N1186]\b[this]阿史，加油啊！"
        ],
        "9,6": [
            "\t[小青,N1186]\b[this]红色的宝石提升攻击力\n蓝色的宝石提升防御力\n绿色的宝石提升护盾值\n黄色的宝石提升全属性\n各色的血瓶提升生命值",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "3,6": [
            "\t[小史,N1186]\b[this]黄色的钥匙开启黄色的门\n蓝色的钥匙开启蓝色的门\n红色的钥匙开启红色的门\n绿色的钥匙开启绿色的门",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "5,11": [
            "\t[大宝,N1186]\b[this]阿史，加油！",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "9,11": [
            "\t[懵懂的史莱姆,N1186]\b[this]咕咕……",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "10,10": [
            "\t[大胖,N1186]\b[this]阿史，史莱姆家族不是表面上的实力。相信我，遇到史莱姆就前去问候一声，史莱姆不欺骗史莱姆。",
            {
                "type": "turnBlock",
                "direction": "down"
            }
        ],
        "2,10": [
            "\t[菜菜,N1186]\b[this]加油，阿史。"
        ],
        "6,9": [
            "欢迎来到没有史莱姆低人一等，我是作者，希望你能喜欢我的塔。\n加迷迭香群901012439\n加童心群1037998980\n加析境群790516003\n本塔结局相关：\n1.将三件宝物分别赠予三族，触发“\r[red]走向共和\r[]”结局\n2.将三件宝物交给勇者，触发“毁灭魔塔”结局\n3.将三件宝物交给魔王，触发“垂首臣服”结局\n4.将三件宝物留下来，触发“永不磨灭的番号”结局\n走向共和是最难的结局，三件宝物需要在击杀每区boss前后把宝物交出才能触发。"
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 87,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  1],
    [  1,  0,  1,  0,  0,  1,1186,  1,  0,  0,  1,  0,  1],
    [  1,  0,  0,  1,  0,  0,  0,  0,  0,  1,  0,  0,  1],
    [  1,  0,  0,  1,  1,  1,  1,  1,  1,  1,  0,  0,  1],
    [  1,  0,  0,  0,  1,  0,  0,  0,  1,  0,  0,  0,  1],
    [  1,  0,  1,1186,  1,  0,1208,  0,  1,1186,  1,  0,  1],
    [  1,  0,  0,  1,  1,  1,  0,  1,  1,  1,  0,  0,  1],
    [  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1],
    [  1,  0,  1,  0,  1,  0,129,  0,  1,  0,  1,  0,  1],
    [  1,  0,1186,  1,  0,  0,  1,  0,  0,  1,1186,  0,  1],
    [  1,  0,  1,  0,  0,1186,  1,  0,  0,1186,  1,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}