main.floors.SL11=
{
    "floorId": "SL11",
    "title": "魔塔 11 层",
    "name": "魔塔11",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "Aeterna.mp3",
    "firstArrive": [
        "\t[？？？,N1209]\b[this,8,8]阿史……",
        "\t[阿史,hero]\b[hero]???",
        "\t[阿史,hero]\b[hero]谁?",
        "\t[红史莱姆老祖,N1209]\b[this,8,8]是我，红史莱姆老祖。",
        {
            "type": "changePos",
            "direction": "left"
        },
        "\t[阿史,hero]\b[hero]！",
        "\t[阿史,hero]\b[hero]红史莱姆老祖！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,8": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    {
                        "type": "openShop",
                        "id": "shop2",
                        "open": true
                    }
                ],
                "false": [
                    "\t[红史莱姆老祖,N1209]\b[this]阿史。",
                    "\t[阿史,hero]\b[hero]呜呜呜呜，老祖！黄金史莱姆前辈牺牲了！",
                    "\t[红史莱姆老祖,N1209]\b[this]不要伤心，孩子。",
                    "\t[红史莱姆老祖,N1209]\b[this]你看，天黑了，孩子。生活中的一件事或一个人可以击垮你的意志，夺走你的一切，但是，你要记住，太阳，总是会照常升起的，他会带来光明，会带来一切希望，不过不要完全寄托于太阳照常升起这件事，美好的生活，美好的未来总是要靠我们自己去争取的。",
                    "\t[红史莱姆老祖,N1209]\b[this]史莱姆想要觉醒，突破魔王的奴役和勇者的杀戮，是需要用鲜血来铺路的。只要我们勇敢地向前，他们的牺牲就不算白费。",
                    "\t[阿史,hero]\b[hero]是，老祖。您这么大的身躯，不怕被魔王发现吗？",
                    "\t[红史莱姆老祖,N1209]\b[this]这一点你放心，像我这么大的史莱姆，总有一些技巧在身的，在勇者们看来，我们就像是那普通的商店，在魔王看来，我们就是一个大大的墙体。只有咱们史莱姆才能看明白我们的真身。",
                    "\t[阿史,hero]\b[hero]哦哦好的",
                    "\t[红史莱姆老祖,N1209]\b[this]绿史莱姆老祖的力量不如我强大，你如果需要，也可以在我这里提升力量。",
                    "\t[阿史,hero]\b[hero]谢谢老祖。",
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "3,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,367,  0,  1,1233,  0,443,  0,1233,  0, 28,  1],
    [  1,445,  1,205, 81,443,  1,  1,206,  1,  1,  0,  1],
    [  1,  0, 21,  0,  1,  0,  1, 21, 22, 21,  1,205,  1],
    [  1,  1,1242,  1,  1,206,  1,  1, 81,  1,  1, 81,  1],
    [  1,443,  0,  1,443,  0, 21,  0,205,  0,369,  0,  1],
    [  1,  0, 28, 81,  0,1233,  1,  1,  1,  1,  1,1233,  1],
    [  1,369,  1,  1,  1, 81,  1,  0,  0,  0,  1,  0,  1],
    [  1,206,  1, 27,  0,369,  1,  0,1209,  0,  1,443,  1],
    [  1,  0,205,  0, 21,  1,  1,  1,  0,  1,  1,  0,  1],
    [  1,1239,  1,  1,  1,  1, 29,  0, 27,  1,  0,205,  1],
    [  1,  0,443, 87, 81,205,  0,443,1238, 81,  0, 88,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        11,
        11
    ]
}