main.floors.SL15=
{
    "floorId": "SL15",
    "title": "魔塔 15 层",
    "name": "魔塔15",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "Aeterna.mp3",
    "firstArrive": [
        "和矿工史莱姆对话后开启特殊门"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,2": [
            "\t[矿工史莱姆,N1214]\b[this,10,2]小家伙，怎么一副垂头丧气的样子？",
            "\t[阿史,hero]\b[hero]大叔，你能想象一个个伙伴倒在自己面前，自己却无能为力的痛苦吗？",
            "\t[矿工史莱姆,N1214]\b[this,10,2]唉，这么小就如此苦大仇深的，也是可怜了，你本该在这个年纪好好享受童年的，可惜了，史莱姆一族反叛了魔王……",
            "\t[阿史,hero]\b[hero]大叔，史莱姆一族现在不反抗魔王，将来依然要跪在魔王的脚下乞讨生活！你这话说的，好像史莱姆一族做错了一样。",
            "\t[矿工史莱姆,N1214]\b[this,10,2]本来就错了嘛，你看，史莱姆如果不反抗，那起码不会被灭族……",
            "\t[阿史,hero]\b[hero]你住口！我不想和你说了。",
            "\t[矿工史莱姆,N1214]\b[this,10,2]唉……如果史莱姆一族更强一点就好了……",
            "\t[阿史,hero]\b[hero]哼！",
            "\t[矿工史莱姆,N1214]\b[this,10,2]如果可以，你……去找一下十字架吧！",
            "\t[阿史,hero]\b[hero]什么？",
            "\t[矿工史莱姆,N1214]\b[this,10,2]十字架是魔王用来压制吸血鬼一族的，如果你把它交给吸血鬼的族人……也许，会获得吸血鬼一族的友谊……",
            "\t[阿史,hero]\b[hero]……",
            "\t[阿史,hero]\b[hero]知道了。",
            {
                "type": "hide",
                "loc": [
                    [
                        10,
                        2
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        5
                    ]
                ],
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,7": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,207,  0, 81,  0, 29,  0,1234, 21,  0, 27,  1],
    [  1,368,  1,445,  1,  1,  1,1241,  1,  0,1214,  0,  1],
    [  1,  0, 81,  0,1241,  0,  1,  0,  1, 81,  1,  0,  1],
    [  1,1241,  1,  1,  1, 21,  1,443,  1,1239,  1,206,  1],
    [  1, 85,1234,  0,  1,  0,206,  0, 81,  0,445,  0,  1],
    [  1, 21,  1,369,  1,443,  1,  1,  1,  1,  1, 21,  1],
    [  1, 87,  1,  0, 81,  0,207,445,  0,368,1239,  0,  1],
    [  1,  1,  1,  1,  1,1239,  1,  0, 22,  0,  1, 81,  1],
    [  1,  0,206,  0, 81,  0,  1,1234,  1, 81,  1,443,  1],
    [  1,  0, 81,367,  1,  1,  1, 21,  1,207,  1, 29,  1],
    [  1, 88,  1,  0, 21,1241, 29,  0,445,  0, 81,443,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        1,
        11
    ]
}