main.floors.SL21=
{
    "floorId": "SL21",
    "title": "魔塔 21 层",
    "name": "魔塔21",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "huiyi.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,5": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    {
                        "type": "openShop",
                        "id": "shop3",
                        "open": true
                    },
                    {
                        "type": "comment",
                        "text": "下一条指令可视情况使用或不使用"
                    }
                ],
                "false": [
                    "\t[青史莱姆老祖,N1210]\b[this]阿史，你来了",
                    "\t[阿史,hero]\b[hero]老祖……",
                    "\t[青史莱姆老祖,N1210]\b[this]阿史，为何如此难过？",
                    "\t[阿史,hero]\b[hero]老祖，我不知道，我的心好痛苦。",
                    "\t[青史莱姆老祖,N1210]\b[this]因何痛苦呢？",
                    "\t[阿史,hero]\b[hero]魔王压榨着魔塔的怪物们，让怪物们付出一切，它高高在上，它拥有魔塔至高无上的权力，随意决定着魔塔怪物们的生死。",
                    "\t[阿史,hero]\b[hero]史莱姆族反抗，得到的只是一场铺天盖地的屠杀。骷髅族的反抗，遭到了魔王无情的镇压。吸血族的反抗，遭遇的是一场血洗。如果……大家没有觉醒，是不是就可以免遭此劫难……",
                    "\t[阿史,hero]\b[hero]您说，我让魔塔的怪物们觉醒，究竟是不是对的？",
                    "\t[青史莱姆老祖,N1210]\b[this]你有光明璀璨之明日，自然是有人将身赴死以换取，虽知死，但仍愿赴死。",
                    "\t[青史莱姆老祖,N1210]\b[this]这是黑暗的时代，是太阳尚未升起的时候，可是尽管黑暗，也有月亮和星星，照亮夜空。",
                    "\t[青史莱姆老祖,N1210]\b[this]这注定是一条充满鲜血和牺牲的不归路，魔塔底层怪物们一直被压榨，被杀害，永生永世，不休不眠。你解放了它们，使它们获得了真正的自我。请不要放弃生命里所有的希望，斩断所有荆棘，无畏的向前开路，就算前方永远只存微光，只有走下去才对得起一路的颠沛流离！",
                    "\t[阿史,hero]\b[hero]谢谢老祖！",
                    "\t[青史莱姆老祖,N1210]\b[this]来吧，你的力量在红史莱姆老祖和绿史莱姆老祖那里获得了提升，我可以继续帮助你！",
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "1,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,1255, 81,  0,444,  0, 21,  0, 81,1252,  0,372,  1],
    [  1, 21,  1,  1, 81,  1,  1,1246,  1,  0,372,  0,  1],
    [  1, 21,  1,367,  0,  1,367,  0,  1,  1,  1,  1,  1],
    [  1,444,  1,  0,369,1248,  0,368,  1,  0,  0,  0,  1],
    [  1,  1,  1,1246,  1,  1, 82,  1,  1,  0,1210,  0,  1],
    [  1, 88,  1,  0,  0, 21, 21, 21,  1,  1,  0,  1,  1],
    [  1,  0,  1,1246,  1,  1, 81,  1,  1,367,  0, 22,  1],
    [  1,445,  0,  0,  1,  0,445,  0,1248,  0,444,  0,  1],
    [  1,  1,1246,  1,  1,369,  1,1247,  1,  1, 81,  1,  1],
    [  1,  0,368,  0,1249,  0, 81,  0, 82,  0,1249,  0,  1],
    [  1,443,  0,443,  1,369,  1,368,  1,368,  0, 87,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        1,
        6
    ]
}