main.floors.SL25=
{
    "floorId": "SL25",
    "title": "魔塔 25 层",
    "name": "魔塔25",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "huiyi.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,2": [
            "\t[矿工史莱姆,N1214]\b[this]小弟，我们又见面啦！",
            "\t[阿史,hero]\b[hero]又是你，大叔。",
            "\t[矿工史莱姆,N1214]\b[this]小弟，骑士队长可是一个怕死鬼，被魔王吓唬一番，便下令骑士们对区域内的史莱姆进行了大肆的屠杀。",
            "\t[阿史,hero]\b[hero]可恶！那大叔，您想说些什么？",
            "\t[矿工史莱姆,N1214]\b[this]你害怕了吗？小弟，骑士队长可是魔王的忠实部下，他一定不会帮你的。",
            "\t[阿史,hero]\b[hero]如果害怕的话，我就不会劝说骷髅队长和吸血鬼了。骷髅队长对魔王忠心耿耿，已经被我打败。吸血鬼带领着吸血族举起了反抗魔王的旗帜，我相信，我可以让骑士队也反抗魔王！",
            "\t[矿工史莱姆,N1214]\b[this]希望你可以成功。对了，骑士队长曾经是一个英勇正义的战士，在进入魔塔之后，失去了自己的本心，如果你能找到他的本心，也许他会改变心意。",
            "\t[矿工史莱姆,N1214]\b[this]如果找到了骑士队长的本心，可以找\r[red]绿史莱姆老祖\r[]，让它将骑士队长的本心变回来。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "4,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 87,  1,443,  0,1252,  0,371,  0,1250,  0,443,  1],
    [  1,1214,  1,  0,  1,  1,  1,  1,  1,  1,  1,  0,  1],
    [  1,373,  1, 21,  1,371,  0,445, 81,369,  1,1249,  1],
    [  1,  0,  1,  0,  1,  0,1251,  0,  1,443,  1,  0,  1],
    [  1,445,  1,367,  1,  1, 81,  1,  1, 81,  1,  0,  1],
    [  1,  0,1249,  0,1259,  1,  0,  1,  0,445,  0, 21,  1],
    [  1, 82,  1,  1,  0, 81,1250,  1, 81,  1,1259,  1,  1],
    [  1,  0,1250,  0, 21,  1,  0,  0,  0,444,  0,368,  1],
    [  1,443,  1,  1,  1,  1,  1, 81,  1,  1, 81,  1,  1],
    [  1,  0,  1,  0,  0,  1,  0,1251,  1,  0,1250,  0,  1],
    [  1,  0,1248,  0, 88,  1,367,  0,  1,443,  0,372,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        4,
        11
    ]
}