main.floors.SL31=
{
    "floorId": "SL31",
    "title": "魔塔 31 层",
    "name": "魔塔31",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "BlackBlade.mp3",
    "firstArrive": [
        "\t[阿史,hero]\b[hero]啊，这么多史莱姆……",
        "\t[阿史,hero]\b[hero]怎么会这么多史莱姆……啊，我的族人！",
        {
            "type": "jumpHero",
            "loc": [
                6,
                2
            ],
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "down:2"
            ]
        },
        "\t[阿史,hero]\b[hero]我的族人啊！",
        "\t[青史莱姆,N1198]\b[this,6,5]是阿史！大家快来呀，我们的英雄阿史回来了！",
        "\t[红史莱姆,N1190]\b[this,7,6]阿史！",
        "\t[红史莱姆,N1190]\b[this,5,6]阿史！",
        "\t[阿史,hero]\b[hero]呜呜呜呜，我的族人啊！",
        "\t[青史莱姆,N1198]\b[this,6,5]阿史，你哭什么？",
        "\t[阿史,hero]\b[hero]没想到，我还能在这一区看到有大量的史莱姆，真是很开心！",
        "\t[阿史,hero]\b[hero]不过，我不是什么英雄啦，大家谬赞了！",
        "\t[青史莱姆,N1198]\b[this,6,5]阿史，你一个史莱姆，在各处游走，并联合了骷髅族、吸血族和骑士队帮助史莱姆族，你才是真正的英雄啊！",
        "\t[红史莱姆,N1190]\b[this,5,6]就是，哪像我们，我们只能窝在犄角旮旯处求生，你对史莱姆族的贡献，无人能及！这朵鲜花送给你！",
        "\t[红史莱姆,N1190]\b[this,6,6]阿史，你真是我的偶像！",
        "\t[阿史,hero]\b[hero]嘿嘿嘿……",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "remove": true
        },
        {
            "type": "changeFloor",
            "floorId": "SL32",
            "loc": [
                4,
                8
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[阿史,hero]\b[hero]???",
        "\t[阿史,hero]\b[hero]怎么回事？我刚刚还被很多史莱姆簇拥着，怎么就突然晕了过去?醒来就在牢房了？",
        "\t[冰史莱姆,E896]\b[this,6,2]还是大王英明啊，知道骷髅军、吸血族、骑士队都抓不住这个叛逃的史莱姆，就让我们史莱姆来对付它，它没有一点防备就被抓啦！",
        "\t[冰史莱姆,E896]\b[this,8,2]就是，都是这种蠢货背叛大王，才引起史莱姆一族被屠杀，好在我们及时向大王投诚，这才保留一丝种子。",
        "\t[阿史,hero]\b[hero]！",
        "\t[阿史,hero]\b[hero]叛徒！这群叛徒！没想到，这群史莱姆竟然投诚了……",
        {
            "type": "setBlock",
            "number": "N1214",
            "loc": [
                [
                    1,
                    2
                ]
            ],
            "floorId": "SL32"
        },
        {
            "type": "move",
            "loc": [
                1,
                2
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down:5"
            ]
        },
        {
            "type": "playSound",
            "name": "破墙镐"
        },
        {
            "type": "hide",
            "loc": [
                [
                    2,
                    7
                ]
            ],
            "floorId": "SL32",
            "remove": true
        },
        {
            "type": "jumpHero",
            "loc": [
                3,
                7
            ],
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "left"
        },
        "\t[阿史,hero]\b[hero]大叔?",
        "\t[矿工史莱姆,N1214]\b[this,1,7]叫你那么高调，吃到苦头了吧?你以为最大的敌人是魔王，是骷髅军吸血族和骑士队吗？不，最大的敌人还是内部的奸细——史莱姆奸！",
        "\t[阿史,hero]\b[hero]没想到，我一路提防这提防那，唯独对自己的族人没有提防，结果被自己的族人关起来了。",
        "\t[矿工史莱姆,N1214]\b[this,1,7]好自为之吧，我走了。",
        {
            "type": "hide",
            "loc": [
                [
                    1,
                    7
                ]
            ],
            "floorId": "SL32",
            "remove": true
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,2": [
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    {
                        "type": "openShop",
                        "id": "shop4",
                        "open": true
                    }
                ],
                "false": [
                    "\t[史莱姆王老祖,N1202]\b[this]阿史。",
                    "\t[阿史,hero]\b[hero]后辈阿史，拜见老祖。",
                    "\t[史莱姆王老祖,N1202]\b[this]阿史，你看起来对我很是警惕。",
                    "\t[阿史,hero]\b[hero]老祖误会了，晚辈没有。",
                    "\t[史莱姆王老祖,N1202]\b[this]你不用说我也知道发生了什么事情。史莱姆一族的叛徒太多，对史莱姆一族的英雄动起了手，这真是史莱姆族最大的耻辱！",
                    "\t[阿史,hero]\b[hero]老祖既然这么说，为何不替我，替史莱姆一族死去的同胞做主，出手对付这些该死的叛徒?",
                    "\t[史莱姆王老祖,N1202]\b[this]阿史，对不起，我无法做到也不能，对付这些史莱姆一族的败类了。你要知道，史莱姆一族的觉醒，魔王大肆杀戮，这些投降的史莱姆已经是存活下来少有的史莱姆了。",
                    "\t[阿史,hero]\b[hero]难道，老祖，您要让它们如叭儿狗一般，活在魔王的统治下吗？",
                    "\t[史莱姆王老祖,N1202]\b[this]阿史，他们的胆子太小，无法直面魔王。也许，留着他们，也是为史莱姆一族留下最后的种子啊。史莱姆一族，再也经不住一场大战了……",
                    "\t[阿史,hero]\b[hero]这样的种族，再过千年百年，永远也只是魔王的奴隶！我不止是燃烧着我一个人的血，我更是将无数史莱姆先辈、无数骷髅军战士和无数吸血族、骑士队的战士的意志在传承！",
                    "\t[史莱姆王老祖,N1202]\b[this]……",
                    "\t[史莱姆王老祖,N1202]\b[this]阿史，加油！你说的对，我希望你可以将史莱姆一族愚昧的投降者都唤醒，一个民族的觉醒，不是在跪着的情况下觉醒的，一个民族的尊严，更不是当叭儿狗舔出来的。真理只在我们的拼搏中得出",
                    "\t[阿史,hero]\b[hero]我会唤醒它们的。骷髅军、吸血族和骑士队我都唤醒了，更何况是我的族人呢！我一定要唤醒它们！",
                    "\t[史莱姆王老祖,N1202]\b[this]阿史，你有需要就可以来找我，我会尽力帮助你的！",
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    },
                    {
                        "type": "openShop",
                        "id": "shop4",
                        "open": true
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1,  0,372,  0,  1,  0, 88,  0,  1,  0,  0,  0,  1],
    [  1,1261,  1,373,  1,446,  0,446,  1,  0,1211,  0,  1],
    [  1,  0, 81,  0,  1,  1,  0,  1,  1,  1,  0,  1,  1],
    [  1,445,  1,1263,  1,  1,  0,  1,  0, 81,  0,445,  1],
    [  1,  0,  1,  0,  1,  0,1198,  0,  0,  1,  0,  0,  1],
    [  1,  0, 81,  0,  0,1190,1190,1190,  0,  1,  1,1262,  1],
    [  1,445,  1,  1,  1,  1, 81,  1,  1,  1, 21,  0,  1],
    [  1,  0,373,  0,1263,  0,445,  0,445,1261,  0,371,  1],
    [  1,1262,  1, 81,  1, 81,  1,  1,  0,  1,446,  0,  1],
    [  1,  0,367,  0,  1, 21,  0,  1,1263,  1,  1, 81,  1],
    [  1, 87,  0,444,1261,  0, 21,  1,  0,376, 21,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        6,
        1
    ]
}