main.floors.SL5=
{
    "floorId": "SL5",
    "title": "魔塔 5 层",
    "name": "魔塔5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "ybmmdfh.mp3",
    "firstArrive": [
        "与黄金史莱姆对话打开特殊门"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,11": [
            "\t[阿史,hero]\b[hero]黄金前辈！",
            "\t[黄金史莱姆,N1216]\b[this,4,11]你就是阿史？听绿史莱姆老祖说了，你是一个很了不起的小子呢！",
            "\t[阿史,hero]\b[hero]多谢前辈夸赞。现在魔王让骷髅族围剿史莱姆族，很多史莱姆族的兄弟姐妹们都牺牲了，呜呜呜呜……",
            "\t[黄金史莱姆,N1216]\b[this,4,11]在这邪恶之地，恐惧是你们最大的敌人。勇气将让你们的灵魂比千颗太阳还要明亮。敌人会在你们面前溃不成军，正义的光芒将彻底摧毁他们。",
            "\t[黄金史莱姆,N1216]\b[this,4,11]唯有我们觉醒之际，天才会破晓。破晓的，不止是黎明。太阳只不过是一颗晨星，我们的觉醒将更加耀眼。",
            "\t[黄金史莱姆,N1216]\b[this,4,11]不要害怕，勇气将使你战胜一切！你的天赋极强，我可以告诉你一件我们史莱姆族的宝物——幸运金币，你拿到手一定可以变得更强。",
            "\t[阿史,hero]\b[hero]幸运金币？那不是魔王为了毁灭神圣剑吸引勇者的东西吗？",
            "\t[黄金史莱姆,N1216]\b[this,4,11]你说，魔塔死去最多的怪物是什么？",
            "\t[阿史,hero]\b[hero]史莱姆。",
            "\t[黄金史莱姆,N1216]\b[this,4,11]没错，魔塔死去最多的怪物就是史莱姆。所以它们所汇聚的血液便凝成了幸运金币，降落在魔塔的最底层，我帮你取了。",
            "\t[阿史,hero]\b[hero]在哪里呢？",
            "\t[黄金史莱姆,N1216]\b[this,4,11]额，我前些天到楼上的时候掉在某个地方了",
            "\t[阿史,hero]\b[hero]……黄金前辈，你还真靠谱呀……",
            "\t[阿史,hero]\b[hero]黄金前辈，你把这个拿了过来，魔王会不会……",
            "\t[黄金史莱姆,N1216]\b[this,4,11]你还担心魔王会不会杀我？呵呵，它都灭我族了，我会怕它？你尽管拿去用，不管是用它提升自己，还是把它交给骷髅族的族老，都是可以的。",
            "\t[阿史,hero]\b[hero]骷髅族的族老？",
            "\t[黄金史莱姆,N1216]\b[this,4,11]对，魔塔除了史莱姆，便是骷髅族死的最多了，你如果找到了骷髅族的族老，便告知它其中厉害，让它帮助史莱姆一族，也许会好一些。",
            "\t[阿史,hero]\b[hero]可我不知道谁是骷髅族的族老呀。",
            "\t[黄金史莱姆,N1216]\b[this,4,11]慢慢找，一定可以找到的。",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "6,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 88,  0, 81,1221, 81,1225,  0,  1, 30,  0,442,  1],
    [  1,  0,442,  1,  0,  1,  0, 21,209,  0,445,211,  1],
    [  1,1225,  1,  1, 21,  1,  1,  1,  1,  1,  1, 81,  1],
    [  1,  0,369,1225,  0,209,  0, 28,  0,442,  0,  0,  1],
    [  1,443,  0,  1, 81,  1,  1,  1,1221,  1,  1,  1,  1],
    [  1,  0, 21,  1,209,  1, 87,  1,  0,  1,442, 29,  1],
    [  1, 81,  1,  1,  0,  1, 85,  1,369,  1,  1, 81,  1],
    [  1, 29,442, 81,  0, 21,  0,210,  0,  0,1225,  0,  1],
    [  1,210,  1,  1,1222,  1,  1,  1,  1,  1,  1, 81,  1],
    [  1, 21,209, 82,367, 81,209,  0,  1, 28,  0,1221,  1],
    [  1, 27,442,  1,1216,  1,  0,443, 81,  0, 21,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        1,
        1
    ]
}