main.floors.MT106=
{
    "floorId": "MT106",
    "title": "未知地带",
    "name": "未知地带",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "holy3.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "defaultGround": "ground",
    "bgm": "holy1.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "holy1.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[???,N681]\b[this,6,4]........",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                4
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,E517]淋雨对身体没好处的，大人。",
        {
            "type": "show",
            "loc": [
                [
                    7,
                    11
                ]
            ],
            "floorId": "MT106",
            "time": 100
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "move",
            "loc": [
                7,
                11
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        "\t[???,N681]\b[this,6,4]回来了？",
        "\t[梦,E517]\b[this,7,6]是，大人你交代给我的任务已经完成了。",
        "\t[???,N681]\b[this,6,4]嗯......圣羽洛斯那边有什么特殊情况吗？",
        "\t[梦,E517]\b[this,7,6]还是老样子，跟之前没有什么区别。",
        "\t[梦,E517]\b[this,7,6]大人，属下觉得圣羽洛斯这个人狼子野心，应该早点剔除掉这个威胁！",
        "\t[???,N681]\b[this,6,4].......暂时没有必要，圣羽洛斯这个家伙的确经常阳奉阴违。",
        "\t[???,N681]\b[this,6,4]但是！如果要完成[]计划的话，圣羽洛斯可以说是在这次计划中不可缺少的一部分。",
        "\t[???,N681]\b[this,6,4]正是因为这个原因，我现在对圣羽洛斯的态度是睁一只眼闭一只眼。",
        "\t[???,N681]\b[this,6,4]等到[]计划完成后，他也就没有什么价值了！",
        "\t[???,N681]\b[this,6,4]至于其他人，只要有足够的利益，就不用担心会出现反水行为。",
        "\t[梦,E517]\b[this,7,6]我做一个假设，[]计划要求人类勇者的实力达到三圣阁主的实力，那可不可以这样想：",
        "\t[梦,E517]\b[this,7,6]我们是否可以尝试以圈养和服药物的方式来培养这种勇者呢？",
        "\t[???,N681]\b[this,6,4]哈哈哈！想法很好。",
        "\t[???,N681]\b[this,6,4]但是如果这样做的话他们也就不配称为勇者了！而是家畜！！",
        "\t[???,N681]\b[this,6,4]没有勇者气质的勇者，是不可能完成[]计划的！",
        "\t[???,N681]\b[this,6,4]所以，你明白了吗？",
        "\t[梦,E517]\b[this,7,6]我明白了，但是......",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[梦,E517]\b[this,7,6].......[]计划，真的能成功吗？为了这个计划我们付出了太多太多了。",
        "\t[???,N681]\b[this,6,4]\r[red]你说什么？！！！",
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "Eternity1.mp3",
            "keep": true
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 200,
            "times": 1
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                4
            ],
            "async": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "time": 1,
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "time": 1
        },
        {
            "type": "playSound",
            "name": "attack.mp3"
        },
        {
            "type": "animate",
            "name": "hand",
            "loc": [
                7,
                6
            ],
            "async": true
        },
        {
            "type": "vibrate",
            "time": 500,
            "async": true
        },
        {
            "type": "sleep",
            "time": 50
        },
        {
            "type": "turnBlock",
            "direction": ":left",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "floorId": "MT106"
        },
        {
            "type": "sleep",
            "time": 50
        },
        {
            "type": "vibrate",
            "time": 500
        },
        "女子被这位大人直接掐住了喉咙。",
        "\t[梦,N683]\b[this,7,6]唔！唔！！！",
        "\t[???,N1268]\b[this,6,6]\r[red]你以为你是谁？！居然敢跟我这么说话！！",
        "\t[梦,N683]\b[this,7,6]唔！唔！！！我.....",
        "女子显露出非常痛苦的神色。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N1268]\b[this,6,6]你......",
        "\t[梦,N683]\b[this,7,6]唔！唔....",
        {
            "type": "sleep",
            "time": 500
        },
        "这位大人缓缓放下了掐住喉咙的右手。",
        "\t[梦,N683]\b[this,7,6]哈.....呼....呼.......",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N1268]\b[this,6,6].......算了，你走吧，让我一个人静一会.....",
        "\t[梦,N683]\b[this,7,6]............是。",
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    7,
                    6
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N831",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "move",
            "loc": [
                7,
                6
            ],
            "time": 500,
            "steps": [
                "down",
                "down",
                "down",
                "down",
                "down",
                "down"
            ]
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                6
            ]
        },
        "\t[???,N831]\b[this,6,6]我.......我......",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6].....我只是.......",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6].....我只是......",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]想要一个\\d\"梦\"而已呀.....",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6][]计划一定可以完成的....一定可以完成的！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]\r[red]就算真正的神，也休想阻止我完成[]计划！！！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]\r[red]哈哈哈哈哈哈哈哈！！！！等着我！我一定会成功的！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]\r[red]哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！！",
        {
            "type": "vibrate",
            "time": 1000
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 1000
        },
        ".................",
        "\t[小粽,hero]我......我死了吗？",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]头好痛！我究竟怎么了？.....",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]我....好像是在登天之巅......",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]........",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]对了，我好像想起来了，我是被那个堇给重伤了.....",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero].....登天之巅....堇....重伤....",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]我想起来了...是母亲的项链！",
        {
            "type": "sleep",
            "time": 500
        },
        "小粽看了看自己的胸口",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]项链呢？！项链不见了？？！",
        "\t[小粽,hero]我必须得找到它,因为这是母亲最珍贵的.....",
        {
            "type": "pauseBgm"
        },
        {
            "type": "callSave"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "floorId": "MT107",
            "time": 0
        },
        {
            "type": "changeFloor",
            "floorId": "MT107",
            "loc": [
                3,
                3
            ],
            "direction": "down",
            "time": 0
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80016,80017,80017,80018,  0,  0,  0,80016,80017,80017,80018,  0],
    [  0,80024,80028,80033,80034,  0,  0,  0,80032,80033,80027,80026,  0],
    [  0,80024,80026,80049,80049,  0,681,  0,80049,80049,80024,80026,  0],
    [  0,80024,80026,80049,80049,  0,80009,  0,80049,80049,80024,80026,  0],
    [  0,80024,80026,80056,80056,80009,1268,80009,80056,80056,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80020,  0,  0,  0,  0,685,  0,  0,80019,80026,  0],
    [  0,80032,80033,  0,  0,  0,  0,  0,  0,  0,80033,80034,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80009,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80009,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80009,80009,80009,  0,  0,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,102,  0,  0,  0,  0,  0,102,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,80017,80017,80017,80017,80017,80017,80017,  0,  0,  0],
    [  0,  0,80033,80033,80033,80033,80033,80033,80033,80033,80033,  0,  0]
],
    "weather": [
        "rain",
        10
    ],
    "bg2map": [

],
    "fg2map": [

]
}