main.floors.MT104=
{
    "floorId": "MT104",
    "title": "未知地带",
    "name": "未知地带",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "defaultGround": "ground",
    "bgm": "Recoil1.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]这........这里是！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "sleep",
            "time": 200
        },
        "\t[小粽,hero]\b[hero]是你！",
        "\t[???,N1398]\b[this,6,2]我们又见面了，名为小粽的勇者。",
        {
            "type": "setBlock",
            "number": "N724",
            "loc": [
                [
                    6,
                    2
                ]
            ]
        },
        "\t[小粽,hero]\b[hero]我刚刚不是在登天之巅吗？为什么会出现到这里？？！",
        "\t[???,N724]\b[this,6,2]答案很简单，是我将你传送到这里的。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]什么？？！！这......那..............",
        "\t[???,N724]\b[this,6,2]你不必紧张，我只是通过我之前送给你的命道牌，用时间凝固与空间跃迁的手段将你带到这里。",
        "\t[???,N724]\b[this,6,2]简单的说，这个空间外的世界是处于一种相对静止的状态，只有在这里时间才会流动。",
        "\t[小粽,hero]\b[hero]空间与时间.....那不是最神秘的元素吗？你究竟是何方神圣。",
        "\t[???,N724]\b[this,6,2]我之前说过了，未来你会从我这得知这一切，所以我是谁这个问题现在对你来说并不重要。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]........呼，所以你将我传送到这里来究竟是为了什么？",
        "\t[???,N724]\b[this,6,2]你之前不是与那个名为“堇”的小丫头在决战吗？你决战目的是为了找到自身所要走的路。",
        "\t[???,N724]\b[this,6,2]但是我看到了，你在探寻自身所要走的路时候并不一帆风顺呢。",
        "\t[???,N724]\b[this,6,2]我听到了你内心的呼唤，于是我就伸出一只手，将你拉入了这个空间。",
        "\t[???,N724]\b[this,6,2]让你在这个空间感悟你真正要走的路是什么！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero].................我有一个问题。",
        "\t[???,N724]\b[this,6,2]说。",
        "\t[小粽,hero]\b[hero]你为什么要帮我？帮助我对于你来说有什么益处？",
        "\t[小粽,hero]\b[hero]对于你这样的强者，应该可以随心所欲的去做自己想要完成的事吧。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                2
            ]
        },
        "\t[???,N724]\b[this,6,2]不错的问题！",
        "\t[???,N724]\b[this,6,2]的确，你与我的差距的确如同天壤之别，如果我没有什么目的的话......。的确不会浪费时间在你身上。",
        "\t[???,N724]\b[this,6,2]但是！在你的身上，我看到了.......",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                2
            ]
        },
        "\t[???,N724]\b[this,6,2]罢了，现在告诉你的话还太早了。",
        "\t[???,N724]\b[this,6,2]你只要知道，我是肯定不会加害于你的，不然你早就死于这座高塔了。",
        "\t[???,N724]\b[this,6,2]让我们回归正题！",
        "\t[???,N724]\b[this,6,2]你走的传统勇者的道路，那么我问你：何为\\d“剑”？！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero].....剑是一种武器，一种器物。",
        "\t[???,N724]\b[this,6,2]（摇了摇头）错了，大错特错！",
        "\t[???,N724]\b[this,6,2]如果你只认为剑只是一种武器的话，那么你永远也找不到自己要走的路。",
        "\t[小粽,hero]\b[hero]那剑究竟是什么呢？",
        "\t[???,N724]\b[this,6,2]剑应该是属于生命与死亡的范畴。",
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unknown",
            "loc": "hero"
        },
        {
            "type": "sleep",
            "time": 200
        },
        "\t[小粽,hero]\b[hero]生命和死亡？",
        "\t[小粽,hero]\b[hero]为什么剑会属于生命和死亡的范畴呢？它不是一种无生命体吗？",
        "\t[???,N724]\b[this,6,2]你真的觉得....剑是一种无生命体吗？",
        "\t[???,N724]\b[this,6,2]的确,在你们看来，剑对于你们来说是一种斩杀敌人的武器，这一点本身是没有错的。",
        "\t[???,N724]\b[this,6,2]但是....!这只是最浅层的理解。",
        "\t[小粽,hero]\b[hero]最浅层的理解？",
        "\t[???,N724]\b[this,6,2]就拿你们人类来说，一般的卫兵，剑师，他们都认为剑只是一种武器，一种器物。",
        "\t[???,N724]\b[this,6,2]认为实力的提升只是要不断的学习新的剑法和持之以恒的练习就行了。",
        "\t[???,N724]\b[this,6,2]这种修行方式对于他们来说看起来是没有什么问题的，但是！从他们把剑当做一种武器的那一刻就决定了他们未来的高度",
        "\t[???,N724]\b[this,6,2]我刚才说把剑当做一种武器是最浅层的理解，那么肯定会有次浅层的理解。",
        "\t[???,N724]\b[this,6,2]第二层理解：认为剑是一种载体,一种辅助自己走向更高层次的助手。",
        "\t[???,N724]\b[this,6,2]想必在我刚解释完第二层理解的时候你脑海里一定在想：载体与辅助的作用，那与第一层有什么区别呢？你说我说的对吗。",
        "\t[小粽,hero]\b[hero]（很自觉的点了点头）",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N724]\b[this,6,2]呵呵....，载体载体，顾名思义是承载一种事物的物体。",
        "\t[???,N724]\b[this,6,2]这种事物可以是一种领悟，一种意志。",
        "\t[???,N724]\b[this,6,2]是一种修行者在战斗与冥想之间所感悟到的理解与思考。",
        "\t[???,N724]\b[this,6,2]这种理解与思考反映在剑上面，承载着修行者的感悟，并且得以绽放属于自己自创的剑法。",
        "\t[???,N724]\b[this,6,2]不过就算是到达这个级别的存在对于你们人类来说就寥寥无几了....",
        "\t[???,N724]\b[this,6,2]不过与你刚刚决战的那个小丫头，她对剑的理解就差不多是这个级别的。",
        "\t[???,N724]\b[this,6,2]辅助作用我想就不必解释了，想必你应该能够理解。",
        "\t[小粽,hero]\b[hero]那么更深层次的理解又是什么呢？",
        "\t[???,N724]\b[this,6,2]第三层理解：认为是一种意境，一种天人合一的境界。",
        "\t[小粽,hero]\b[hero]意境？？！！那究竟是什么？",
        "\t[???,N724]\b[this,6,2]那是一种凌驾于感悟之上的存在....是一种对.....",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                2
            ]
        },
        "\t[???,N724]\b[this,6,2]算了，说直白一点，就是到达这个境界的人，与人对决的时候，所施展的\"剑\"能够让人们有一种身临其境的感受。",
        "\t[???,N724]\b[this,6,2]给人们带来其“剑”的情感！",
        "\t[???,N724]\b[this,6,2]到达这个层次，才称的上是摸到了生命的门槛，知道了“剑”也是有感情的。",
        "\t[小粽,hero]\b[hero]..............................",
        "\t[???,N724]\b[this,6,2]最后一种层次，也就是我一开始所说的：剑应该是属于生命与死亡的范畴。",
        "\t[???,N724]\b[this,6,2]在第三种层次中，修行者就已经摸到生命的门槛了，但是他们却忘了，生命的尽头则是死亡！",
        "\t[???,N724]\b[this,6,2]生命的存在必将在向死亡的道路上迈进，生命与死亡是对立的，但却又是统一的。",
        "\t[???,N724]\b[this,6,2]没有生命,也就不存在死亡,同样,没有死亡,也就称不上是生命",
        "\t[???,N724]\b[this,6,2]二者看似矛盾，但却一直在相互转化。",
        "\t[???,N724]\b[this,6,2]相互转化，反反复复，也产生了混沌，构建了我们这个世界。",
        "\t[???,N724]\b[this,6,2]此所谓是\\d\"因果”。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": "hero"
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero].............................",
        "\t[???,N724]\b[this,6,2]现在,你重新告诉我,你的“剑”究竟是什么？",
        "\t[小粽,hero]\b[hero].............................",
        "此时小粽回忆过往的一切......",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[???]孩子.母亲我不能再陪伴了你的身边了。",
        "\t[???]在未来你一定要照护好自己.....",
        "\t[???]母亲不要求以后你有多么大的目标，我只希望你能平平安安的活下去。",
        "\t[???]........母亲真的.....真的好想.....真的好想陪伴在你的身边....守护你...呵护你...",
        "\t[???]真的真的好想.......",
        "\t[???]永别了，我的孩子!",
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[小粽,hero]\b[hero].....母亲....",
        "\t[小粽,hero]\b[hero].............................我的剑是一种守护之剑。",
        "\t[小粽,hero]\b[hero]守护自己所珍视的事物的守护之剑。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N724]\b[this,6,2]......守护之剑吗？有趣。",
        {
            "type": "vibrate",
            "time": 500
        },
        "\t[???,N724]\b[this,6,2]哎呀，看来时间差不多了,我又要把你给送出去了。",
        {
            "type": "vibrate",
            "time": 1500,
            "async": true
        },
        "\t[小粽,hero]\b[hero]感谢前辈指点！我一定会做好自己的守护之剑的！",
        "\t[???,N724]\b[this,6,2]呵呵.....未来我们还会再见面的。",
        {
            "type": "waitAsync"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changePos",
            "loc": [
                641,
                543
            ]
        },
        {
            "type": "setBlock",
            "number": "N680",
            "loc": [
                [
                    7,
                    1
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 600
        },
        "\t[???,N680]\b[this,7,1]走了？",
        "\t[???,N724]\b[this,6,2]嗯，这个小家伙走了。",
        "\t[???,N724]\b[this,6,2]不过你怎么来我这里了？稀客呀！",
        "\t[???,N680]\b[this,7,1]我来看看你是如何糊弄一个小家伙。",
        "\t[???,N724]\b[this,6,2]啧！怎么叫糊弄呢？我说错了吗？而且我可是帮他找到了属于他自己的道路呢！",
        "\t[???,N680]\b[this,7,1]呵呵....你就尽管编吧。",
        "\t[???,N680]\b[this,7,1]明明这个世界是....",
        "\t[???,N724]\b[this,6,2]打住！那个世界还在观测这里，有些话不要乱说！",
        "\t[???,N680]\b[this,7,1]好了好了，我不说了，免得..........",
        "\t[???,N680]\b[this,7,1]所以接下来你打算干什么？",
        "\t[???,N724]\b[this,6,2]能干什么？继续看呗，难道我还能揍你一顿？",
        "\t[???,N680]\b[this,7,1]..........",
        "\t[???,N680]\b[this,7,1]具体一点，我很好奇呢。",
        "\t[???,N724]\b[this,6,2]好吧，既然你这么想知道我就告诉你。",
        "...........................",
        "\t[???,N680]\b[this,7,1]我丢！你这想法也太........那啥了吧..",
        "\t[???,N724]\b[this,6,2]你觉得很那啥吗？我觉得挺好呀！",
        "\t[???,N680]\b[this,7,1]我觉得到时有人肯定会一脸懵逼，然后也有人到时肯定会记仇的..",
        "\t[???,N724]\b[this,6,2]呵呵....到时再说吧。",
        "\t[???,N724]\b[this,6,2]好了，你安静一点，让我好好看看这个小家伙。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": "MT103",
            "loc": [
                9,
                0
            ],
            "direction": "down",
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "insert",
            "loc": [
                14,
                13
            ],
            "floorId": "MT103"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,1398,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}