main.floors.MT129=
{
    "floorId": "MT129",
    "title": "家（回忆）",
    "name": "家（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[母亲,N729]\b[this,4,7]孩子，慢点吃，别噎着了。",
        "\t[小粽,N728]\b[this,4,9]嗯嗯。",
        "\t[小粽,N728]\b[this,4,9]妈妈你不吃一点吗？",
        "\t[母亲,N729]\b[this,4,7]妈妈不饿，你自己先吃吧。",
        "\t[小粽,N728]\b[this,4,9]妈妈你还是吃一点吧，不然小粽看到母亲挨饿会不高兴的。",
        "\t[母亲,N729]\b[this,4,7]好，我吃，我吃。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "一段时间后。",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    8
                ]
            ],
            "remove": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    3,
                    8
                ]
            ],
            "remove": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "setCurtain",
            "color": [
                92,
                92,
                92,
                0.27
            ],
            "time": 0,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,N728]\b[this,4,9]好好吃呀~吃的好饱呀",
        "\t[母亲,N729]\b[this,4,7]吃饱了吗？妈妈有个东西要送你。",
        "\t[小粽,N728]\b[this,4,9]什么东西？什么东西呀。",
        "母亲从自己的口袋里拿出了一串项链。",
        "所制造项链的材质非常珍贵，一看不是凡品。",
        "\t[母亲,N729]\b[this,4,7]这是妈妈的项链，现在就给你带着吧。",
        "\t[小粽,N728]\b[this,4,9]这也太珍贵了吧....",
        "\t[母亲,N729]\b[this,4,7]傻儿子，无论是你还是项链都是妈妈最珍视的事物。",
        "\t[母亲,N729]\b[this,4,7]所以现在赶紧带上吧。",
        "\t[小粽,N728]\b[this,4,9]好呀好呀！",
        "小粽带上了母亲的项链。",
        "\t[母亲,N729]\b[this,4,7]呀！我儿子带上这个项链正合适呢。",
        "母亲此时不知道为什么眉头微皱。",
        "\t[小粽,N728]\b[this,4,9]妈妈你怎么了？是不是生病了呀。",
        "\t[母亲,N729]\b[this,4,7]妈妈没事，我只是感到不安。",
        "\t[小粽,N728]\b[this,4,9]啊？妈妈你还是早点休息吧，估计明天就没事了吧。",
        "\t[母亲,N729]\b[this,4,7].....或许吧。",
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        "\t[???]终于找到你了！神之祭品！！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                9
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    4,
                    7
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    4,
                    9
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[母亲,N731]\b[this,4,7]什么人？！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire1",
            "loc": [
                10,
                8
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    10,
                    8
                ]
            ],
            "floorId": "MT129",
            "time": 0
        },
        {
            "type": "show",
            "loc": [
                [
                    11,
                    9
                ]
            ],
            "floorId": "MT129",
            "time": 0
        },
        {
            "type": "show",
            "loc": [
                [
                    11,
                    7
                ]
            ],
            "floorId": "MT129",
            "time": 0
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                9
            ]
        },
        "\t[母亲,N731]\b[this,4,7]你们是谁？！想要干什么？？！",
        "\t[???,N734]\b[this,10,8]我们是奉那位大人之令前来与此，将你投入神的怀抱！",
        "\t[母亲,N731]\b[this,4,7]小粽！快到我身后！！",
        {
            "type": "move",
            "loc": [
                4,
                9
            ],
            "time": 50,
            "keep": true,
            "steps": [
                "left",
                "left",
                "up",
                "up"
            ]
        },
        "\t[母亲,N731]\b[this,4,7]你们究竟是谁？为什么要针对我们？？！",
        "\t[???,N734]\b[this,10,8]我之前说过了，你是属于神的祭品。",
        "\t[???,N734]\b[this,10,8]是实施【】计划不可或缺的一部分！",
        "\t[母亲,N731]\b[this,4,7]你....你们！",
        "\t[???,N734]\b[this,10,8]放心，只在一瞬间就可以了结你的生命，不会有任何痛苦！",
        "\t[???,N734]\b[this,10,8]交给你们两个去解决吧。",
        "\t[???,N738]\b[this,11,7]是！大人。",
        "\t[???,N742]\b[this,11,9]是！大人。",
        {
            "type": "move",
            "loc": [
                11,
                7
            ],
            "time": 500,
            "keep": true,
            "async": true,
            "steps": [
                "left",
                "left",
                "left",
                "left",
                "left"
            ]
        },
        {
            "type": "move",
            "loc": [
                11,
                9
            ],
            "time": 500,
            "keep": true,
            "async": true,
            "steps": [
                "left",
                "left",
                "left",
                "left",
                "up",
                "up",
                "up"
            ]
        },
        "\t[母亲,N731]\b[this,4,7].......",
        "\t[???,N734]\b[this,10,8]不对！你们两个快后退！！",
        {
            "type": "playSound",
            "name": "Ice7.ogg"
        },
        {
            "type": "animate",
            "name": "light2",
            "loc": [
                4,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                2,
                7
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                10,
                8
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                7
            ],
            "async": true
        },
        "\t[小粽,N727]\b[this,2,7]妈妈！！",
        "\t[母亲,N731]\b[this,4,7].......我不允许任何人伤害我的孩子！",
        "\t[母亲,N731]\b[this,4,7]破！",
        "\t[???,N738]\b[this,10,8]不好！",
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                6,
                7
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                7,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "move",
            "loc": [
                6,
                7
            ],
            "time": 10,
            "keep": true,
            "async": true,
            "steps": [
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward"
            ]
        },
        {
            "type": "move",
            "loc": [
                7,
                6
            ],
            "time": 10,
            "keep": true,
            "async": true,
            "steps": [
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward"
            ]
        },
        {
            "type": "vibrate",
            "time": 500
        },
        "\t[???,N742]呜哇！！",
        "\t[???,N738]怎么可能！一个人类怎么可能拥有这种力量！！",
        {
            "type": "turnBlock",
            "direction": ":back",
            "loc": [
                [
                    10,
                    8
                ]
            ]
        },
        "\t[???,N735]\b[this,10,8]两位圣护之手级别的人物居然一击就给打飞了.....",
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    10,
                    8
                ]
            ]
        },
        "\t[???,N734]\b[this,10,8]哼哼哼哼哼哼哈哈哈哈哈哈哈哈，果然如此！果然如此呀！！",
        "\t[???,N734]\b[this,10,8]那个家伙果然没有骗我呢，看来你的确是神之祭品呢。",
        "\t[母亲,N731]\b[this,4,7].....................",
        "\t[???,N734]\b[this,10,8]虽然我不知道你是从何而来的力量。",
        "\t[???,N734]\b[this,10,8]不过呢，你的力量与我相比还是存在着天壤之别！",
        "\t[母亲,N731]\b[this,4,7]（这个男人实力太过强大,看来我只能.....）",
        "\t[母亲,N731]\b[this,4,7]是吗？",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                4,
                7
            ]
        },
        "\t[???,N734]\b[this,10,8]嗯？",
        "\t[???,N734]\b[this,10,8]居然连生命之火都点燃了，不过只是饮鸩止渴罢了！",
        "\t[小粽,N727]\b[this,2,7]妈妈!!不要呀！！",
        "小粽拼劲全力想要挡在母亲面前,可是却不能行走半步",
        "\t[母亲,N731]\b[this,4,7]对不起，孩子，妈妈以后再也照护不了你了",
        "\t[???,N734]\b[this,10,8]好家伙，没想到你的潜力居然如此之大，居然都接近本座的实力了！",
        "\t[???,N734]\b[this,10,8]本座改变主意了，在把你交给那个家伙之前，就当本座最佳试验品吧！",
        "\t[???,N734]\b[this,10,8]通过你的身体，本座的科学一定会到达一个崭新的高度！",
        "\t[???,N734]\b[this,10,8]来吧！就让我看看你究竟能做到些什么！！",
        "\t[母亲,N731]\b[this,4,7]你会为你的自大而后悔的！",
        "\t[母亲,N731]\b[this,4,7]神圣之怒！",
        "\t[???,N734]\b[this,10,8]解！",
        {
            "type": "animate",
            "name": "attack17",
            "loc": [
                10,
                8
            ],
            "async": true
        },
        {
            "type": "vibrate",
            "time": 500,
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXIce8.ogg"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "VXBreath.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "spark1.wav"
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "Eternity1.mp3"
        },
        "\t[小粽,N725]妈妈！妈妈！！",
        "\t[母亲]孩子不要哭，那些家伙被我打跑了。",
        "\t[母亲]不过妈妈我不能再陪伴了你的身边了。",
        "\t[母亲]在未来你一定要照护好自己.....",
        "\t[母亲]妈妈不要求以后你有多么大的目标，我只希望你能平平安安的活下去。",
        "\t[母亲]........妈妈真的.....真的好想.....真的好想陪伴在你的身边....守护你...呵护你...",
        "\t[母亲]真的真的好想.......",
        "\t[母亲]永别了,我的孩子!",
        "\t[小粽,N725]不！不要啊！！！",
        "\t[小粽,N725]啊啊啊啊！！！",
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "vibrate",
            "time": 1000
        },
        {
            "type": "sleep",
            "time": 500
        },
        "母亲的死强烈刺激了小粽，随着陷入了昏迷。",
        "不知过了多久",
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "holy1.mp3",
            "keep": true
        },
        "在未知地带",
        "\t[???]属下参见大人！",
        "\t[???]回来了？任务完成了？",
        "\t[???]是的,任务完成了",
        "\t[???]咳咳咳！！",
        "\t[???]哦？圣羽洛斯，你居然受伤了",
        "\t[???]大人，具体是这样的.....",
        "...................",
        "\t[???]......那个神之祭品竟然有如此实力,不仅击杀了一名圣护之手而且就连你也受伤了。",
        "\t[???]是属下无能，低估了神之祭品的实力。",
        "\t[???]罢了罢了，任务完成了就行。",
        "\t[???]在你不在的这些天，我们的准备工作也做了个七七八八，不久应该就能完成了。",
        "\t[???]那岂不是说可以要实施【】计划了？",
        "\t[???]不，时机还未到。",
        "\t[???]那要等到什么时候呢？",
        "\t[???]\r[red]八年之后！！",
        {
            "type": "sleep",
            "time": 500
        },
        "时间回到现在",
        {
            "type": "pauseBgm"
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "setCurtain",
            "time": 1
        },
        {
            "type": "changeFloor",
            "floorId": ":next",
            "loc": [
                6,
                10
            ],
            "direction": "down",
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,10016,10017,10018,10016,10017,10018,10016,10017,10018,10016,10018, 20],
    [ 20,10016,10017,10018,10016,10017,10018,10016,10017,10018,10016,10018, 20],
    [ 20,10024,10025,10026,10024,10025,10026,10024,10025,10026,10024,10026, 20],
    [ 20,  0,  0,  0,  0,10035,10036,10037,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,10043,10044,10045,  0,  0,  0,  0,10016],
    [ 20,  0,  0,  0,  0,10051,10052,10053,  0,  0,  0,  0,10016],
    [ 20,  0,  0,10032,729,10034,  0,  0,  0,  0,  0,738,10024],
    [ 20,  0,  0,170083,10041,170080,  0,  0,  0,  0,734,  0,  0],
    [ 20,  0,  0,10048,728,10050,  0,  0,  0,  0,  0,742, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10006,10007,  0,  0,  0],
    [  0,  0,10163,10111,  0,  0,  0,  0,10014,10015,  0,  0,  0],
    [  0,10115,10107,10071,  0,10104,10105,10104,10172,10171,  0,10095,  0],
    [  0,10114,10114,10079,  0,10112,10113,10112,10180,10179,  0,10103,  0],
    [  0,  0,  0,10087,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,10033,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,170083,  0,170080,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10095,  0,  0,  0,  0,  0,  0,  0,  0,  0,10095,  0],
    [  0,10103,  0,  0,  0,  0,  0,  0,  0,  0,  0,10103,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "color": [
        92,
        92,
        92,
        0.27
    ],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,10040,  0,10042,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,10049,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}