main.floors.MT128=
{
    "floorId": "MT128",
    "title": "体之巅顶层",
    "name": "体之巅顶层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1000,
    "defaultGround": "ground",
    "bgm": "battle7.mp3",
    "weather": [
        "rain",
        1
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "battle8.mp3",
            "keep": true
        },
        "\t[泰帝,E723]\b[this,6,4]............",
        "\t[泰帝,E723]\b[this,6,4]哼！终于来了个能打的吗？",
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]你就是四星尊天中管辖体之巅的体魄星尊——\\d泰帝吧！",
        "\t[泰帝,E723]\b[this,6,4]小子，要不是看你的实力有两把刷子，上一个直称老子名字的人，他的坟头边上的草早已三丈高了！",
        "\t[小粽,hero]\b[hero]...呵，果然与你的名字一样，说话都带着一种桀骜之气。",
        "\t[泰帝,E723]\b[this,6,4]小子你找死？！",
        {
            "type": "playSound",
            "name": "111-Heal07.ogg"
        },
        {
            "type": "animate",
            "name": "up1",
            "loc": [
                6,
                3
            ]
        },
        "\t[小粽,hero]\b[hero]（好强大的气血波动！不愧是体之巅的最强者。）",
        "\t[泰帝,E723]\b[this,6,4]小子，老子知道你来这里的目的，不就是去拿老子的身份符去阴阳圣坛吗？！",
        "\t[泰帝,E723]\b[this,6,4]你能来到老子这里就说明堇那个小丫头已经败了。",
        "\t[泰帝,E723]\b[this,6,4]不过老子很好奇呀，虽然你这小子的实力不弱，但是与堇那个小丫头相比还是差了不少。",
        "\t[泰帝,E723]\b[this,6,4]你是怎么击败堇并且来到老子这里的呢？",
        "\t[小粽,hero]\b[hero]商业机密，我们还是保持一点距离比较好。",
        "\t[泰帝,E723]\b[this,6,4]很好，既然你小子诚心要找死，就怪不得我了！",
        "\t[泰帝,E723]\b[this,6,4]受死吧！",
        {
            "type": "move",
            "loc": [
                6,
                4
            ],
            "time": 100,
            "keep": true,
            "steps": [
                "down",
                "down",
                "down",
                "down"
            ]
        },
        {
            "type": "battle",
            "id": "E723"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "hope1.mp3",
            "keep": true
        },
        {
            "type": "move",
            "loc": [
                6,
                8
            ],
            "time": 0,
            "keep": true,
            "steps": [
                "up",
                "up"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[泰帝,E723]\b[this,6,6]不...不可能！",
        "\t[泰帝,E723]\b[this,6,6]一个乳臭未干的小鬼怎么可能击败我？！",
        "\t[小粽,hero]\b[hero]呼....呼....好强！",
        "\t[小粽,hero]\b[hero]没想到你居然有如此强大的肉身力量。",
        "\t[泰帝,E723]\b[this,6,6]你....你！！",
        "\t[小粽,hero]\b[hero]只可惜，你的心早已偏离了正轨。",
        "\t[泰帝,E723]\b[this,6,6]不！不要杀我！我可以认你为主。",
        "\t[小粽,hero]\b[hero]作为四星尊，我觉得你还是有尊严的死去比较好吧！",
        "\t[小粽,hero]\b[hero]永别了！泰帝星尊。",
        "\t[小粽,hero]\b[hero]\\d天破苍穹！",
        "\t[泰帝,E723]\b[this,6,6]不！！不要！！",
        {
            "type": "animate",
            "name": "attack17",
            "loc": [
                6,
                6
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXIce8.ogg"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "VXBreath.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "spark1.wav"
        },
        "\t[泰帝,E723]\b[this,6,6]呃啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！！！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[小粽,hero]\b[hero]......结束了。",
        {
            "type": "pauseBgm"
        },
        {
            "type": "hideStatusBar"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "小粽在击杀泰帝星尊后成功的拿到了他的身份符离开了，并且体之巅的区域。",
        "在去音律塔的途中仙琳告诉小粽，堇已经准备好秘法去阴阳圣坛了。",
        "而且还说堇会不时的告诉仙琳关于阴阳圣坛的情报。",
        "接下来就是音律星尊——罗天了！小粽如是说道。",
        "\t[仙琳,fairy]小粽，堇姐姐说过罗天这个人非常难缠，你一定要小心应对。",
        "\t[小粽,hero]嗯，最近我查阅了一些书籍，罗天使用的音律应该属于精神类的魔法。",
        "\t[小粽,hero]攻击人的精神系统，并且加以控制，的确非常难缠。",
        "\t[小粽,hero]对付这种魔法只能守住灵台，或者第一时间打断他的魔法。",
        "\t[仙琳,fairy]小粽，现在天色已晚，而且离音律塔还有一大段距离，不然我们就在这里休息吧。",
        "\t[小粽,hero]好吧，看这距离就算是赶夜路也到不了呀。",
        "\t[小粽,hero]就在这里休息吧。",
        {
            "type": "sleep",
            "time": 500
        },
        "小粽和仙琳依靠在一棵大树下渐渐进入了梦乡........",
        {
            "type": "sleep",
            "time": 500
        },
        "\\d八年前",
        {
            "type": "function",
            "function": "function(){\ncore.removeMaps(\"MT128\")\n}"
        },
        {
            "type": "hide",
            "loc": [
                [
                    10,
                    8
                ]
            ],
            "floorId": "MT129",
            "time": 0
        },
        {
            "type": "hide",
            "loc": [
                [
                    11,
                    9
                ]
            ],
            "floorId": "MT129",
            "time": 0
        },
        {
            "type": "hide",
            "loc": [
                [
                    11,
                    7
                ]
            ],
            "floorId": "MT129",
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 0
        },
        {
            "type": "changeFloor",
            "floorId": ":next",
            "loc": [
                1111,
                1111
            ],
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,149,149,149,180128,180129,180129,180129,180130,149,149,149,149],
    [149,149,149,180128,180136,180137,180137,180137,180138,180130,149,149,149],
    [149,149,180128,180136,  0,  0,723,  0,  0,180138,180130,149,149],
    [149,149,180136,  0,  0,  0,  0,  0,  0,  0,180138,149,149],
    [149,149,  0,  0,  0,  0,  0,  0,  0,  0,  0,149,149],
    [149,149,  0,  0,  0,  0,  0,  0,  0,  0,  0,149,149],
    [149,149,  0,  0,  0,  0,  0,  0,  0,  0,  0,149,149],
    [149,149,  0,  0,  0,  0,  0,  0,  0,  0,  0,149,149],
    [149,149,  0,  0,  0,  0,  0,  0,  0,  0,  0,149,149],
    [149,149,149,  0,  0,  0,  0,  0,  0,  0,149,149,149],
    [149,149,149,149,  0,  0,  0,  0,  0,149,149,149,149]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,143,143,143,143,143,  0,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,143,143,143,143,143,143,143,143,143,  0,  0],
    [  0,  0,143,143,143,143,143,143,143,143,143,  0,  0],
    [  0,  0,143,143,143,143,143,143,143,143,143,  0,  0],
    [  0,  0,143,143,143,143,143,143,143,143,143,  0,  0],
    [  0,  0,143,143,143,143,143,143,143,143,143,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,  0,143,143,143,143,143,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}