main.floors.MT130=
{
    "floorId": "MT130",
    "title": "野外",
    "name": "野外",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "color": [
        15,
        15,
        15,
        0.4
    ],
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "start.mp3",
            "keep": true
        },
        "\t[小粽,hero]\b[hero].........................",
        "\t[小粽,hero]\b[hero]我又做噩梦了吗？",
        "\t[仙琳,fairy]\b[this,5,9]小粽，你怎么了？",
        "\t[小粽,hero]\b[hero]我想起我早已死去的母亲了。",
        "\t[仙琳,fairy]\b[this,5,9]母........亲....吗？",
        "\t[小粽,hero]\b[hero]我胸前的项链就是母亲送给我的，这是母亲最珍贵的东西。",
        "\t[小粽,hero]\b[hero]母亲她可以说是天底下最善良的人。",
        "\t[小粽,hero]\b[hero]是母亲给予了我生命，并且她以生命的代价保护了我。",
        "\t[仙琳,fairy]\b[this,5,9].................",
        "\t[小粽,hero]\b[hero]这份大恩大德，我这辈子都偿还不了了.......",
        "\t[仙琳,fairy]\b[this,5,9]小粽，你的母亲是被什么人给杀死的呢？",
        "\t[小粽,hero]\b[hero]由于母亲的死，我失去了关于这件事情的大部分记忆，但是有一个人他就算烧成灰我也不会忘记！",
        "\t[小粽,hero]\b[hero]那个人的头发是明亮的金色，并且他的行为像是一个彻头彻尾的疯子。",
        "\t[小粽,hero]\b[hero]仙琳，其实我来这座魔塔的目的不只是为了什么报酬和锻炼自己。",
        "\t[小粽,hero]\b[hero]而是感觉这座高塔对我有一种十分奇特的感觉。",
        "\t[小粽,hero]\b[hero]并且我敢可以肯定杀害母亲的凶手一定在这座高塔里面！",
        "\t[仙琳,fairy]\b[this,5,9]你是说杀害你母亲的人是魔塔中人？！",
        "\t[仙琳,fairy]\b[this,5,9]...小粽你也知道只有魔王能够操纵这座高塔对外的传送法阵。",
        "\t[仙琳,fairy]\b[this,5,9]杀害你母亲的难道是魔王？",
        "\t[小粽,hero]\b[hero].....我也不知道是不是魔王，我只知道他们是神的代言人，是奉神的指令来的......",
        "\t[仙琳,fairy]\b[this,5,9]神？这个世界真的有神存在吗？神不是只在传说之中才会出现的人物吗？！",
        "\t[小粽,hero]\b[hero]那应该不是魔王，虽然我隐隐感觉魔王的实力非常恐怖，但是他应该还没有达到神的层次。",
        "\t[小粽,hero]\b[hero]如果魔王真的是所谓的神的话，我们这个世界估计早已终结了吧...",
        "\t[小粽,hero]\b[hero]（那个长的跟我一模一样的人可能就是所谓的神吧。）",
        "\t[小粽,hero]\b[hero]算了，无论我的对手是魔王还是所谓的神都不会影响我要走的路！",
        "\t[仙琳,fairy]\b[this,5,9]....我不明白，为什么你如此自信，明明现在的你与魔王相去甚远。",
        "\t[仙琳,fairy]\b[this,5,9]为什么要如此坚持，难道你不怕死吗？",
        "\t[小粽,hero]\b[hero].......或许，在逆难中前行就是我要走的路吧！",
        "\t[仙琳,fairy]\b[this,5,9]......小粽，有件事情看来我必须跟你说了。",
        "\t[小粽,hero]\b[hero]什么事情？",
        "\t[仙琳,fairy]\b[this,5,9]....其实一开始我接近你是带有一些目的性的。",
        "\t[小粽,hero]\b[hero]目的性？难道说你......",
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "lolita3.mp3",
            "keep": true
        },
        "\t[仙琳,fairy]\b[this,5,9]因为我想要去看看外面的世界！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "changePos",
            "loc": [
                6,
                10
            ],
            "direction": "left"
        },
        "\t[小粽,hero]\b[hero]仙琳，你.......",
        "\t[仙琳,fairy]\b[this,5,9]其实我的母亲在我记事之前就已经去世了，但是我外婆跟我说过母亲在去世之前最无法忘怀的就是外面的世界。",
        "\t[仙琳,fairy]\b[this,5,9]虽然这座高塔可以模拟出一些风景，但是我还是想去看看真实的风景。",
        "\t[仙琳,fairy]\b[this,5,9]所以我希望你一定要保护好自己，并且在未来...",
        "\t[仙琳,fairy]\b[this,5,9]\\d你能带我去外面的世界吗？",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]当然愿意呀。",
        {
            "type": "move",
            "loc": [
                5,
                9
            ],
            "time": 10,
            "keep": true,
            "steps": [
                "down"
            ]
        },
        "仙琳的手臂挽住了小粽的手臂。",
        "\t[仙琳,fairy]\b[hero]真..真的吗？？！",
        "\t[小粽,hero]\b[hero]嗯，放心吧，一定会的。",
        "\t[仙琳,fairy]\b[this,5,9]太好了！太好了！我们说定了哟~",
        "\t[仙琳,fairy]\b[this,5,9]（妈妈，或许这就是外婆跟我说的幸福感吧！）",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "经过一夜的交流,小粽和仙琳之间的关系更加亲近了,或许在他们两个之间多了些什么........",
        "第二天,小粽和仙琳来到了音律星尊——罗天管辖的领域：音律塔。",
        {
            "type": "pauseBgm"
        },
        {
            "type": "changeFloor",
            "floorId": ":next",
            "loc": [
                6,
                10
            ],
            "direction": "up",
            "time": 0
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [145,145,145,145,145,145,145,  0,145,145,145,145,145],
    [145,145,145,145,145,145,200021,  0,145,145,145,145,145],
    [145,145,145,145,200082,200007,  0,  0,  0,145,145,145,145],
    [145,145,145,  0,  0,  0,  0,  0,  0,  0,145,145,145],
    [145,145,200074,  0,  0,  0,  0,  0,  0,  0,  0,145,145],
    [145,200081,200082,  0,  0,  0,  0,  0,  0,  0,  0,145,145],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200014,145],
    [145,200006,  0,  0,  0,  0,  0,  0,  0,  0,200006,  0,  0],
    [145,145,200013,  0,  0,200010,  0,  0,  0,200010,  0,  0,145],
    [145,145,  0,  0,  0,124,  0,  0,200006,  0,  0,145,145],
    [145,145,  0,200059,  0,  0,  0,  0,  0,  0,  0,145,145],
    [145,145,145,200067,200010,  0,  0,  0,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145]
],
    "bgmap": [
    [200000,200000,200000,200000,200000,200000,146,151,151,151,151,151,151],
    [200000,200000,200000,200000,200000,200000,146,151,151,151,151,151,151],
    [200000,200000,200000,200081,200000,200000,146,151,151,151,151,151,151],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [146,146,146,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,146,200000,200000,200000,200000,200000,200000,200000,200000,146,146],
    [200000,200000,146,146,200000,200000,200000,200000,200000,200000,146,146,200000],
    [200000,200000,200000,146,146,146,200000,200000,200000,200000,146,200000,200000],
    [200000,200000,200000,146,146,146,200000,200000,200000,146,146,200000,200000],
    [200000,200000,200000,200000,200000,146,146,146,146,146,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,200074,200075,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,200059,  0,200083,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200066,200067,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,200073,  0,200075,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,200083,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,200049,200050,  0,  0,  0,200179,200180,  0,  0,  0,  0,  0],
    [  0,200057,200058,  0,  0,200186,200187,200188,  0,  0,  0,  0,  0],
    [  0,200065,200066,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,200120,200121,200122,200123,200124,200125,200126,200127,  0,  0],
    [  0,  0,  0,200128,200129,200130,200131,200132,200133,200134,200135,  0,  0],
    [  0,  0,  0,200136,200137,200138,200139,200140,200141,200142,200143,  0,  0],
    [  0,  0,  0,200144,200145,200146,200147,200148,200149,200150,200151,  0,  0],
    [  0,  0,  0,200152,200153,200154,200155,200156,200157,200158,200159,  0,  0],
    [  0,  0,  0,200160,200161,200162,200163,200164,200165,200166,200167,  0,  0],
    [  0,  0,  0,200168,200169,200170,200171,200172,200173,200174,200175,  0,  0],
    [  0,  0,  0,200176,200177,200178,  0,  0,200181,200182,200183,  0,  0],
    [  0,  0,  0,200184,200185,  0,  0,  0,200189,200190,200191,  0,  0],
    [  0,  0,  0,200192,200193,200194,200195,200196,200197,200198,200199,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}