main.floors.MT140=
{
    "floorId": "MT140",
    "title": "音律塔十层",
    "name": "音律塔十层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "bgm": "battle9.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,5": [
            "打败这里八个大音律使才能打boss。",
            "而且这里的宝石外面的机关门要把boss打败才能开启。"
        ],
        "6,3": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[洛柔,E748]人类?!为什么要打破这里的宁静？！!",
                "\t[小粽,hero]在下小粽,来此的目的是......",
                "\t[洛柔,E748]哼！闯入罗天大人设置的音律塔，打破这里的宁静，作为惩罚。",
                "\t[洛柔,E748]就让你命丧于此吧！",
                {
                    "type": "battle",
                    "id": "E748"
                },
                "\t[洛柔,E748]该死！怎么这么强？！",
                "\t[洛柔,E748]你给我等着！罗天大人必将你击毙与这座音律塔！",
                {
                    "type": "openDoor",
                    "loc": [
                        1,
                        4
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        11,
                        4
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        5,
                        1
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        5,
                        2
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        6,
                        2
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        7,
                        1
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        7,
                        2
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        4,
                        1
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        8,
                        1
                    ]
                },
                {
                    "type": "insert",
                    "loc": [
                        9,
                        3
                    ]
                }
            ]
        },
        "9,3": [
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        3
                    ]
                ],
                "remove": true,
                "time": 500
            },
            "\t[小粽,hero]怎么这些家伙一言不合就开打呀....",
            "\t[小粽,hero]看来罗天这个人不好交流呀。"
        ],
        "2,0": [
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        3
                    ]
                ],
                "remove": true,
                "time": 500
            },
            "\t[小粽,hero]怎么这些家伙一言不合就开打呀....",
            "\t[小粽,hero]看来罗天这个人不好交流呀"
        ],
        "11,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[仙琳,fairy]\b[this,11,9]我可以提升你的商店等级，让商店里相同金钱出售的能力*2.5，购买价格到48000时来找我吧。",
                {
                    "type": "choices",
                    "text": "\t[仙琳,fairy]是否加倍？",
                    "choices": [
                        {
                            "text": "加倍！",
                            "action": [
                                {
                                    "type": "if",
                                    "condition": "(flag:shop_times>=598)",
                                    "true": [
                                        {
                                            "type": "disableShop",
                                            "id": "116Fshop"
                                        },
                                        "\t[仙琳,fairy]\b[this,11,9]搞定，顺便为了方便你购买，基础价格和购买效果也翻了一倍。",
                                        {
                                            "type": "hide",
                                            "time": 500
                                        },
                                        {
                                            "type": "openShop",
                                            "id": "141Fshop"
                                        }
                                    ],
                                    "false": [
                                        "\t[仙琳,fairy]\b[this,11,9]不够不够。",
                                        {
                                            "type": "exit"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "text": "暂时不用",
                            "action": [
                                "\t[仙琳,fairy]\b[this,11,9]那好吧。"
                            ]
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "8,11": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {
        "4,5": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "4,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "1,5": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "1,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "8,5": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_4",
                "operator": "+=",
                "value": "1"
            }
        ],
        "8,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_4",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_4",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,5": [
            {
                "type": "setValue",
                "name": "flag:door_MT140_6_4",
                "operator": "+=",
                "value": "1"
            }
        ],
        "6,3": []
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,5": {
            "0": {
                "condition": "flag:door_MT140_6_5==4",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            }
        },
        "6,4": {
            "0": {
                "condition": "flag:door_MT140_6_4==4",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,396,150,150, 85, 85, 87, 85, 85,150,150,396,150],
    [150,396,150,150,150, 85, 85, 85,150,150,150,396,150],
    [150,396, 24,150,150,150,748,150,150,150, 24,396,150],
    [150, 85,  0,150,150,150, 85,150,150,150,  0, 85,150],
    [150,749,  0,129,749,150, 85,150,749,  0,  0,749,150],
    [150,399,  0,  0,399, 81,  0, 81,399,  0,  0,399,150],
    [150,749,  0,  0,749,150,  0,150,749,  0,  0,749,150],
    [150,150,150,150,150,150,335,150,150,150,150,150,150],
    [150,  0,  0,  0,  0,351,399,351,  0,  0,  0,124,150],
    [150, 83,150, 83,150, 83,150,150,  0,150,150, 83,150],
    [150,401,150,401,150,401,150,150, 88,150,150,401,150],
    [150,399,150,399,150,399,150,150,150,150,150,399,150]
],
    "bgmap": [
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,154,  0,  0,154,154,154,154,154,  0,  0,154,  0],
    [  0,154,  0,  0,  0,154,154,154,  0,  0,  0,154,  0],
    [  0,154,154,  0,  0,  0,154,  0,  0,  0,154,154,  0],
    [  0,154,154,  0,  0,  0,154,  0,  0,  0,154,154,  0],
    [  0,154,154,154,154,  0,154,  0,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,  0,154,  0,154,154,154,154,  0],
    [  0,  0,  0,  0,  0,  0,154,  0,  0,  0,  0,  0,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,  0,154,  0,154,  0,  0,154,  0,  0,154,  0],
    [  0,154,  0,154,  0,154,  0,  0,154,  0,  0,154,  0],
    [  0,154,  0,154,  0,154,  0,  0,  0,  0,  0,154,  0]
],
    "fg2map": [

]
}