main.floors.MT152=
{
    "floorId": "MT152",
    "title": "家（回忆）",
    "name": "家（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "bgm": "battle9.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "Eternity1.mp3",
            "keep": true
        },
        {
            "type": "setCurtain",
            "color": [
                92,
                92,
                92,
                0.27
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ]
        },
        "\t[小粽,N727]\b[this,6,7]我....我怎么变成了以前小时候的模样？！这是怎么回事？？！",
        "小粽看到了他最想念的人。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ]
        },
        "\t[小粽,N727]\b[this,6,7]！！！！！母亲？！",
        "\t[母亲,N731]\b[this,8,7]小粽！快....跑！快跑呀！！！",
        "\t[???,N734]\b[this,9,7]很遗憾！虽然燃烧了你的生命之火，但是你我之间的差距还是如同天壤之别！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ]
        },
        "\t[小粽,N727]\b[this,6,7]这声音是....!",
        {
            "type": "move",
            "loc": [
                6,
                7
            ],
            "time": 200,
            "keep": true,
            "steps": [
                "down"
            ]
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        "\t[小粽,N727]\b[this,6,8]！！！！是你？！",
        {
            "type": "move",
            "loc": [
                6,
                8
            ],
            "time": 50,
            "keep": true,
            "steps": [
                "right",
                "right",
                "right"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    9,
                    8
                ]
            ]
        },
        "\t[小粽,N727]\b[this,9,8]我要杀了你！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                8,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                9,
                7
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    9,
                    7
                ]
            ]
        },
        "\t[母亲,N731]\b[this,8,7]小粽！！！",
        "\t[???,N733]\b[this,9,7]哼！",
        {
            "type": "screenFlash",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 300,
            "times": 1
        },
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                6,
                8
            ],
            "async": true
        },
        {
            "type": "move",
            "loc": [
                9,
                8
            ],
            "time": 10,
            "keep": true,
            "steps": [
                "backward",
                "backward",
                "backward"
            ]
        },
        {
            "type": "vibrate",
            "time": 500
        },
        "\t[小粽,N728]\b[this,9,11]噗！！",
        "\t[???,N733]\b[this,9,7]一个乳臭未干的小鬼也想与本座抗衡？！",
        "\t[母亲,N731]\b[this,8,7]你！！",
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    9,
                    7
                ]
            ]
        },
        "\t[???,N734]\b[this,9,7]先让你睡一会吧！",
        {
            "type": "playSound",
            "name": "115-Raise01.ogg"
        },
        {
            "type": "animate",
            "name": "attack20",
            "loc": [
                8,
                7
            ]
        },
        "母亲陷入了昏迷，虽然看起来跟之前没什么区别。",
        "\t[小粽,N728]\b[this,9,11]母.....母亲！",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    9,
                    7
                ]
            ]
        },
        "\t[???,N733]\b[this,9,7]你先管好你自己吧！",
        {
            "type": "move",
            "loc": [
                9,
                7
            ],
            "time": 10,
            "keep": true,
            "steps": [
                "down",
                "down",
                "down"
            ]
        },
        {
            "type": "vibrate",
            "time": 500,
            "async": true
        },
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                9,
                11
            ]
        },
        {
            "type": "vibrate",
            "time": 500,
            "async": true
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 300,
            "times": 3,
            "async": true
        },
        {
            "type": "vibrate",
            "time": 500
        },
        "\t[小粽,N728]\b[this,9,11]噗！！咳咳咳！！",
        "\t[???,N733]\b[this,9,10]勇气可嘉，但是要拥有其实力才行！",
        "\t[小粽,N728]\b[this,9,11]......你！",
        "\t[???,N733]\b[this,9,10]你没有什么力量就直接冲上来，这是愚者的行为！",
        "\t[???,N733]\b[this,9,10]你说，既然你这么弱小为什么还要阻止我呢？",
        "\t[???,N733]\b[this,9,10]\r[red]为什么不去死呢？！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N733]你说，既然你这么弱小为什么还要阻止我呢？",
        "\t[???,N733]\r[red]为什么不去死呢？！",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[???,N733]\r[red]为什么不去死呢？！",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[???,N733]\r[red]为什么不去.......死呢？！",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[小粽,hero]..........................",
        "\t[小粽,hero]..........................",
        {
            "type": "autoSave"
        },
        {
            "type": "choices",
            "text": "\t[小粽,hero].....我..................",
            "choices": [
                {
                    "text": "算了,就这样吧",
                    "action": [
                        {
                            "type": "pauseBgm"
                        },
                        {
                            "type": "sleep",
                            "time": 500
                        },
                        "小粽在迷幻空间里自己选择了死亡，在现实中也意味着死亡。",
                        "几个月后，随着一声巨响，整个世界陷入了黑暗之中......",
                        "这个世界就此消亡",
                        {
                            "type": "sleep",
                            "time": 500
                        },
                        "在未知空间内部。",
                        {
                            "type": "changeFloor",
                            "floorId": ":next",
                            "loc": [
                                111,
                                111
                            ],
                            "time": 0
                        }
                    ]
                },
                {
                    "text": "不！！！",
                    "action": [
                        {
                            "type": "pauseBgm"
                        },
                        {
                            "type": "playBgm",
                            "name": "disorder2.mp3",
                            "keep": true
                        },
                        "\t[小粽,hero]创造一种梦境，并且在其中进行心灵控制。让被控者回忆起之前的或不存在的回忆，使被控者的内心崩溃。",
                        "\t[小粽,hero]这就是你的迷幻空间的奥秘吧！罗天！！",
                        "\t[小粽,hero]看招！天破苍穹！",
                        {
                            "type": "playSound",
                            "name": "VXIce8.ogg"
                        },
                        {
                            "type": "sleep",
                            "time": 150
                        },
                        {
                            "type": "playSound",
                            "name": "VXFire4.ogg"
                        },
                        {
                            "type": "sleep",
                            "time": 90
                        },
                        {
                            "type": "playSound",
                            "name": "VXBreath.ogg"
                        },
                        {
                            "type": "sleep",
                            "time": 90
                        },
                        {
                            "type": "playSound",
                            "name": "spark1.wav"
                        },
                        {
                            "type": "insert",
                            "loc": [
                                12,
                                12
                            ],
                            "floorId": "MT150"
                        }
                    ]
                }
            ]
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,10016,10017,10018,10016,10017,10018,10016,10017,10018,10016,10018, 20],
    [ 20,10016,10017,10018,10016,10017,10018,10016,10017,10018,10016,10018, 20],
    [ 20,10024,10025,10026,10024,10025,10026,10024,10025,10026,10024,10026, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10016],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10016],
    [ 20,  0,  0,10032,  0,10034,727,  0,731,734,  0,  0,10024],
    [ 20,  0,  0,10040,10041,10042,  0,  0,  0,  0,  0,  0,  0],
    [ 20,  0,  0,10048,10049,10050,  0,  0,  0,  0,  0,  0, 20],
    [ 20,10095,  0,  0,  0,  0,  0,  0,  0,  0,  0,10095, 20],
    [ 20,10103,  0,  0,  0,  0,  0,  0,  0,  0,  0,10103, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10006,10007,  0,  0,  0],
    [  0,  0,10163,10111,  0,  0,  0,  0,10014,10015,  0,  0,  0],
    [  0,10115,10107,10071,  0,10104,10105,10104,10172,10171,  0,10095,  0],
    [  0,10114,10114,10079,  0,10112,10113,10112,10180,10179,  0,10103,  0],
    [  0,  0,  0,10087,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,10035,10036,10037,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,10043,10044,10045,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,10051,10052,10053,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,80105,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "color": [
        92,
        92,
        92,
        0.27
    ]
}