main.floors.MT158=
{
    "floorId": "MT158",
    "title": "森林内",
    "name": "森林内",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "slience1.mp3",
            "keep": true
        },
        "\t[罗天,N1251]\b[this,6,7]...........",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ]
        },
        "\t[罗天,N1251]\b[this,6,7]我不是死了吗？！",
        "\t[???,N1199]\b[this,6,10]小家伙，你醒了？",
        "\t[罗天,N1251]\b[this,6,7]请问这里.......",
        "\t[???,N1199]\b[this,6,10]这里是我平时居住的地方。",
        "\t[罗天,N1251]\b[this,6,7]那我为什么.......",
        "\t[???,N1199]\b[this,6,10]呵呵呵，你要报恩就找我那可爱的外孙女吧。",
        "\t[???,N1199]\b[this,6,10]是她把你带到这里的，不然我也救不了你。",
        "\t[罗天,N1251]\b[this,6,7]您的外孙女救了我？可是我不应该早被那个闯入这座魔塔的勇者给杀死了吗？！",
        "\t[???,N1199]\b[this,6,10]这我就不知道了，到时你自己去问吧。",
        "\t[罗天,N1251]\b[this,6,7].........算了，我的妻子早已死去，音律塔也早就被人侵占，我已经没有地方可以去了。",
        "\t[罗天,N1251]\b[this,6,7]就一直留在这里吧。",
        "\t[???,N1199]\b[this,6,10]哦？你要一直在这里居住吗。",
        "\t[罗天,N1251]\b[this,6,7]嗯！这里的环境非常好，而且贴近自然，能使我的内心平静下来。",
        "\t[???,N1199]\b[this,6,10]我那外孙女告诉我你的名号叫音律星尊，你就为我演奏一些曲子吧。",
        "\t[罗天,N1251]\b[this,6,7]好！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "从此罗天就一直待在这里为仙琳的外婆演奏曲子休养生息。",
        "至于复仇吗........未来总有一天一定要去做到的，罗天想着。",
        "不过为什么我没有死呢？难道那个人.........",
        "...........等有时间一定去问一问。",
        {
            "type": "pauseBgm"
        },
        "时间线回到了我们的主角这里",
        "\t[小粽,hero]仙琳，怎么样，那个叫罗天的人没事吧。",
        "\t[仙琳,fairy]嗯！以我外婆的治疗魔法水平，罗天已经没什么大碍了。",
        "\t[小粽,hero]嗯，那就好。",
        "\t[仙琳,fairy]小粽，我之前忘了问了，为什么你要救罗天呀？他之前差点就把你干掉呢。",
        "\t[小粽,hero]因为我听到他口中一直在念叨一个人，似乎这个人对他非常重要。",
        "\t[小粽,hero]而且之前的战斗他所产生的敌意好像是因为我闯入了这座音律塔打破了这里的宁静。",
        "\t[小粽,hero]并且我看到了他内心的善良，所以我想救他。",
        "\t[仙琳,fairy]这样呀........",
        "\t[仙琳,fairy]那我们去找我另一位姐姐吧——造物星尊！",
        "\t[小粽,hero]好！",
        {
            "type": "changeFloor",
            "floorId": "MT159",
            "loc": [
                6,
                11
            ],
            "direction": "up",
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,12": [
            {
                "type": "setBlock",
                "number": "fairy",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 0
            },
            {
                "type": "playBgm",
                "name": "slience1.mp3",
                "keep": true
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[仙琳,fairy]\b[this,6,6]什么事呀？外婆。",
            "\t[???,N1199]\b[this,6,10]小仙琳，你体内拥有极其强大的力量，如果运用得当，甚至可以改变整个世界！",
            "\t[仙琳,fairy]\b[this,6,6]哇！这么厉害？我竟然可以改变整个世界呢！",
            "\t[???,N1199]\b[this,6,10]别高兴得太早，先听外婆说完。",
            "\t[???,N1199]\b[this,6,10]不过这种力量太过霸道，如果你强行使用的话会对你的身体造成极大的危害！",
            "\t[???,N1199]\b[this,6,10]外婆对你体内的力量进行了一些研究，发现到只有待你成人的时候才能够初步掌握这种力量。",
            "\t[仙琳,fairy]\b[this,6,6]啊？要等到成人的时候才能用吗？好久呀.....我现在才十四岁呢。",
            "\t[???,N1199]\b[this,6,10]就算等到成人的时候也就仅仅是初步掌握而已，如果你过于依赖这股力量，就会被这股力量给反噬，严重的话会导致你灰飞烟灭！",
            "\t[仙琳,fairy]\b[this,6,6]这........也太恐怖了吧....",
            "\t[???,N1199]\b[this,6,10]除非你有生命危险，否则你一定不要使用这股力量！",
            "\t[仙琳,fairy]\b[this,6,6]......我知道了。",
            "\t[???,N1199]\b[this,6,10]对了，外婆这次来是打算把你母亲其中的一个遗物给你。",
            "\t[仙琳,fairy]\b[this,6,6]妈妈的遗物吗？",
            "\t[???,N1199]\b[this,6,10]...是",
            "\t[???,N1199]\b[this,6,10]这个东西是你母亲最珍视的东西，是一种定情信物。",
            "\t[???,N1199]\b[this,6,10]未来有一天，若是有人值得你依靠的话，就把这个东西交给他吧。",
            "\t[仙琳,fairy]\b[this,6,6]这样呀.....妈妈当初就是用这个与爸爸定情的吗？",
            "\t[???,N1199]\b[this,6,10]是的,不过现在他们已经..........",
            "\t[???,N1199]\b[this,6,10]算了，我们不提这些伤心事了，都是老黄历了。",
            "\t[???,N1199]\b[this,6,10]总之你一定要记住外婆对你说过的话，千万不用使用你体内的力量。",
            "\t[仙琳,fairy]\b[this,6,6]我知道了.........",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 0
            },
            {
                "type": "changeFloor",
                "floorId": "MT232",
                "loc": [
                    6,
                    8
                ],
                "direction": "up",
                "time": 0
            },
            {
                "type": "insert",
                "loc": [
                    0,
                    0
                ]
            }
        ],
        "0,0": [
            {
                "type": "setBlock",
                "number": "N1197",
                "loc": [
                    [
                        10,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        10
                    ]
                ],
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N587",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[???,N587]\b[this,6,9]不错，小罗天，你学的挺快嘛，演奏的曲子越来越好了。",
            "\t[罗天,N1197]\b[this,10,9]仙月老师过奖了，没有老师的教导我也不可以达到这个水平。",
            "\t[仙月,N587]\b[this,6,9]嗯......那就...",
            {
                "type": "vibrate",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    10,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    9
                ]
            },
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        6,
                        9
                    ]
                ]
            },
            "\t[罗天,N1197]\b[this,10,9]仙月老师！怎么回事？",
            "\t[仙月,N588]\b[this,6,9]..................",
            {
                "type": "move",
                "loc": [
                    6,
                    9
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "up",
                    "up",
                    "up",
                    "up"
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "087-Action02.ogg"
            },
            {
                "type": "animate",
                "name": "buff1",
                "loc": [
                    6,
                    5
                ]
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    5
                ]
            },
            "\t[仙月,N588]\b[this,6,5]这.........这！！！",
            "\t[罗天,N1197]\b[this,10,9]仙月老师？",
            "\t[仙月,N588]\b[this,6,5]..........................................................",
            "\t[仙月,N588]\b[this,6,5]孩子，你还是选择了与你母亲一样的道路了吗？",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "在魔塔顶层处。",
            {
                "type": "changeFloor",
                "floorId": "MT235",
                "loc": [
                    1111,
                    111
                ],
                "direction": "up",
                "time": 0
            },
            {
                "type": "waitAsync"
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [200065,200066,200067,200168,200169,200170,200171,200172,200173,200174,200049,200050,  0],
    [200073,200074,200075,200176,200177,200178,200179,200180,200181,200182,200057,  0,  0],
    [200081,200082,200083,200184,200185,200186,200187,200188,200189,200190,200191,  0,200049],
    [200050,  0,  0,  0,  0,182149,182150,182151,200197,200198,  0,  0,  0],
    [200058,200059,  0,  0,190106,182157,182158,182159,190106,  0,  0,  0,  0],
    [200050,200067,  0,  0,190114,182165,180820,182167,190114,  0,  0,  0,200048],
    [200058,200059,  0,  0,190122,  0,  0,  0,190122,  0,  0,  0,200056],
    [200066,200067,  0,  0,  0,  0,1251,  0,  0,90541,90542,90543,200081],
    [200074,200075,  0,  0,190106,  0,  0,  0,190106,90549,90550,90551,  0],
    [  0,200083,  0,  0,190114,  0,  0,  0,190114,  0,  0,200049,200080],
    [  0,200048,200049,200050,190122,  0,1199,  0,190122,  0,200056,200057,200058],
    [  0,200056,200057,200058,  0,200049,200050,200049,200050,  0,200064,200065,200066],
    [  0,200064,200065,200066,200067,200049,200056,200057,200058,200059,200072,200073,200074]
],
    "bgmap": [
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,200048,  0,200050,200051],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200058,200059],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200066,200067],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200073,200074,200075],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,200080,200081,200082,200083],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180985,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180984,  0,200050],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180985,  0,  0],
    [  0,  0,  0,  0,200059,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,200072,200073,200074,200075,  0,  0,  0,  0,200064,200069,200070],
    [  0,  0,200080,200081,200082,200083,  0,  0,  0,200056,200072,200077,200078],
    [200049,200050,  0,  0,  0,  0,  0,  0,  0,200064,200065,200085,200086],
    [200057,200058,200059,  0,200193,200194,200195,200196,  0,200072,  0,200056,200057],
    [200065,200066,200067,  0,  0,  0,  0,  0,  0,  0,  0,200064,200065],
    [200066,200074,200075,  0,  0,  0,182166,  0,  0,  0,  0,200072,200073],
    [  0,200082,200083,  0,182152,182153,182154,182155,182156,  0,  0,200080,200081],
    [  0,  0,  0,  0,182160,182161,182162,182163,182164,  0,  0,  0,  0],
    [200049,200050,  0,  0,182168,182169,182170,182171,182172,  0,  0,  0,  0],
    [200057,200058,200059,  0,182176,182177,182178,182179,182180,  0,  0,  0,  0],
    [200069,200070,200055,  0,182184,182185,182186,182187,182188,  0,  0,  0,  0],
    [200077,200078,200079,  0,  0,  0,  0,  0,  0,  0,200049,  0,  0],
    [200085,200086,200087,  0,200068,200077,200078,200079,  0,200060,200057,200058,  0]
],
    "fg2map": [

]
}