main.floors.MT15=
{
    "floorId": "MT15",
    "title": "未知地带",
    "name": "未知地带",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "holy3.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 1,
    "defaultGround": "blockWall",
    "firstArrive": [
        {
            "type": "setWeather",
            "name": "rain",
            "level": 10
        },
        {
            "type": "setBlock",
            "number": "N832",
            "loc": [
                [
                    6,
                    11
                ]
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "holy1.mp3",
            "keep": true
        },
        "\t[???,N832]\b[this,6,11]大人，已经有人类进入这座高塔了。",
        "\t[???,N832]\b[this,6,11]并且就在刚才第一区域的安兹乌洛斯也已被那个人类斩杀。",
        {
            "type": "sleep",
            "time": 2000,
            "noSkip": true
        },
        "\t[???,N1415]\b[this,6,2]......嗯，是时候启动\\d\r[red]【】计划了！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 300,
            "noSkip": true
        },
        "\t[???,N832]\b[this,6,11]是！",
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "setBlock",
            "number": "X60025",
            "loc": [
                [
                    6,
                    11
                ]
            ]
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "sleep",
            "time": 1000,
            "noSkip": true
        },
        "\t[???,N961]\b[this,6,2]宿命的时针终究流淌于时间长河，而人们却总是在探寻真理的道路上漫步。",
        "\t[???,N961]\b[this,6,2]但是......无论你们未来能做出什么，都只会在既定的道路上徘徊。",
        "\t[???,N961]\b[this,6,2]因为......我已经看到了你们的过去，现在，以及未来！",
        "\t[???,N961]\b[this,6,2]数年来的沉积，将会在这一刻，迸发出令人痴迷与疯狂的光辉。",
        "\t[???,N961]\b[this,6,2]哈哈哈哈哈哈哈哈！！！",
        {
            "type": "vibrate",
            "time": 2000
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "setValue",
            "name": "flag:boss战进度1",
            "value": "1"
        },
        {
            "type": "changeFloor",
            "floorId": "MT14",
            "loc": [
                6,
                5
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500,
            "noSkip": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "setWeather"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60016,60024,60018,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60024,1415,60026,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60032,60033,60034,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60040,60041,60042,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,60016,60025,60025,60025,60018,  0,  0,  0,  0],
    [  0,  0,  0,60016,60025,60025,60025,60025,60025,60018,  0,  0,  0],
    [  0,  0,60016,60025,60025,60025,60025,60025,60025,60025,60018,  0,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,60025,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "weather": [
        "rain",
        10
    ],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,60025,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}