main.floors.MT150=
{
    "floorId": "MT150",
    "title": "音律塔顶层",
    "name": "音律塔顶层",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "bgm": "battle9.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "battle9.mp3",
            "keep": true
        },
        "\t[罗天,E574]\b[this,6,5]................",
        "\t[罗天,E574]\b[this,6,5]洛兰，你知道吗？自从你离开我以后，原来的罗天早已死去了。",
        "\t[罗天,E574]\b[this,6,5]为了防止你的灵魂被人打扰和玷污，我特意修建了这座音律塔。",
        "\t[罗天,E574]\b[this,6,5]用那婉转的音律安抚你的灵魂。",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        "\t[罗天,E574]\b[this,6,5]不过呢.....总有些俗人打破这短暂的宁静呢！",
        {
            "type": "move",
            "loc": [
                6,
                5
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "left",
                "down",
                "down",
                "right"
            ]
        },
        {
            "type": "turnBlock",
            "direction": ":back",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "floorId": "MT150"
        },
        {
            "type": "waitAsync"
        },
        "\t[小粽,hero]\b[hero]你就是音律星尊——罗天吧？！",
        "\t[罗天,E571]\b[this,6,7]是与不是，跟你并没有什么关系。",
        "\t[罗天,E571]\b[this,6,7]洛柔那个小丫头告诉我，有人闯入了这座音律塔，并且打破了这里的宁静。",
        "\t[罗天,E571]\b[this,6,7]对于你这种人，魂飞魄散是你唯一的选择！",
        "\t[小粽,hero]\b[hero]看来是无法继续交流了....",
        "\t[罗天,E571]\b[this,6,7]音律一——心灵冲击！",
        {
            "type": "playSound",
            "name": "115-Raise01.ogg"
        },
        {
            "type": "animate",
            "name": "attack20",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "154-Support12.ogg"
        },
        {
            "type": "animate",
            "name": "defend2",
            "loc": "hero"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[罗天,E571]\b[this,6,7]嗯？没有什么效果？！难道你.....",
        "\t[小粽,hero]\b[hero]破穹！",
        {
            "type": "playSound",
            "name": "MSLASH.ogg"
        },
        {
            "type": "animate",
            "name": "attack8",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "move",
            "loc": [
                6,
                7
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "backward"
            ]
        },
        "\t[罗天,E571]\b[this,6,7]......原来如此！",
        {
            "type": "move",
            "loc": [
                6,
                6
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "forward"
            ]
        },
        "\t[罗天,E571]\b[this,6,7]没想到堇和泰帝都被你给击败了！看来之前是我小看你了。",
        "\t[罗天,E571]\b[this,6,7]......那么！音律二——心灵之刺！",
        {
            "type": "playSound",
            "name": "115-Raise01.ogg"
        },
        {
            "type": "animate",
            "name": "attack20",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXSand.ogg"
        },
        {
            "type": "sleep",
            "time": 10
        },
        {
            "type": "playSound",
            "name": "Annihilation2.wav"
        },
        {
            "type": "animate",
            "name": "attack16",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "154-Support12.ogg"
        },
        {
            "type": "animate",
            "name": "defend2",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]（唔！还是受了点内伤吗。）",
        "\t[罗天,E571]\b[this,6,7]好家伙，音律二级别的技能都对你没什么影响，看来我得.....",
        "\t[罗天,E571]\b[this,6,7]音律三........",
        "\t[小粽,hero]\b[hero]不能让他继续施法了，得速战速决！",
        {
            "type": "setBlock",
            "number": "E571",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,7": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[罗天,E571]\b[this,6,7]心灵震爆！",
                {
                    "type": "battle",
                    "id": "E571"
                },
                {
                    "type": "sleep",
                    "time": 100
                },
                {
                    "type": "setBlock",
                    "number": "N770",
                    "time": 0
                },
                "\t[罗天,E571]\b[this,6,7]唔咳咳咳！！不可能！你怎么可能抵挡的住我第三重音律！",
                "\t[小粽,hero]\b[hero]咳咳咳！不愧是音律星尊，没想到居然如此难缠！",
                "\t[小粽,hero]\b[hero]不过还是我更胜一筹呢.......",
                "\t[罗天,E571]\b[this,6,7]不可能！不可能！我决不会让一个肮脏的人类打破这里的宁静！！",
                "\t[罗天,E571]\b[this,6,7]就算这招会极大的消耗我的生命，我也要将你击毙于此！！",
                "\t[罗天,E571]\b[this,6,7]终曲！迷幻空间！！",
                "\t[小粽,hero]\b[hero]不好！这是！！",
                "\t[罗天,E571]\b[this,6,7]在迷幻空间内沉沦吧！！",
                {
                    "type": "setCurtain",
                    "color": [
                        255,
                        255,
                        255,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "playBgm",
                    "name": "battle9.mp3",
                    "keep": true
                },
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                "在罗天使出迷幻空间之后,小粽陷入了迷幻空间之中.........",
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "hideStatusBar"
                },
                {
                    "type": "changeFloor",
                    "floorId": ":next",
                    "loc": [
                        0,
                        8
                    ],
                    "direction": "right",
                    "time": 0
                }
            ]
        },
        "12,12": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                {
                    "type": "changeFloor",
                    "floorId": "MT150",
                    "loc": [
                        6,
                        9
                    ],
                    "direction": "up",
                    "time": 0
                },
                {
                    "type": "setBlock",
                    "number": "N770",
                    "loc": [
                        [
                            6,
                            7
                        ]
                    ],
                    "floorId": "MT150",
                    "time": 0
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[罗天,E571]\b[this,6,7]不可能！为什么迷幻空间都无法阻止你？？！",
                "\t[罗天,E571]\b[this,6,7]你究竟是何方神圣？！为什么你能打破我的迷幻空间？",
                "\t[小粽,hero]\b[hero]我并不是什么伟大的人，我只是在面临生死选择的时候想起的自己的未来自己的目的。",
                "\t[小粽,hero]\b[hero]保持灵台清明，不被你的迷幻空间所迷惑。",
                "\t[罗天,E571]\b[this,6,7]就这？？！随便脑子一想理想和未来就可以打破我的空间？！",
                "\t[罗天,E571]\b[this,6,7]假的！都是假的！！",
                "\t[小粽,hero]\b[hero]你输了。",
                "\t[罗天,E571]\b[this,6,7]不！我还没有输！我!",
                "\t[罗天,E571]\b[this,6,7]洛兰，为了你！我绝对不会放弃！哪怕是付出生命！",
                {
                    "type": "vibrate",
                    "time": 500
                },
                "\t[罗天,E571]\b[this,6,7]终曲！迷....",
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "animate",
                    "name": "attack9",
                    "loc": [
                        6,
                        7
                    ],
                    "async": true
                },
                {
                    "type": "playSound",
                    "name": "Attack09.wav"
                },
                {
                    "type": "screenFlash",
                    "color": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "times": 1
                },
                {
                    "type": "sleep",
                    "time": 200
                },
                {
                    "type": "playSound",
                    "name": "Blow4.ogg"
                },
                {
                    "type": "playBgm",
                    "name": "Eternity1.mp3",
                    "keep": true
                },
                "小粽的利剑刺入了罗天的胸膛",
                "\t[罗天,E571]\b[this,6,7]噗！！",
                "\t[小粽,hero]\b[hero].......................",
                "\t[罗天,E571]\b[this,6,7]我要死了吗？",
                "\t[罗天,E571]\b[this,6,7]我好想继续待在这座音律塔，每天为你演奏钢琴曲呢.....",
                "\t[小粽,hero]\b[hero].......................",
                "\t[罗天,E571]\b[this,6,7]洛兰，等着我，到了地狱我还为你每天演奏钢琴曲。",
                "\t[罗天,E571]\b[this,6,7]哈哈哈哈哈哈哈哈.......................",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                "随着一声沉重的巨响，罗天的身体缓缓的倒在了地面。",
                "一代星尊为了保护其珍视的事物，倒在了自己的音律塔之中.........",
                {
                    "type": "sleep",
                    "time": 500
                },
                "时间回到七年前。",
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "playBgm",
                    "name": "memory2.mp3",
                    "keep": true
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT154",
                    "loc": [
                        121,
                        112
                    ],
                    "direction": "up",
                    "time": 0
                }
            ]
        }
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [150,150,150,150,150,150,150,150,150,150,150,150,150],
    [150,150,150,150,  0,  0,  0,  0,  0,150,150,150,150],
    [150,150,150,  0,  0,  0,  0,  0,  0,  0,150,150,150],
    [150,150,  0,  0,  0,  0,  0,  0,  0,  0,  0,150,150],
    [150,  0,  0,  0,  0,10168,10169,10170,  0,  0,  0,  0,150],
    [150,  0,  0,  0,  0,10176,773,10178,  0,  0,  0,  0,150],
    [150,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150],
    [150,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,150],
    [150,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,150],
    [150,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,150],
    [150,150,  0,  0,  0, 17,  0, 17,  0,  0,  0,150,150],
    [150,150,150,  0,  0, 17,  0, 17,  0,  0,150,150,150],
    [150,150,150,150,150,150,  0,150,150,150,150,150,150]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,154,154,154,154,154,  0,  0,  0,  0],
    [  0,  0,  0,154,154,154,154,154,154,154,  0,  0,  0],
    [  0,  0,154,154,154,154,154,154,154,154,154,  0,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,  0,154,154,154,154,154,154,154,154,154,  0,  0],
    [  0,  0,  0,154,154,154,154,154,154,154,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,154,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,70157,70158,70159,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,70165,70166,70167,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,70173,70174,70175,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,70181,70182,70183,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,70078,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,70086,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,10177,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,210360,  0,  0]
],
    "fg2map": [

]
}