main.floors.MT156=
{
    "floorId": "MT156",
    "title": "野外",
    "name": "野外",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "bgm": null,
    "firstArrive": [
        {
            "type": "setCurtain",
            "color": [
                15,
                15,
                15,
                0.4
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "move",
            "loc": [
                9,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "left",
                "up",
                "left",
                "left",
                "up",
                "up",
                "left",
                "left",
                "up"
            ]
        },
        "\t[罗天,N773]\b[this,4,7]差不多都解决了。",
        "\t[罗天,N773]\b[this,4,7]现在就差去汇报了。",
        "\t[罗天,N773]\b[this,4,7]只要完成了任务洛兰就能回来了！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                4,
                4
            ]
        },
        {
            "type": "setBlock",
            "number": "N783",
            "loc": [
                [
                    4,
                    4
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                7
            ]
        },
        "\t[罗天,N773]\b[this,4,7]嗯？请问你是........",
        "\t[???,N783]\b[this,4,4]杀！",
        "\t[罗天,N773]\b[this,4,7]！",
        {
            "type": "move",
            "loc": [
                4,
                4
            ],
            "time": 10,
            "keep": true,
            "steps": [
                "down",
                "down"
            ]
        },
        {
            "type": "playSound",
            "name": "115-Raise01.ogg"
        },
        {
            "type": "animate",
            "name": "attack20",
            "loc": [
                4,
                6
            ]
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                4,
                6
            ]
        },
        {
            "type": "move",
            "loc": [
                4,
                7
            ],
            "time": 50,
            "keep": true,
            "steps": [
                "backward",
                "backward"
            ]
        },
        "\t[罗天,N773]\b[this,4,9]火焰魔法？",
        "\t[???,N783]\b[this,4,6]哼！",
        {
            "type": "playSound",
            "name": "VXSand.ogg"
        },
        {
            "type": "playSound",
            "name": "Annihilation2.wav"
        },
        {
            "type": "animate",
            "name": "attack16",
            "loc": [
                4,
                9
            ]
        },
        {
            "type": "playSound",
            "name": "115-Raise01.ogg"
        },
        {
            "type": "animate",
            "name": "attack20",
            "loc": [
                4,
                6
            ]
        },
        "\t[罗天,N773]\b[this,4,9]........这招数....",
        "\t[罗天,N773]\b[this,4,9]不.....不可能......怎么会呢？！",
        "\t[???,N783]\b[this,4,6]受死吧！",
        "\t[罗天,N773]\b[this,4,6]不好！硬接这招会死的！！",
        {
            "type": "animate",
            "name": "attack17",
            "loc": [
                4,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "115-Raise01.ogg"
        },
        {
            "type": "playSound",
            "name": "VXIce8.ogg"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "115-Raise01.ogg"
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "VXBreath.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "spark1.wav"
        },
        {
            "type": "animate",
            "name": "attack20",
            "loc": [
                4,
                6
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "attack20",
            "loc": [
                4,
                6
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "setCurtain",
            "color": [
                15,
                15,
                15,
                0.4
            ],
            "time": 500,
            "keep": true
        },
        "\t[罗天,N773]\b[this,4,9]呼......看来是我赢了呢！",
        "\t[罗天,N773]\b[this,4,9]你究竟是谁？为什么要刺杀我！",
        "\t[???,N783]\b[this,4,6].................",
        "\t[罗天,N773]\b[this,4,9]看来你已经没力气说话了",
        "\t[罗天,N773]\b[this,4,9]就让我看看你的真实面目！",
        {
            "type": "move",
            "loc": [
                4,
                9
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up"
            ]
        },
        "罗天揭下了这位刺杀者的面具",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "N1251",
            "loc": [
                [
                    4,
                    7
                ]
            ],
            "floorId": "MT156",
            "time": 0
        },
        {
            "type": "setBlock",
            "number": "N1420",
            "loc": [
                [
                    4,
                    6
                ]
            ],
            "floorId": "MT156",
            "time": 0
        },
        {
            "type": "playBgm",
            "name": "Eternity1.mp3",
            "keep": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                7
            ]
        },
        "罗天的双眼急速紧缩，那拿着面具的手在微微颤抖。",
        "\t[罗天,N1251]\b[this,4,7]................洛..........洛兰？！！！",
        "\t[罗天,N1251]\b[this,4,7]是.....是你吗？洛兰？！",
        "\t[洛兰,N1420]\b[this,4,6].................................",
        "\t[罗天,N1251]\b[this,4,7]为什么！为什么你要来刺杀我？！",
        "\t[罗天,N1251]\b[this,4,7]为什么呀！！！！！",
        "\t[洛兰,N1420]\b[this,4,6]执行命令，杀死画像中的人！",
        "\t[罗天,N1251]\b[this,4,7]洛兰！！！！",
        {
            "type": "vibrate",
            "time": 500
        },
        {
            "type": "animate",
            "name": "attack9",
            "loc": [
                4,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "Attack09.wav"
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "Blow4.ogg"
        },
        "\t[罗天,N1251]\b[this,4,7]噗！！！",
        "\t[洛兰,N1420]\b[this,4,6]执行命令，杀死画像中的人！",
        "\t[罗天,N1251]\b[this,4,7]洛兰！我是罗天呀！你难道真的忘记我了吗？！",
        "\t[洛兰,N1420]\b[this,4,6]执行命令，杀死画像中的人！",
        {
            "type": "animate",
            "name": "attack9",
            "loc": [
                4,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "Attack09.wav"
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "Blow4.ogg"
        },
        "\t[罗天,N1251]\b[this,4,7]呃！咳咳咳！！",
        "\t[罗天,N1251]\b[this,4,7]洛兰！你忘记了我们过往的一切了吗？",
        "\t[罗天,N1251]\b[this,4,7]你忘记了我们之前提前预定的婚礼了吗？！",
        "\t[洛兰,N1420]\b[this,4,6]............................",
        "\t[罗天,N1251]\b[this,4,7]洛兰！醒过来！！",
        {
            "type": "playSound",
            "name": "aid1.ogg"
        },
        {
            "type": "animate",
            "name": "aid1",
            "loc": [
                4,
                6
            ]
        },
        {
            "type": "playSound",
            "name": "aid1.ogg"
        },
        {
            "type": "animate",
            "name": "aid1",
            "loc": [
                4,
                6
            ]
        },
        {
            "type": "playSound",
            "name": "111-Heal07.ogg"
        },
        {
            "type": "animate",
            "name": "aid2",
            "loc": [
                4,
                6
            ]
        },
        {
            "type": "playSound",
            "name": "111-Heal07.ogg"
        },
        {
            "type": "animate",
            "name": "aid2",
            "loc": [
                4,
                6
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[洛兰,N1420]\b[this,4,6].......我这是.....在哪？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                7
            ]
        },
        "\t[罗天,N1251]\b[this,4,7]洛兰！你清醒过来了？！",
        "\t[洛兰,N1420]\b[this,4,6]罗.....罗天？！！",
        "\t[洛兰,N1420]\b[this,4,6]是....是你吗？罗天？！！",
        "\t[罗天,N1251]\b[this,4,7]是我，我就是你的罗天啊！！",
        "\t[洛兰,N1420]\b[this,4,6]我...........",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[洛兰,N1420]\b[this,4,6]我的头！我的头好痛！！",
        "\t[罗天,N1251]\b[this,4,7]洛兰！你怎么了！",
        "\t[洛兰,N1420]\b[this,4,6]我好像被人强行灌输了一道指令，那就是.....",
        "\t[洛兰,N1420]\b[this,4,6]杀死画像中的人！",
        {
            "type": "animate",
            "name": "attack9",
            "loc": [
                4,
                7
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "Attack09.wav"
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "Blow4.ogg"
        },
        "\t[罗天,N1251]\b[this,4,7]洛兰！！！！！",
        "\t[洛兰,N1420]\b[this,4,6]执行命令，杀死画像中的人！",
        "\t[洛兰,N779]\b[this,4,6]不...我不能！！",
        "\t[罗天,N1251]\b[this,4,7]洛兰？",
        "\t[洛兰,N779]\b[this,4,6]罗天！快！快杀了我，我要压制不住了！！",
        "\t[罗天,N1251]\b[this,4,7]不！洛兰，我不能杀你！",
        "\t[罗天,N1251]\b[this,4,7]我再也不希望我的爱人离我而去了！！！",
        "\t[洛兰,N1420]\b[this,4,6]执行命令，杀死画像中的人！",
        "\t[罗天,N1251]\b[this,4,7].......看来这就是命运吧,是命运阻止我们二人相爱",
        "\t[罗天,N1251]\b[this,4,7]洛兰，杀了我吧，让我活在你的心里吧。",
        {
            "type": "animate",
            "name": "attack9",
            "loc": [
                4,
                6
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "Attack09.wav"
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "Blow4.ogg"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "GG1.mp3",
            "keep": true
        },
        "\t[罗天,N1251]\b[this,4,7]洛兰！！！！！！",
        "洛兰用自己的利剑刺破了自己的胸膛。",
        "\t[洛兰,N1420]\b[this,4,6]罗天，对不起，洛兰以后.......再也不能.........听你演奏..........钢琴曲了。",
        "\t[罗天,N1251]\b[this,4,7]为什么！为什么你要自杀啊！！",
        "\t[洛兰,N1420]\b[this,4,6]罗天，从你说出.........让你.....活在......我心里的时候，我就知道....我洛兰.......只属于你........唯一的妻子。",
        "\t[罗天,N1251]\b[this,4,7]不应该是这样的！不应该是这样的啊！！",
        "\t[洛兰,N1420]\b[this,4,6]我也希望.......能够......陪在你........身边，可是我不能...我不能。",
        "\t[洛兰,N1420]\b[this,4,6]咳咳咳咳咳！！",
        "\t[洛兰,N1420]\b[this,4,6]我的身体..........已经被.......圣羽洛斯给.....玷污了，我怎么能....让我.....这早已......玷污了的......身体.......来污染......你呢。",
        "\t[罗天,N1251]\b[this,4,7]我不在意！不在意！我只希望你能活着！！",
        "\t[洛兰,N1420]\b[this,4,6]咳咳咳咳咳！！！罗天，我要.......离开了，在未来.......如果你......想我的话,就演奏....我最......喜欢的.......曲子吧。",
        "\t[洛兰,N1420]\b[this,4,6]别了，你若......安好,便......是.....晴.....天。",
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    6
                ]
            ],
            "remove": true
        },
        "洛兰的身体缓缓倒在了地上。",
        "\t[罗天,N1251]\b[this,4,7]洛兰？！",
        "\t[罗天,N1251]\b[this,4,7]洛兰！！洛兰！！！",
        "\t[罗天,N1251]\b[this,4,7]洛兰你醒醒！！你给我的愿望我还没实现呢！！！",
        "\t[罗天,N1251]\b[this,4,7]不要离开我！不要离开我啊！！！！",
        "然而再悲伤的哀鸣也换不回对方回音，\n剩下的只有怀中逐渐冰冷的尸体……",
        "\t[罗天,N1251]\b[this,4,7]呜呜呜.............为什么！为什么啊！！！！！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "罗天由于极度悲伤，昏迷在这条诉说了二人相爱却无法在一起的道路上.......................",
        {
            "type": "pauseBgm"
        },
        "与此同时,在未知地带。",
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        "\t[圣羽洛斯].....有趣，没想到情感这种东西居然能够打破我洗脑术的控制。",
        "\t[圣羽洛斯]看来在以后的研究中得多注意一下情感。",
        "\t[圣羽洛斯]洛兰，罗天，你们的死会为我创造出新的研究成果。",
        "\t[圣羽洛斯]至少！你们的死是有价值的，你们说是不是呢！哈哈哈哈哈哈哈哈！！！！！！",
        {
            "type": "pauseBgm"
        },
        "不知过了多久。",
        {
            "type": "changeFloor",
            "floorId": "MT157",
            "loc": [
                122,
                1
            ],
            "time": 0
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [200065,200066,200067,  0,200064,200065,  0,  0,  0,  0,  0,  0,  0],
    [200073,200074,200075,  0,200072,200073,200074,  0,  0,  0,  0,  0,  0],
    [200056,200082,200083,  0,200080,200081,200082,200081,  0,  0,  0,  0,  0],
    [200066,200067,  0,  0,  0,  0,200081,200049,200050,  0,  0,  0,  0],
    [200074,200075,200050,  0,  0,  0,200056,200057,200058,200059,  0,  0,  0],
    [200056,200057,200058,200059,  0,  0,200064,200065,200066,200067,  0,  0,  0],
    [200064,200065,200066,200067,  0,  0,200072,200073,200074,200075,200066,200067,  0],
    [200072,200073,200074,200075,  0,  0,200080,200081,200082,200073,200074,200073,200074],
    [200056,200057,200058,200059,  0,  0,  0,  0,200080,200081,200082,200081,200082],
    [  0,200065,200058,200067,200050,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,200057,200058,200059,  0,  0,  0,  0,  0,200049,200050],
    [  0,  0,  0,  0,  0,200067,  0,  0,  0,  0,200056,200057,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,773,200064,200065,  0]
],
    "bgmap": [
    [301,301,146,146,146,301,301,301,301,301,301,301,301],
    [301,301,146,146,146,301,301,301,301,301,301,301,301],
    [200000,301,146,146,146,301,301,301,301,301,301,301,301],
    [301,301,146,146,146,301,301,301,301,301,301,301,301],
    [301,301,146,146,146,146,301,301,301,301,301,301,301],
    [301,301,146,146,146,146,146,301,301,301,301,301,301],
    [301,301,301,146,146,146,146,301,301,301,301,301,301],
    [301,301,301,301,146,146,146,146,301,301,301,301,301],
    [301,301,301,301,146,146,146,146,146,301,301,301,301],
    [301,301,301,301,301,146,146,146,146,146,146,301,301],
    [301,301,301,301,301,301,146,146,146,146,146,146,301],
    [301,301,301,301,301,301,301,301,146,146,146,146,301],
    [301,301,301,301,301,301,301,301,301,146,146,146,301]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [200058,200059,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,200049,  0,  0,  0,  0,  0,  0,  0,200049,200050,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,200056,200057,200058,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,200064,200065,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,200072,200073,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,200056,200057,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,200064,200065,200066,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,200072,200073,200074,200075,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,200082,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [200059,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,200049,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200056,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200064,200065,200066,200059,200049,200050,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,200066,200067,200057,200058,200059,  0,  0,  0,  0]
],
    "fg2map": [
    [145,145,  0,  0,  0,145,145,145,145,145,145,145,145],
    [145,145,  0,  0,  0,  0,145,145,145,145,145,145,145],
    [145,  0,  0,  0,  0,  0,  0,145,145,145,145,145,145],
    [145,  0,  0,  0,  0,  0,  0,  0,145,145,145,145,145],
    [145,  0,  0,  0,  0,  0,  0,  0,  0,145,145,145,145],
    [145,145,  0,  0,  0,  0,  0,  0,  0,  0,145,145,145],
    [145,145,  0,  0,  0,  0,  0,  0,  0,  0,145,145,145],
    [145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,145,145],
    [145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,  0,145],
    [145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,  0,145],
    [145,145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,145],
    [145,145,145,145,145,  0,  0,  0,  0,  0,  0,145,145],
    [145,145,145,145,145,145,145,  0,  0,  0,145,145,145]
],
    "color": [
        15,
        15,
        15,
        0.4
    ]
}