main.floors.MT154=
{
    "floorId": "MT154",
    "title": "罗天的家",
    "name": "罗天的家",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "bgm": "memory1.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "floorId": "MT150",
            "remove": true,
            "time": 0
        },
        {
            "type": "function",
            "function": "function(){\ncore.removeMaps( \"MT150\")\n}"
        },
        "\t[???,N1418]\b[this,2,9].........",
        "\t[???,N1418]\b[this,2,9]啊啊！好无聊呀！罗天那个混蛋怎么还不回家呀。",
        "\t[???,N1418]\b[this,2,9]说什么外面找些东西，结果现在都不回家。",
        "\t[???,N1418]\b[this,2,9]啊啊啊！！罗天你这混蛋要是再不回家我就离家出走！",
        "\t[???]是谁要离家出走呀？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                2,
                9
            ]
        },
        {
            "type": "setBlock",
            "number": "N1420",
            "loc": [
                [
                    2,
                    9
                ]
            ],
            "time": 0
        },
        {
            "type": "setBlock",
            "number": "N773",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 0
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1418",
            "loc": [
                [
                    2,
                    9
                ]
            ],
            "time": 0
        },
        {
            "type": "setBlock",
            "number": "N1419",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "time": 0
        },
        "\t[???,N1418]\b[this,2,9]你..你个死鬼，你知道你不在家的时候我有多想你吗？",
        "\t[罗天,N1419]\b[this,6,9]哎！别哭呀，洛兰，我不就是去外面查阅了下书籍吗？",
        "\t[洛兰,N1418]\b[this,2,9]我不听！我不听！反正你就会欺负我！",
        {
            "type": "playSound",
            "name": "Raise1.ogg"
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": [
                6,
                9
            ]
        },
        "\t[罗天,N1419]\b[this,6,9]别闹了，要是真打起来，我还打不过你呢。",
        "\t[罗天,N1419]\b[this,6,9]要不这样，你随便提个愿望，只要是我能做的，我都满足你。",
        "\t[洛兰,N1418]\b[this,2,9]真的吗？",
        "\t[罗天,N1419]\b[this,6,9]真的！",
        "\t[洛兰,N1418]\b[this,2,9]好呀！那你就一直在我身边，这总可以吧。",
        "\t[罗天,N1419]\b[this,6,9]好。",
        "\t[洛兰,N781]\b[this,2,9]嘻嘻，这才对呀！",
        "\t[罗天,N1419]\b[this,6,9]我最近又学了一部新的钢琴曲，你要不要听我演奏呢？",
        "\t[洛兰,N1418]\b[this,2,9]好呀好呀！",
        "\t[罗天,N1419]\b[this,6,9]那我们上楼吧。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": "MT155",
            "loc": [
                2,
                22
            ],
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,12": [
            {
                "type": "changeFloor",
                "floorId": "MT154",
                "loc": [
                    22,
                    22
                ],
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N1418",
                "loc": [
                    [
                        2,
                        9
                    ]
                ],
                "floorId": "MT154",
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N771",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "floorId": "MT154",
                "time": 0
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[洛兰,N1418]\b[this,2,9]罗天,你要参加星尊竞争赛吗？",
            "\t[罗天,N1419]\b[this,6,9]嗯！只要我成为了星尊，我们就可以换一个大房子住了。",
            "\t[洛兰,N1418]\b[this,2,9]会不会有危险呀？",
            "\t[罗天,N1419]\b[this,6,9]没事的，你不相信我的实力吗？",
            "\t[洛兰,N1418]\b[this,2,9]但我还是.......",
            "\t[罗天,N1419]\b[this,6,9]放心吧！我一定会成功的。",
            "\t[罗天,N1419]\b[this,6,9]不过这次的比赛规则有些变动，时间变长了，而且我最近不能回家了。",
            "\t[罗天,N1419]\b[this,6,9]你不会不高兴吧。",
            "\t[洛兰,N1418]\b[this,2,9]（摇了摇头）没关系的，我只要你平安就好。",
            "\t[罗天,N1419]\b[this,6,9]嗯！等我担任星尊回来的时候，就娶你。",
            "洛兰的俏脸突然变得通红。",
            "\t[洛兰,N1418]\b[this,2,9]讨...讨厌呢，你在说些什么呢。",
            "\t[罗天,N1419]\b[this,6,9]哈哈，我走了，要好好照护自己哟。",
            "\t[洛兰,N1418]\b[this,2,9].....嗯！",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "罗天告别了洛兰，参加了星尊选拔。",
            "以罗天的实力顺利的取得了星尊之位，自称为音律星尊。",
            "罗天和其他三位星尊分别获得了自己的身份牌，,并且分发身份牌的人告诉他们，身份牌对他们来说至关重要，是绝对不能丢弃的",
            "罗天在拿到身份牌后立刻回到了自己的家，要把这个好消息告诉洛兰。",
            {
                "type": "pauseBgm"
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "hide",
                "loc": [
                    [
                        2,
                        9
                    ]
                ],
                "floorId": "MT154",
                "remove": true,
                "time": 0
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "floorId": "MT154",
                "remove": true,
                "time": 0
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "setBlock",
                "number": "N773",
                "loc": [
                    [
                        6,
                        12
                    ]
                ],
                "floorId": "MT154",
                "time": 50
            },
            "\t[罗天,N1419]\b[this,6,12]洛兰！你知道吗？我！......",
            {
                "type": "move",
                "loc": [
                    6,
                    12
                ],
                "time": 200,
                "keep": true,
                "steps": [
                    "up",
                    "up",
                    "up"
                ]
            },
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unknown",
                "loc": [
                    6,
                    9
                ]
            },
            "\t[罗天,N1419]\b[this,6,9]洛兰?",
            {
                "type": "move",
                "loc": [
                    6,
                    9
                ],
                "time": 100,
                "keep": true,
                "steps": [
                    "up",
                    "up",
                    "up"
                ]
            },
            {
                "type": "turnBlock",
                "direction": "left",
                "loc": [
                    [
                        6,
                        6
                    ]
                ]
            },
            {
                "type": "sleep",
                "time": 200
            },
            {
                "type": "turnBlock",
                "direction": "right",
                "loc": [
                    [
                        6,
                        6
                    ]
                ]
            },
            {
                "type": "sleep",
                "time": 200
            },
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        6,
                        6
                    ]
                ]
            },
            {
                "type": "sleep",
                "time": 200
            },
            "\t[罗天,N1419]\b[this,6,6]洛兰？",
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unknown",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[罗天,N1419]\b[this,6,6]奇怪？洛兰呢？",
            "\t[罗天,N1419]\b[this,6,6]她平时都是大门不出，二门不迈的，她到底去哪了？",
            "\t[???]音律星尊在家吗？",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        6,
                        6
                    ]
                ]
            },
            {
                "type": "playBgm",
                "name": "holy2.mp3",
                "keep": true
            },
            "\t[罗天,N1251]\b[this,6,6]谁？进来。",
            {
                "type": "setBlock",
                "number": "N1251",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N740",
                "loc": [
                    [
                        6,
                        12
                    ]
                ],
                "floorId": "MT154",
                "time": 50
            },
            {
                "type": "move",
                "loc": [
                    6,
                    12
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "up",
                    "up",
                    "up"
                ]
            },
            {
                "type": "setBlock",
                "number": "N1389",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[罗天,N1251]\b[this,6,6](这身打扮........是阴阳圣坛圣护之手级别的人物吗？)",
            "\t[罗天,N1251]\b[this,6,6]属下罗天恭迎圣护之手大人。",
            "\t[圣护之手,N1389]\b[this,6,9]不必多礼，我就是个传信的。",
            "\t[圣护之手,N1389]\b[this,6,9]音律星尊，我来这是是传达一个消息的。",
            "\t[罗天,N1251]\b[this,6,6]圣护之手大人有什么消息要告诉属下？",
            "\t[圣护之手,N1389]\b[this,6,9]我要说的关于的你朋友洛兰。",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[罗天,N1251]\b[this,6,6]圣护之手大人，你知道洛兰现在在哪里吗？",
            "\t[圣护之手,N1389]\b[this,6,9]几天前，你的那位朋友被圣羽洛斯大人带走了，并且跟随圣羽洛斯大人完成任务去了。",
            "\t[罗天,N1251]\b[this,6,6]什么？！那她什么时候能够回来呢？",
            "\t[圣护之手,N1389]\b[this,6,9]不知道，可能要好久吧。",
            "\t[罗天,N1251]\b[this,6,6]这......不过为什么圣羽洛斯大人之前不跟属下说呢？",
            "\t[圣护之手,N1389]\b[this,6,9]哼！音律星尊，注意你说话的语气！！",
            "\t[圣护之手,N1389]\b[this,6,9]圣羽洛斯大人乃是魔塔最高势力三圣阁的阁主，他想要干什么还需要经过你的允许吗？！！",
            "\t[罗天,N1251]\b[this,6,6].............................是属下冒犯了。",
            "\t[圣护之手,N1389]\b[this,6,9]你不必担心，反正到时会把你朋友给送来的。",
            {
                "type": "setBlock",
                "number": "N740",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "move",
                "loc": [
                    6,
                    9
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "down"
                ]
            },
            "\t[圣护之手,N1389]\b[this,6,10]对了，你刚成为音律星尊，需要巩固根基，我到时给你些巩固根基的灵宝。",
            "\t[圣护之手,N1389]\b[this,6,10]以你的资质，说不定未来你也能成为我阴阳圣坛中人呢！",
            "\t[圣护之手,N1389]\b[this,6,10]哈哈哈哈哈哈哈哈！！",
            {
                "type": "move",
                "loc": [
                    6,
                    10
                ],
                "time": 500,
                "steps": [
                    "down",
                    "down"
                ]
            },
            "\t[罗天,N1251]\b[this,6,6]......................",
            "\t[罗天,N1251]\b[this,6,6].............洛兰",
            "\t[罗天,N1251]\b[this,6,6]我听说圣羽洛斯这个人内心非常的恐怖，我非常担心你的安危呀！",
            "\t[罗天,N1251]\b[this,6,6]可是圣羽洛斯在第四个区域中的三圣之巅，我根本到达不了这个地方.....我该怎么办",
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[罗天,N1251]\b[this,6,6]只有一个办法了！以我最快的速度提高实力达到三圣之巅！",
            "\t[罗天,N1251]\b[this,6,6]洛兰！等着我！我一定会将你带走的！！",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "洛兰被圣羽洛斯带走以后，罗天下定决心努力修炼，争取早日进入三圣之巅带走洛兰。",
            "圣护之手不时的会送一些巩固根基的灵宝辅助罗天修炼。",
            "二年之后",
            {
                "type": "setBlock",
                "number": "N1389",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "floorId": "MT154",
                "time": 0
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[圣护之手,N1389]不错呀！经过两年的修炼，你的实力提升的挺快嘛！",
            "\t[罗天,N1251]谢大人夸奖。",
            "\t[圣护之手,N1389]这次我来是给你最后一个任务的。",
            "\t[罗天,N1251]最后一个任务？大人你....",
            "\t[圣护之手,N1389]圣羽洛斯大人告诉我，你那好友的任务完成的差不多了,等你完成了这最后一个任务，你的朋友就能重新回到你身边！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[罗天,N1251]真的吗？",
            "\t[圣护之手,N1389]当然是真的。",
            "\t[罗天,N1251]那最后一个任务是什么呢？",
            "\t[圣护之手,N1389]最近有一个地方有谋反的倾向，需要你去平反，明白吗？",
            "\t[罗天,N1251]明白！",
            "\t[圣护之手,N1389]很好！现在你立刻.....",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "罗天立刻去了要平反的地方，果然如同圣护之手所说的那样，这里的人有谋反的现象。",
            "罗天以自己的强悍的实力顺利的解决了一堆敌人，任务看起来很简单。",
            "然而罗天怎么也想不到，就是这一次的平反任务，使他的人生轨迹发生了\\d巨大的改变！",
            "在平反地带",
            {
                "type": "pauseBgm"
            },
            {
                "type": "changeFloor",
                "floorId": "MT156",
                "loc": [
                    111,
                    111
                ],
                "time": 0
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,10016,10017,10017,10017,10017,10017,10017,10017,10017,10017,10018, 20],
    [ 20,10024,10025,10025,10025,10025,10025,10025,10025,10025,10025,10026, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,10172,10171,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0, 20, 20, 20, 20, 20],
    [ 20,  0,  0,181040,181041,181042,  0,  0, 20,10017,10017,10018, 20],
    [ 20,  0,1418,181048,181049,181050,  0,  0,10016,10025,10025,10026, 20],
    [ 20,  0,  0,181056,181057,181058,  0,  0,10024,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,180720,180721, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,143,143,143,143,143,143,143,143,143,143,143,10000],
    [10000,143,143,143,143,143,143,143,143,143,143,143,10000],
    [10000,143,143,143,143,143,143,143,143,143,143,143,10000],
    [10000,143,143,143,143,143,143,143,143,143,143,143,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,10038,  0,180856,  0,180696,180697,180552,180553,180554,  0],
    [  0,10071,10071,10046,10104,180864,180865,180704,180705,180560,180561,180562,  0],
    [  0,10079,10079,  0,10112,180848,180833,180712,180713,180568,180569,180570,  0],
    [  0,10087,10087,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10094,  0],
    [  0,10095,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10103,  0,  0,  0,  0,  0,  0,  0,170126,170127,  0,  0],
    [  0,  0,  0,10055,  0,  0,  0,  0,  0,170134,170135,  0,  0],
    [  0,10095,  0,  0,  0,  0,  0,  0,  0,170142,170143,170181,  0],
    [  0,10103,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,180480,180481,180482,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,180489,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}