main.floors.MT16=
{
    "floorId": "MT16",
    "title": "主塔 11层",
    "name": "11",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 2,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            {
                "type": "playBgm",
                "name": "lolita1.mp3",
                "keep": true
            },
            "\t[仙琳,fairy]\b[this,6,2]首先恭喜你到达第二区域，小粽勇者。",
            "\t[仙琳,fairy]\b[this,6,2]那个死骷髅虽然实力不怎么样，但对于你们人类来说还是比较强的存在。",
            "\t[小粽,hero]\b[hero]实力不怎么样？？我刚才差点就被那个骷髅大帝给打死了，这怎么叫实力不怎么样？？！",
            "\t[仙琳,fairy]\b[this,6,2]先别激动，你看看你周围的魔物实力就知道了~",
            {
                "type": "sleep",
                "time": 3000
            },
            "\t[小粽,hero]\b[hero]这......这个区域为什么随便一个怪都比那个安兹乌洛斯要强的多啊！",
            "\t[仙琳,fairy]\b[this,6,2]其实这座魔塔每个区域实力间隔都非常大，而每个区域的头目都在自己的区域充当监军的作用。",
            "\t[仙琳,fairy]\b[this,6,2]就比如第一区域的骷髅大帝，他的实力对于他那个区域来说是巅峰的存在，但在这里就只能算个普通小兵。",
            "\t[仙琳,fairy]\b[this,6,2]更高级别的区域必须是更高级别的魔物才能统领。",
            "\t[仙琳,fairy]\b[this,6,2]所以最后魔王的实力能随手毁灭一座城市的实力，这并不是开玩笑的。",
            "\t[仙琳,fairy]\b[this,6,2]不过你不用太担心，你的路还很长。",
            "\t[仙琳,fairy]\b[this,6,2]这个区域的核心思想就是偷，在这个区域除了宝石血瓶变成原来的两倍，更重要的是这个区域武器和防具加成高达100攻防！",
            "\t[仙琳,fairy]\b[this,6,2]剑就在这一层，盾在十四楼，一定要第一时间取得，不然......人家可不想看到你被一群魔物围殴致死的模样呢",
            {
                "type": "playSound",
                "name": "Raise1.ogg"
            },
            {
                "type": "animate",
                "name": "wuyu",
                "loc": "hero",
                "async": true
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[小粽,hero]\b[hero]仙子小姐，你能不能不要这么咒我呀......",
            "\t[仙琳,fairy]\b[this,6,2]哎呀！放心了，以你的水平，这些魔物应该还难不到你的~",
            "\t[仙琳,fairy]\b[this,6,2]那么加油吧！小粽勇者。",
            {
                "type": "hide",
                "time": 500
            },
            {
                "type": "playBgm",
                "name": "battle1.mp3"
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": "MT14",
            "stair": "upFloor",
            "time": 0
        },
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  1,  1,  4,397,397,397, 24,  1,  1,  1,  1,  1,  1],
    [  1, 29,  4,  4,  4,  4, 88,  0, 86,421, 28,366,  1],
    [  1,212, 81, 29,410, 32,124, 31,  1,  1,  1, 86,  1],
    [  1, 27,  1, 81,  1,  1, 86,  1,  1, 37,236, 30,  1],
    [  1,  1, 30, 81, 31,427,  0,427,  1, 83,  1,213,  1],
    [  1, 34, 32,436,300, 31,300,300,  1,  0, 27, 82,  1],
    [  1, 86,  1,383,  1,300,445, 29,  1,410,  1,410,  1],
    [  1,408,382,  1,  0, 32,  0,  1, 81,  0,  1, 21,  1],
    [  1, 29,  1, 28,212,  1, 81,  0,  0,465, 81, 29,  1],
    [  1, 28,  1,  1,  0, 21,  1,  0,  1,382,  1,207,  1],
    [  1, 32, 81,  1,  1,213,  0, 31,  0,  1,  1, 81,  1],
    [  1,227,383, 34, 81,411,  1,  1, 86,436, 34, 87,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "battle1.mp3",
    "bg2map": [

],
    "fg2map": [

]
}