main.floors.MT17=
{
    "floorId": "MT17",
    "title": "主塔 12 层",
    "name": "12",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 2,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,12": [
            "看到前面一群你现在无法匹敌的魔物没？这个时候看看自己背包有没有什么道具可以用的。",
            "全绿玩家请无视。"
        ]
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1],
    [  1, 87,  0,  1, 32,  1,  0,427,411,427,421,427,  1],
    [  1,427,  1,  1,  0, 81,  0,382, 34,382, 23,382,  1],
    [  1,383,421,  0,  0,436,300,427,411,427,421,427,  1],
    [  1,  1, 27,  1, 29,  1,  1,  1, 82,  1,  1,  1,  1],
    [  1,427,300,465,  0, 81,  0,  0, 29,  0,465,412,  1],
    [  1,382,  1, 27,  1,  0,445,  0,  1, 34,  1,  1,  1],
    [  1,227,383, 81,  0, 21,  0, 34,  1,  0,  1,351,  1],
    [  1, 34,  1,382,  1,  1, 81,  1,  1,334, 81,236,  1],
    [  1,  0,366,  0,408,  0,  0,  1,  0,436,  1,335,  1],
    [  1,474,  1, 81,  1,  0,213, 21,366,  1,  1,  1,  1],
    [  1,385,  1,408,382,  1,411,  1,212, 22,  0, 88,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,129,  1,  1]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "battle1.mp3",
    "bg2map": [

],
    "fg2map": [

]
}