main.floors.MT184=
{
    "floorId": "MT184",
    "title": "光明圣堂",
    "name": "光明圣堂",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "spendid1.mp3",
            "keep": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[魔王,N831]\b[this,6,6]你们两个终于来了呀！",
        "\t[魔王,N831]\b[this,6,6]我还在想,要是你们都不来的话，我是不是还得一个一个登门拜访呀？！啊！！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]是属下之前忙于研究科学，忘记了时间。",
        "\t[魔王,N831]\b[this,6,6]算了，我现在没有时间听你狡辩，我直接说正题！",
        "\t[魔王,N831]\b[this,6,6]上次开会，我们提到了那个人类的勇者。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]难道那个勇者被打死了？这就不好办了。",
        "\t[魔王,N831]\b[this,6,6].....那个人类勇者，说出来你们可能不信，他现在要突破到阴阳圣坛的领域了！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                10
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                9
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[圣羽洛斯,N1379]\b[this,6,9]什么？！这也太快了吧！！才半个月都不到就打败了四星尊天的四大星尊？？？！！！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]那些星尊是吃干饭的吗？这么废物！",
        "\t[魔王,N831]\b[this,6,6].......那些星尊是不是吃干饭现在与我们没有关系，我们现在就只关注这个人类勇者的实力。",
        "\t[魔王,N831]\b[this,6,6]以及如何完成【】计划！",
        "\t[黯夜殇,N1387]\b[this,4,9]魔王大人，那我们现在该怎么办。",
        "\t[魔王,N831]\b[this,6,6]........我已经想好计划了。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]是什么计划？",
        "\t[魔王,N831]\b[this,6,6]黯夜殇！你现在立刻去阴阳圣坛的阳之坛，具体操作到时我会通过意念传达给你。",
        "\t[黯夜殇,N1387]\b[this,4,9]是！魔王大人！！",
        "\t[魔王,N831]\b[this,6,6]圣护之手·天！阴阳圣坛是你管辖的领域，你到时就根据具体情况具体分析就行了。",
        "\t[圣护之手·天,N1389]\b[this,7,10]属下遵命！！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]大人！那我呢！那我该干什么呢？!",
        "\t[魔王,N831]\b[this,6,6]你？你就在我这里继续完成当年神之祭品的试验就行了。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]行吧，看来不能到处去玩了。",
        "\t[魔王,N831]\b[this,6,6].......梦！你负责监督圣羽洛斯这个家伙，天知道他又会搞出什么奇怪的东西来。",
        "\t[梦,E514]\b[this,8,5]...........是。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]那魔王大人，你去要去干什么呀？",
        "\t[魔王,N831]\b[this,6,6]我最近听说，阴之坛好像有一只老鼠，,我要亲自去看一看那只老鼠。",
        "\t[魔王,N1379]\b[this,6,6]圣羽洛斯。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]诶？怎么了，魔王大人，有什么事吗?",
        "\t[魔王,N831]\b[this,6,6]说不定那只老鼠是我们当初的\\d老朋友呢！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]...........你是说?",
        "\t[魔王,N831]\b[this,6,6]我还不太确定，我只是感觉气息相近而已。",
        "\t[魔王,N831]\b[this,6,6]罢了！到时再说。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]等等，大人，君阁主他还在闭关吗?",
        "\t[魔王,N831]\b[this,6,6]君阁主我之前已经单独给他布置了任务，这你不用操心。",
        "\t[魔王,N831]\b[this,6,6]好了！现在我都给你们每个人安排了任务，现在去完成吧！",
        "\t[圣护之手·天,N1389]\b[this,7,10]是！",
        "\t[黯夜殇,N830]\b[this,4,9]是！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]是！",
        "\t[梦,N1371]\b[this,8,5]...........是",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[魔王]【】计划终将实现！无论是谁都阻止不了我！！",
        "\t[魔王]等着我！我一定会实现【】计划的！",
        "\t[魔王]哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！！",
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "vibrate",
            "time": 1000
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        "\\d第三章 至死不渝",
        "第二章已完结,是否记录分数,或者继续前行?",
        {
            "type": "choices",
            "text": "是否记录",
            "choices": [
                {
                    "text": "记录分数",
                    "action": [
                        {
                            "type": "if",
                            "condition": "(item:greenKey > 0)",
                            "true": [
                                {
                                    "type": "win",
                                    "reason": "第二章 四星璀璨（全绿难度）"
                                }
                            ],
                            "false": [
                                {
                                    "type": "win",
                                    "reason": "第二章 四星璀璨（0绿难度）"
                                }
                            ]
                        }
                    ]
                },
                {
                    "text": "继续前行",
                    "action": [
                        {
                            "type": "sleep",
                            "time": 500
                        },
                        {
                            "type": "insert",
                            "loc": [
                                12,
                                12
                            ]
                        }
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,12": [
            "随着时间的流逝，小粽他们已经开启了传送法阵去这座魔塔的第三个区域——阴阳圣坛。",
            "虽然传送法阵开启了，但是！阴阳圣坛与四星尊天的空间距离要比前20F到四星尊天要远的多。",
            "在小粽他们传送的同时，堇已经到达了阴阳圣坛的阴之坛了。",
            "注意：接下来会暂时切换主角，也就是说之前的道具和钥匙都不能用了！",
            "还有，接下来每一章钥匙道具属性都会重新变动,说白了就是防止你们滚太多雪球。",
            "玩家：？？？",
            "而且接下来是独立关卡所以放心咸鱼吧！",
            "主角2——堇",
            "四星尊天的剑神星尊，四大星尊的最强存在，对剑的领悟达到了一种匪夷所思的境界，攻击力非常强大！",
            "缺点：续航能力和防御偏低。",
            "就这么简单的介绍了，让我们继续开始游戏吧！",
            {
                "type": "setHeroIcon",
                "name": "hero1.png"
            },
            {
                "type": "disableShop",
                "id": "161Fshop"
            },
            {
                "type": "setValue",
                "name": "status:hp",
                "value": "1000000000"
            },
            {
                "type": "setValue",
                "name": "status:atk",
                "value": "250000000"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "value": "50000000"
            },
            {
                "type": "setValue",
                "name": "status:mdef",
                "value": "100000000"
            },
            {
                "type": "setValue",
                "name": "status:money",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:yellowKey",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:blueKey",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:redKey",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "status:money",
                "value": "0"
            },
            {
                "type": "addValue",
                "name": "item:I507",
                "value": "-1"
            },
            {
                "type": "addValue",
                "name": "item:centerFly",
                "value": "-114514"
            },
            {
                "type": "addValue",
                "name": "item:pickaxe",
                "value": "-114514"
            },
            {
                "type": "showStatusBar"
            },
            {
                "type": "changeFloor",
                "floorId": "MT185",
                "loc": [
                    6,
                    1
                ],
                "direction": "down",
                "time": 0
            }
        ],
        "11,12": [
            "随着时间的流逝,小粽他们已经开启了传送法阵去这座魔塔的第三个区域——阴阳圣坛",
            "虽然传送法阵开启了,但是！阴阳圣坛与四星尊天的空间距离要比前20F到四星尊天要远的多",
            "在小粽他们传送的同时,堇已经到达了阴阳圣坛的阴之坛了",
            "注意：接下来会暂时切换主角,也就是说之前的道具和钥匙都不能用了！",
            "还有,接下来每一章钥匙道具属性都会重新变动,说白了就是防止你们滚太多雪球",
            "玩家：？？？",
            "而且接下来是独立关卡所以放心咸鱼吧！",
            "主角2——堇",
            "四星尊天的剑神星尊,四大星尊的最强存在,对剑的领悟达到了一种匪夷所思的境界，攻击力非常强大！",
            "缺点：续航能力和防御偏低",
            "就这么简单的介绍了,让我们继续开始游戏吧！",
            {
                "type": "setHeroIcon",
                "name": "hero1.png"
            },
            {
                "type": "disableShop",
                "id": "161Fshop"
            },
            {
                "type": "setValue",
                "name": "status:hp",
                "value": "1000000000"
            },
            {
                "type": "setValue",
                "name": "status:atk",
                "value": "250000000"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "value": "50000000"
            },
            {
                "type": "setValue",
                "name": "status:mdef",
                "value": "100000000"
            },
            {
                "type": "setValue",
                "name": "status:money",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:yellowKey",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:blueKey",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:redKey",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "status:money",
                "value": "0"
            },
            {
                "type": "addValue",
                "name": "item:I507",
                "value": "-1"
            },
            {
                "type": "addValue",
                "name": "item:centerFly",
                "value": "-114514"
            },
            {
                "type": "addValue",
                "name": "item:pickaxe",
                "value": "-114514"
            },
            {
                "type": "showStatusBar"
            },
            {
                "type": "changeFloor",
                "floorId": "MT185",
                "loc": [
                    6,
                    1
                ],
                "direction": "down",
                "time": 0
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80034,80009,80032,80033,80033,80033,80033,80027],
    [80026,80044,80040,80041,80067,80044,80009,80044,80066,80041,80041,80044,80024],
    [80026,80052,80048,80049,80075,80052,80009,80052,80074,80049,80049,80052,80024],
    [80026,80060,80056,80057,80083,80060,80009,80060,80082,80057,80058,80060,80024],
    [80026,80009,80178,80179,80009,80009,80009,80009,80009,80178,80179,80009,80024],
    [80026,80009,80009,  0,  0,90602,90603,90604,1371,  0,80009,80009,80024],
    [80026,70124,80009,  0,  0,90610,831,90612,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,80009,80009,  0,1387,  0,1379,  0,  0,  0,80009,80009,80024],
    [80026,80151,80135,  0,  0,  0,  0,1389,  0,  0,80135,80151,80024],
    [80026,80159,80143,80009,80009,80009,80009,80009,80009,80009,80143,80159,80024],
    [80020,80017,80017,80017,80018,80201,80201,80201,80016,80017,80017,80017,80019]
],
    "bgmap": [
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,70069,  0,  0,  0,  0,  0,  0,  0,70069,  0,  0],
    [  0,  0,80162,80163,  0,  0,  0,  0,  0,80162,80163,  0,  0],
    [  0,  0,80170,80171,  0,  0,  0,  0,  0,80170,80171,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,80179,  0,  0],
    [  0,80175,  0,102,  0,  0,  0,  0,  0,102,  0,80175,  0],
    [  0,80175,  0,  0,  0,  0,  0,  0,  0,  0,  0,80175,  0],
    [  0,80175,  0,  0,  0,  0,  0,  0,  0,  0,  0,80175,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,102,  0,  0,  0,  0,  0,102,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90611,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80151,  0,  0,  0,80151,  0,80151,  0,  0,  0,80151,  0],
    [  0,80159,  0,  0,  0,80159,  0,80159,  0,  0,  0,80159,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}