main.floors.MT181=
{
    "floorId": "MT181",
    "title": "造物塔顶层",
    "name": "造物塔顶层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": "ground",
    "bgm": null,
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[星钰,E593]\b[this,6,1]............",
        "\t[星钰,E593]\b[this,6,1]来了吗？",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        "\t[星钰,E593]\b[this,6,1]你就是仙琳妹妹所说的小粽吗？",
        "\t[小粽,hero]\b[hero].....是",
        "\t[星钰,E593]\b[this,6,1]......的确有点本事，居然能够解决我制造的所有机械。",
        "\t[星钰,E593]\b[this,6,1]你是要去阴阳圣坛没错吧！",
        "\t[小粽,hero]\b[hero]是的，不过去阴阳圣坛需要用到你的身份符。",
        "\t[星钰,E593]\b[this,6,1]我在四星尊天担任星尊已经有几年了，对星尊之位早就没有恋栈之心了。",
        "\t[星钰,E593]\b[this,6,1]并且我现在的技术早已进入了瓶颈，这里的材料已经不足以支撑我继续研发了。",
        "\t[小粽,hero]\b[hero]..........................",
        "\t[星钰,E593]\b[this,6,1]说实话，如果不是因为仙琳妹妹的话，我早就离开四星尊天去阴阳圣坛那里了。",
        "\t[小粽,hero]\b[hero]也就是你也想去阴阳圣坛那里?",
        "\t[小粽,hero]\b[hero]看来从某个角度来说我们的目的是一致的。",
        "\t[星钰,E593]\b[this,6,1]的确如你所说的那样，我们的目的是一致的。",
        "\t[星钰,E593]\b[this,6,1]不过......！",
        {
            "type": "playBgm",
            "name": "battle11.mp3",
            "keep": true
        },
        "\t[星钰,E593]\b[this,6,1]阴阳圣坛可比四星尊天危险的多，我可不希望你的实力太弱连开启传送法阵都做不到！",
        "\t[小粽,hero]\b[hero]看来不得不战了！",
        "\t[星钰,E593]\b[this,6,1]来吧！就让我看看仙琳妹妹选中的人实力究竟有多强！！",
        {
            "type": "setBlock",
            "number": "E593",
            "loc": [
                [
                    6,
                    1
                ]
            ],
            "time": 0
        },
        "\t[小粽,hero]\b[hero]嗯！这是.....",
        "\t[星钰,E593]\b[this,6,1]这是我最常用的武器，它的威力非常大,小心了！",
        "\t[星钰,E593]\b[this,6,1]周围的空间已经被我用隐形机械给封锁了，你只有直走这唯一道路！！",
        "\t[小粽,hero]\b[hero](.....或许中心对称飞行器是个不错的选择。)"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[星钰,E593]\b[this,6,1]厉害，吃了我这么多子弹居然还能走到我面前。",
                "\t[星钰,E593]\b[this,6,1]不过你觉得我只会用远程武器吗？！",
                "\t[小粽,hero]\b[hero]！！！不好！",
                "\t[星钰,E593]\b[this,6,1]斩天！开！！",
                {
                    "type": "battle",
                    "id": "E593"
                },
                {
                    "type": "moveHero",
                    "time": 500,
                    "steps": [
                        "backward",
                        "backward"
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "N823"
                },
                "\t[星钰,E593]\b[this,6,1]呼......呼........",
                "\t[小粽,hero]\b[hero]外物之道，果然厉害，明明你的身体素质与普通人相差无几，却能够依靠科技的力量达到这个水平！",
                "\t[小粽,hero]\b[hero]不过最后的结果是我赢了！",
                "\t[星钰,E593]\b[this,6,1]行吧，这次就算你赢了，我就跟着你去阴阳圣坛吧。",
                "\t[小粽,hero]\b[hero]嗯？你是要跟我一起走？",
                "\t[星钰,E593]\b[this,6,1]怎么？不行吗？！难不成你觉得我会吃了你吗？！",
                {
                    "type": "playSound",
                    "name": "Raise1.ogg"
                },
                {
                    "type": "animate",
                    "name": "wuyu",
                    "loc": "hero"
                },
                "\t[小粽,hero]\b[hero]额......我之前还以为你只是帮忙开启去阴阳圣坛的通道，到了阴阳圣坛那里我们就分道扬镳了。",
                "\t[星钰,E593]\b[this,6,1]哈？！你是不是傻呀，你信不信等你到阴阳圣坛那里会连路都找不着！",
                "\t[星钰,E593]\b[this,6,1]真不知道仙琳妹妹是怎么看上你的！",
                {
                    "type": "playSound",
                    "name": "Raise1.ogg"
                },
                {
                    "type": "animate",
                    "name": "wuyu",
                    "loc": "hero"
                },
                "\t[星钰,E593]\b[this,6,1]我之前都说了阴阳圣坛这个地方比我们这里危险的多。",
                "\t[星钰,E593]\b[this,6,1]你的实力我也看到了，顶多与我在伯仲之间。",
                "\t[星钰,E593]\b[this,6,1]这种实力在四星尊天这里的确挺强，但到阴阳圣坛那里是完全不够看的！",
                "\t[小粽,hero]\b[hero]这.........怎么夸张?!!",
                "\t[星钰,E593]\b[this,6,1]不然呢？难道你觉得我是危言耸听？",
                "\t[星钰,E593]\b[this,6,1]而且传闻阴阳圣坛是信仰什么神灵来着.....嗯.....我忘了这个神灵的名字是叫什么了。",
                "\t[星钰,E593]\b[this,6,1]哎呀！总之！！阴阳圣坛的人非常仇视外敌，要是他们发现了你这样的勇者，估计死的连渣都不剩了呢！",
                "\t[小粽,hero]\b[hero]我明白了，那我们什么时候去阴阳圣坛呢？",
                "\t[星钰,E593]\b[this,6,1]要过一段时间，先恢复到最佳状态。",
                "\t[小粽,hero]\b[hero]这样呀.......",
                "\t[星钰,E593]\b[this,6,1].......堇姐姐之前也特意到我这里告诉了我她的目的，不过因为时间短暂我没有听清。",
                "\t[星钰,E593]\b[this,6,1]而且我从仙琳妹妹那知道了你们之前发生的事情，我记得你们之前是让堇姐姐先去阴阳圣坛探路，没错吧。",
                "\t[小粽,hero]\b[hero]是这样没错。",
                "\t[星钰,E593]\b[this,6,1]堇姐姐去的应该是阴阳圣坛的阴之坛，到时我们去阳之坛。",
                "\t[小粽,hero]\b[hero]诶？难道不是去阴之坛好一些吗，有堇小姐为我们带路，应该会比较轻松吧。",
                "\t[星钰,E593]\b[this,6,1]我的天呀！你脑子是不是修炼武技修炼傻了！怎么可能去阴之坛呢？！",
                "\t[小粽,hero]\b[hero]什么意思，难道不是我想的这样吗？",
                "\t[星钰,E593]\b[this,6,1]首先呢，堇姐姐现在应该已经到了阴阳圣坛的阴之坛了，从时间上来说，堇姐姐是没有时间等我们的！",
                "\t[星钰,E593]\b[this,6,1]其次呢，等我们到达阴阳圣坛的时候，堇姐姐应该已经得到了阴之坛的情报了，同时堇姐姐可以用她的秘法给我们关于阴之坛的情况。",
                "\t[星钰,E593]\b[this,6,1]这样我们到时就可以根据情报来制定不同的方案。",
                "\t[星钰,E593]\b[this,6,1]再次呢，堇姐姐闯入阴之坛这件事是肯定会被阴阳圣坛核心人物所知晓的，他们也肯定会派至少是圣护之手这个级别的人物前去截杀！",
                "\t[星钰,E593]\b[this,6,1]这样呢，阳之坛的高层人物肯定都跑去阴之坛去了，驻守阳之坛的实力就会削弱许多。",
                "\t[星钰,E593]\b[this,6,1]这样我们就有机会在阳之坛趁虚而入了。",
                "\t[星钰,E593]\b[this,6,1]等我们拿到阳之坛的至宝——光明圣石.就可以去掩护堇姐姐了。",
                "\t[小粽,hero]\b[hero]但是如果按你这样说的：阴阳圣坛的精锐实力都去了阴之坛，堇小姐会不会有危险？",
                "\t[星钰,E593]\b[this,6,1]这你放心吧！除非是三圣之巅的核心人物出手，堇姐姐就不会有生命危险。",
                "\t[星钰,E593]\b[this,6,1]而且三圣之巅可是位于第四区域，那里的人现在哪有心思管我们这些人呢?",
                "\t[小粽,hero]\b[hero]原来如此，好一步暗度陈仓呀！",
                "\t[星钰,E593]\b[this,6,1]行了，我们现在赶紧回复体力，战术虽好，但还是要实锤才有用。",
                "\t[星钰,E593]\b[this,6,1]希望阴阳圣坛内有一些新型的材料与技术吧。",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "hideStatusBar"
                },
                {
                    "type": "pauseBgm"
                },
                "小粽与星钰讨论了去阴阳圣坛的路线与计划之后开始回复体力。",
                "仙琳告诉他们堇已经到达了阴阳圣坛中的阴之坛了。",
                "在小粽他们看来这次的计划貌似看似天衣无缝。",
                "然而在这阴阳圣坛中，他们却怎么也想不到，他们所要面临的，是他们完全无法匹敌的存在..................",
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            1
                        ]
                    ],
                    "remove": true,
                    "time": 0
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "与此同时。",
                {
                    "type": "changeFloor",
                    "floorId": "MT182",
                    "loc": [
                        142,
                        3312
                    ],
                    "time": 0
                }
            ]
        }
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [157,157,157,157,157,157,157,157,157,157,157,157,157],
    [157,  0,  0,  0,  0, 17,823, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,157],
    [157,157,157,157,157,157,  0,157,157,157,157,157,157]
],
    "bgmap": [
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,  0,  0,  0,  0,  0,154,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}