main.floors.MT206=
{
    "floorId": "MT206",
    "title": "秘密基地",
    "name": "秘密基地",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 4000000,
    "defaultGround": "ground",
    "bgm": "battle13.mp3",
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "forward",
                "forward",
                "forward",
                "forward",
                "forward",
                "forward",
                "forward"
            ]
        },
        "\t[堇,hero]\b[hero]看来这里就是圣羽洛斯的秘密基地了。",
        "\t[堇,hero]\b[hero]就让我看看你究竟你这里埋藏着什么秘密！",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "forward",
                "forward"
            ]
        },
        "面前的水晶随着堇的移动迸发出一丝亮丽的光芒。",
        "\t[堇,hero]\b[hero]嗯？这是................",
        "面前的水晶逐渐显露出一些本该隐藏的秘密。",
        "我在这座魔塔已经有数十年了，可以说我是除了魔王以外最资深的存在。",
        "我跟随魔王一共完成了三大试验，每一次试验都可以说是一次巨大的突破。",
        "不过这些试验都有一个共同点：都是制造试验体！",
        "第一次试验是由魔王主导的试验，这次试验我明显感受到魔王的气息非常不稳定，好像类似于兴奋的情感。",
        "我不知道为什么魔王会对这次试验如此兴奋，或许这次的试验品的确非常独特。",
        "那次试验如期的完成了，但是魔王却因此沉默寡言起来........",
        "明明这个试验非常成功，但魔王却还是没有说半点祝贺的话，这让我感到非常诧异。",
        "或许魔王他自有他的目的吧....",
        "\t[堇,hero]\b[hero]试验体？这究竟是.........",
        "\t[堇,hero]\b[hero]继续看吧",
        "第二次试验完成于十六年前，由我与魔王一同完成的试验。",
        "尝试以胚胎的形式生产出试验体。",
        "不过等到试验完成后，魔王却说这个试验体是失败品，把他给丢弃了。",
        "\t[堇,hero]\b[hero]有关于第二个试验体的信息就这么点？有点奇怪呀......",
        "第三次试验是基于神之祭品来完成的。",
        "\t[堇,hero]\b[hero]神之祭品？那是什么？！",
        "而且这次试验是准备量产精英试验体做准备的。",
        "把神之祭品的灵魂融入这个试验体当中去，使其拥有一部分的神之力！",
        "如果成功的话，可以极大的提升我们魔塔的底蕴。",
        "不过......天有不测风云，由于一个变量的变动，导致这个试验品的神之力的力量与我的预期相去甚远。",
        "本来当初那个神之祭品的力量是一种圣洁的力量，而这个试验品的力量却是一种极其恐怖的黑暗之力！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[堇,hero]\b[hero]黑暗之力？！难道说！！",
        "\t[堇,hero]\b[hero]不.....不可能吧！",
        "堇带着一种非常急切的心情看向这个水晶。",
        "这股黑暗之力非常强大，在当时这个试验体一醒来居然直接突破了我和手下的阻拦，并且击杀了我诸多手下，以第一时间逃离到了阴阳圣坛之下的领域！",
        "在当时我第一时间向魔王汇报了这个消息，,但是魔王却说这次试验意外是必然的。",
        "并且命令我不再管理此事！",
        "魔王那反复无常的举动已经让我感到非常失望与愤怒，明明是魔王，却不干魔王该做的职责，把自己的手下当做炮灰一样对待！",
        "从那时起，,我就打算有朝一日可以发动一次变革！",
        "要彻底改变魔塔内部的现状！把魔王斩于马下！",
        "而到那个时候，我就可以一统整座魔塔，并且整个人类世界也将是我的囊中之物！",
        "\t[堇,hero]\b[hero].............这.............这！",
        "\t[堇,hero]\b[hero]没想到我居然是被人所创造的！",
        "\t[堇,hero]\b[hero]没想到我的黑暗之力居然是这么来的！",
        "\t[堇,hero]\b[hero]不可能！不可能啊！！",
        {
            "type": "vibrate",
            "time": 1000
        },
        "\t[堇,hero]\b[hero]冷静下来！我不能让黑暗再一次侵蚀我的身体！",
        "\t[堇,hero]\b[hero]呼..........呼......压制下来了。",
        "\t[堇,hero]\b[hero]不过这个秘密所牵连的实在是.......",
        "\t[堇,hero]\b[hero]这个水晶还在不断传达信息.......",
        "魔塔最高机密——————",
        {
            "type": "playSound",
            "name": "SE01.mp3"
        },
        "\r[red]造！",
        {
            "type": "playSound",
            "name": "SE01.mp3"
        },
        "\r[red]造！神！",
        {
            "type": "playSound",
            "name": "SE01.mp3"
        },
        "\r[red]造！神！计！",
        {
            "type": "playSound",
            "name": "SE01.mp3"
        },
        "\r[red]造！神！计！划！！",
        {
            "type": "vibrate",
            "time": 1000,
            "async": true
        },
        {
            "type": "playSound",
            "name": "Zombie02.wav"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "Zombie02.wav"
        },
        {
            "type": "playBgm",
            "name": "disorder3.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[堇,hero]\b[hero]\r[red]造.....造神计划？！！！！",
        "\t[堇,hero]\b[hero]这.....怎么可能！！！",
        "\t[堇,hero]\b[hero]他们居然想创造一个神出来？！！",
        "\t[堇,hero]\b[hero]这真的可能吗？！！",
        "造神计划在魔塔建造之前就已经开始准备了。",
        "造神计划就如同它的名字一般要创造出一个神出来！",
        "不过造神计划要求非常苛刻！",
        "除了需要时间的沉淀之外,还要有三个必不可少的材料！",
        "在三个材料分别是——神之祭品  神之勇者 以及..............神之圣女！！！",
        "根据我们长时间的研究已经了解了这三个材料的要求与限制。",
        "神之祭品流落于人类世界，只要花足够的时间就可以找到。",
        "而神之勇者必须要求实力达到三圣阁主的实力，并且是那种有血性的勇者，光靠用药剂提高实力的勇者是不配当神之勇者！",
        "而神之圣女我了解的并不是很多，,但魔王说神之圣女他自己会亲自解决！",
        "而等到三个材料集齐的时候，,造神计划就可以完成！",
        "而到那个时刻，即可开始\r[red]大创世时代！！！！",
        {
            "type": "setBlock",
            "number": "X180249",
            "loc": [
                [
                    6,
                    2
                ]
            ],
            "time": 0
        },
        {
            "type": "setBlock",
            "number": "X180068",
            "loc": [
                [
                    6,
                    3
                ]
            ],
            "time": 0
        },
        "而在此时这个水晶破碎了。",
        "\t[堇,hero]\b[hero]..........................",
        "\t[堇,hero]\b[hero].................................",
        "\t[堇,hero]\b[hero]我....我必须离开这些！把这些消息告诉仙琳她们！！",
        {
            "type": "pauseBgm"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "此时外面传来了一道叹息声。",
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "changePos",
            "loc": [
                6,
                4
            ],
            "direction": "down"
        },
        "\t[堇,hero]\b[hero]！！！谁！！",
        "\t[？？？]活着不好吗？",
        "\t[？？？]既然你已经知晓了不该知晓的秘密,那么就请你.................",
        "\t[？？？]\r[red]去死吧！！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                10
            ]
        },
        {
            "type": "setBlock",
            "number": "E1423",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "callBook"
        },
        "\t[堇,hero]\b[hero]你......你是！魔王？！！！",
        "\t[魔王,E1423]\b[this,6,10]魔王吗？呵！世人的确是尊称我为魔王！",
        "\t[魔王,E1423]\b[this,6,10]小丫头，你记得我吗？",
        "\t[堇,hero]\b[hero]我....我怎么可能认识你？！",
        "\t[魔王,E1423]\b[this,6,10]哦？那次试验意外居然让你的记忆全部丧失了呢！",
        "\t[魔王,E1423]\b[this,6,10]不过没有关系，我只用知道你在四星尊天待了这么久，并且还成为了未来神之勇者的朋友这些事情就足够了！",
        "\t[魔王,E1423]\b[this,6,10]而且你所经历的每件事情都在我的预料当中！",
        "\t[堇,hero]\b[hero]你....你什么意思？！",
        "\t[魔王,E1423]\b[this,6,10]无论是试验意外，还是什么杂七杂八的，你所做的一切都只是在既定的道路上徘徊而已！",
        "\t[魔王,E1423]\b[this,6,10]在那为我实施造神计划的道路上徘徊！！",
        "\t[魔王,E1423]\b[this,6,10]感到很惊讶吗？其实你没必要这么惊讶，你们每一个人的未来我早已预订好了！",
        "\t[魔王,E1423]\b[this,6,10]所以你们对于我来说就是如同蝼蚁一般！对我根本产生不了任何威胁！！",
        "\t[魔王,E1423]\b[this,6,10]而我只需要等待时机，让你们一个一个为造神计划献出肉体与灵魂！",
        "\t[堇,hero]\b[hero]这.....你！！",
        "\t[魔王,E1423]\b[this,6,10]好了，废话说完了，你是时候为造神计划献身吧！",
        "\t[堇,hero]\b[hero]我....我和你拼了！",
        "\t[魔王,E1423]\b[this,6,10]没用的！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                10
            ]
        },
        "魔王施放出一股强大的威压镇压着堇。",
        "\t[堇,hero]\b[hero]我....我动不了了？！",
        "\t[魔王,E1423]\b[this,6,10]你的力量,如同尘埃!",
        "\t[魔王,E1423]\b[this,6,10]就算你使用神之力，在我面前也如同蝼蚁一般脆弱！",
        "\t[魔王,E1423]\b[this,6,10]安息吧！",
        "\t[堇,hero]\b[hero]不！！！",
        {
            "type": "hideStatusBar"
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playSound",
            "name": "Attack09.wav"
        },
        {
            "type": "sleep",
            "time": 700
        },
        {
            "type": "playSound",
            "name": "Blow4.ogg"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[魔王]那么！接下来.....就让我看看神之勇者能给我怎样的惊喜呢！",
        "\t[魔王]哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！",
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "由于这里是独立关卡，所以会有一种记录结局，当然简单的说是各位大佬刷榜用的。",
        "是否记录分数,或者继续前行?",
        {
            "type": "choices",
            "text": "是否记录",
            "choices": [
                {
                    "text": "记录分数",
                    "action": [
                        {
                            "type": "if",
                            "condition": "(item:greenKey > 0)",
                            "true": [
                                {
                                    "type": "win",
                                    "reason": "UnknownEnding：道破天机（全绿难度）"
                                }
                            ],
                            "false": [
                                {
                                    "type": "win",
                                    "reason": "UnknownEnding：道破天机（0绿难度）"
                                }
                            ]
                        }
                    ]
                },
                {
                    "text": "继续前行",
                    "action": [
                        "堇在圣羽洛斯的分部实验室探寻到一些非常惊人的秘密同时被魔王截杀，生死未知。",
                        "不过在堇被魔王杀害之前把这些秘密以一种非常神秘的秘术传达给了仙琳她们。",
                        "现在时间线回到我们主角这边！",
                        {
                            "type": "changeFloor",
                            "floorId": ":next",
                            "loc": [
                                6,
                                11
                            ],
                            "direction": "up",
                            "time": 0
                        },
                        {
                            "type": "showStatusBar"
                        },
                        {
                            "type": "waitAsync"
                        }
                    ]
                }
            ]
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [158,158,158,158,158,158,158,158,158,158,158,158,158],
    [158,158,158,158,158,180240,180241,180242,158,158,158,158,158],
    [158,158,158,158,180241,180248,101,180250,180241,158,158,158,158],
    [158,158,158,180241,180249,  0,102,  0,180249,180241,158,158,158],
    [158,158,180241,180249,  0,  0,  0,  0,  0,180249,180241,158,158],
    [158,180240,180249,  0,  0,  0,  0,  0,  0,  0,180249,180242,158],
    [158,180248,  0,  0,  0,  0,  0,  0,  0,  0,  0,180250,158],
    [158,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,158],
    [158,158,  0,  0,  0,  0,  0,  0,  0,  0,  0,158,158],
    [158,158,158,  0,  0,  0,  0,  0,  0,  0,158,158,158],
    [158,158,158,158,  0,  0,  0,  0,  0,158,158,158,158],
    [158,158,158,158,158,  0,  0,  0,158,158,158,158,158],
    [158,158,158,158,158,158,  0,158,158,158,158,158,158]
],
    "bgmap": [
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068],
    [180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068,180068]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,180722,180723,  0,180722,180723,  0,  0,  0,  0],
    [  0,  0,  0,180720,180721,180731,  0,180730,180720,180721,  0,  0,  0],
    [  0,  0,180720,180721,180729,180739,  0,180738,180728,180720,180721,  0,  0],
    [  0,180720,180721,180729,180737,  0,  0,  0,180736,180728,180720,180721,  0],
    [  0,180728,180729,180737,  0,  0,  0,  0,  0,180736,180728,180729,  0],
    [  0,180736,180737,  0,  0,  0,  0,  0,  0,  0,180736,180737,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,180249,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}