main.floors.MT207=
{
    "floorId": "MT207",
    "title": "阳之坛外围",
    "name": "阳之坛外围",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 10000000,
    "defaultGround": "ground",
    "bgm": "battle14.mp3",
    "firstArrive": [
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "disableShop",
            "id": "203Fshop"
        },
        {
            "type": "function",
            "function": "function(){\ncore.removeMaps(\"MT195\", \"MT205\")\n}"
        },
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "10000000000"
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "value": "1000000000"
        },
        {
            "type": "setValue",
            "name": "status:def",
            "value": "1000000000"
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "value": "1000000000"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:yellowKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:blueKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:redKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "addValue",
            "name": "item:I507",
            "value": "1"
        },
        {
            "type": "addValue",
            "name": "item:centerFly",
            "value": "-114514"
        },
        {
            "type": "addValue",
            "name": "item:pickaxe",
            "value": "-114514"
        },
        {
            "type": "setValue",
            "name": "flag:heroLight",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:darkRatio",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:lightRadius",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:name",
            "value": "'小粽'"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]这里就是阴阳圣坛中的阳之坛吗？",
        "\t[小粽,hero]\b[hero].....唔，我感受其充溢的光明气息。",
        "\t[小粽,hero]\b[hero]阳之坛的实力比我想象的还夸张。",
        "\t[小粽,hero]\b[hero]不过由于空间传送的不稳定，导致我的钥匙和道具都消失了......",
        "\t[小粽,hero]\b[hero]看来是场苦战了！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                {
                    "type": "playBgm",
                    "name": "holy2.mp3",
                    "keep": true
                },
                "\t[仙琳,fairy]\b[this,6,9]小粽！不好了！！不好了！！！",
                {
                    "type": "playSound",
                    "name": "jump.mp3"
                },
                {
                    "type": "animate",
                    "name": "unknown",
                    "loc": "hero"
                },
                "\t[小粽,hero]\b[hero]仙琳，怎么了?",
                "\t[仙琳,fairy]\b[this,6,9]堇姐姐..........堇姐姐她.........",
                "\t[小粽,hero]\b[hero]堇小姐她怎么了？",
                "\t[仙琳,fairy]\b[this,6,9]堇姐姐她出事了！",
                {
                    "type": "playSound",
                    "name": "cgefc01.wav"
                },
                {
                    "type": "animate",
                    "name": "unexpected1",
                    "loc": "hero"
                },
                "\t[小粽,hero]\b[hero]什么？！！怎么可能！！",
                "\t[星钰,N823]\b[this,6,8]虽然我也感到很诧异，但是事实就是如此。",
                "\t[星钰,N823]\b[this,6,8]根据堇姐姐所传达的信息——堇姐姐是被一个非常恐怖的家伙给截杀了！",
                "\t[星钰,N823]\b[this,6,8]而且我们也得知了魔塔高层现在所执行的惊天大阴谋！",
                "\t[星钰,N823]\b[this,6,8]具体是这样的...............",
                "一段时间后.........",
                "\t[小粽,hero]\b[hero]......他们的野心居然如此之大，而且居然下了这么大的一盘棋..................",
                "\t[星钰,N823]\b[this,6,8]的确如此，我们每一个都没有想到他们有这样的预谋！",
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[小粽,hero]\b[hero]话虽如此，但是我们也没有退路了，不是吗？",
                "\t[星钰,N823]\b[this,6,8]..............",
                "\t[小粽,hero]\b[hero]所以！与其逃避，不如奋起反抗，打破他们的阴谋！",
                "\t[星钰,N823]\b[this,6,8]..............你说的没错！我们必须齐心协力起来才行！！",
                "\t[小粽,hero]\b[hero]那么！我们现在应该领略一下阴阳圣坛中阳之坛的神威了！",
                {
                    "type": "pauseBgm"
                },
                "\t[仙琳,fairy]\b[this,6,9]......................",
                "仙琳此时轻咬自己的小嘴，似乎在做出什么决定来着.....",
                "\t[小粽,hero]\b[hero]仙琳，我看出你欲言又止，有什么想要对我说的吗？",
                "此时仙琳突然张开手臂，一下子搂住小粽，埋入了小粽的怀中。",
                "仙琳此时紧紧的搂抱着小粽，就好像下一刻就要失去他一样。",
                "此时仙琳抬起头来，那水灵灵的眼睛还带有一丝泪光。",
                "\t[仙琳,fairy]\b[this,6,9]答应我！一定不要死在这里！我还等着你带我离开这里去看你们人类世界呢！",
                "小粽用手抚摸着仙琳的秀发，安慰她说：",
                "\t[小粽,hero]\b[hero]放心吧！我会小心的。",
                "\t[星钰,N823]\b[this,6,8]仙琳妹妹放心，我会跟小粽一同攻略阳之坛的，不会有事的。",
                "\t[仙琳,fairy]\b[this,6,9]嗯嗯！麻烦星姐姐了。",
                "\t[星钰,N823]\b[this,6,8]没事，毕竟你对于我来说是除了父亲大人之外最重要的人呢。",
                "\t[星钰,N823]\b[this,6,9]小粽！你也不要辜负仙琳妹妹哟！",
                "\t[小粽,hero]\b[hero]嗯！",
                "\t[星钰,N823]\b[this,6,8]仙琳妹妹，那我们先去探路，你负责后场工作了。",
                "\t[仙琳,fairy]\b[this,6,9]好！",
                "\t[小粽,hero]\b[hero]那我们就开始吧！",
                {
                    "type": "playBgm",
                    "name": "battle14.mp3",
                    "keep": true
                },
                {
                    "type": "hide",
                    "remove": true,
                    "time": 500
                }
            ]
        },
        "6,8": [
            "星钰加入队伍，攻防与护盾提升100000万！",
            {
                "type": "setValue",
                "name": "status:atk",
                "value": "2000000000"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "value": "2000000000"
            },
            {
                "type": "setValue",
                "name": "status:mdef",
                "value": "2000000000"
            },
            {
                "type": "follow",
                "name": "xy.png"
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,7": [
            "【系统】这个区域所有宝石与血瓶提升的能力为1000万倍！",
            {
                "type": "hide",
                "time": 0
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80034, 91,80032,80033,80033,80033,80033,80027],
    [80026,80040,80172,80041,80067,80044,  0,80044,80066,80041,80172,80042,80024],
    [80026,80048,80180,80049,80075,80052,  0,80052,80074,80049,80180,80050,80024],
    [80026,80056,80057,80057,80083,80060, 22,80060,80082,80057,80057,80058,80024],
    [80026,396,395,394,393, 24, 21, 24,393,394,395,396,80024],
    [80026,159,159,159,159,159, 21,159,159,159,159,159,80024],
    [80026,401,402,400,399, 24, 21, 24,399,400,402,401,80024],
    [80026,159,159,159,159,159,  0,159,159,159,159,159,80024],
    [80026,412,411,411,410, 24,963, 24,410,411,411,412,80024],
    [80026,159,159,159,159,159,124,159,159,159,159,159,80024],
    [80026, 33, 33, 81, 81, 81,  0, 81, 81, 81, 33, 33,80024],
    [80026,159,159,159,159,159,  0,159,159,159,159,159,80024],
    [80020,80017,80017,80017,80017,80017,80017,80017,80017,80017,80017,80017,80019]
],
    "bgmap": [
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80087,  0,  0,  0,  0,  0,  0,  0,  0,  0,80087,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,80041,  0,  0,  0,  0,  0,  0,  0,80041,  0,  0],
    [  0,  0,80049,  0,  0,  0,  0,  0,  0,  0,80049,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}