main.floors.MT236=
{
    "floorId": "MT236",
    "title": "未知地带",
    "name": "未知地带",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "holy3.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "defaultGround": "ground",
    "weather": [
        "rain",
        10
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[？？？,N1415]\b[this,6,2]你所说的，我之前就已经感知到了。",
        "\t[魔王,N681]\b[this,6,9]大人，那现在我应该怎么做？",
        "\t[？？？,N1415]\b[this,6,2]你还是像之前一样完成造神计划就可以了，不要担心这个问题。",
        "\t[魔王,N681]\b[this,6,9]是！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                9
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[？？？,N1415]\b[this,6,2]就算达到抗衡神的层次又如何？在真正的神威面前汝等唯有臣服！",
        "\t[？？？,N1415]\b[this,6,2]无论你们能做出什么，都只会在既定的道路上徘徊！",
        "\t[？？？,N1415]\b[this,6,2]因为我已经看到了你们的过去，现在，以及未来！",
        "\t[？？？,N1415]\b[this,6,2]本座的能为岂是你们这些蝼蚁所能想象的呢！",
        "\t[？？？,N1415]\b[this,6,2]哈哈哈哈哈哈哈哈！！！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "在未知空间内部。",
        {
            "type": "changeFloor",
            "floorId": ":next",
            "loc": [
                111,
                32
            ],
            "direction": "up",
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60016,60017,60018,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60024,1415,60026,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60032,60033,60034,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,60040,60041,60042,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,60016,60017,832,60025,60018,  0,  0,  0,  0],
    [  0,  0,  0,60016,60017,60025,60017,60017,60025,60018,  0,  0,  0],
    [  0,  0,60016,60017,60025,60017,60017,60017,60017,60025,60018,  0,  0],
    [  0,60016,60017,60025,60017,60017,60017,60017,60017,60017,60025,60018,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,60025,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,60025,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}