main.floors.MT232=
{
    "floorId": "MT232",
    "title": "阳之坛出口",
    "name": "阳之坛出口",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 20000000,
    "defaultGround": "ground",
    "bgm": null,
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        "\t[小粽,hero]\b[hero]前面应该就是阳之坛的出口了吗？",
        "\t[星钰,N1196]\b[hero,1]嗯！这里最强的圣护之手已死，而且我们已经拿到了光明圣石。",
        "\t[小粽,hero]\b[hero]那我们赶紧离开这里吧，免得夜长梦多！",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        "\t[???]很遗憾，你们任何人都不能离开这里！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        "\t[小粽,hero]\b[hero]谁？！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                5
            ],
            "async": true
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    1
                ]
            ],
            "floorId": "MT233",
            "time": 0
        },
        "\t[小粽,hero]\b[hero]你是谁？圣护之手·天的兄弟吗？！",
        "\t[星钰,N1196]\b[hero,1]等等！你！你...............！！",
        "\t[星钰,N1196]\b[hero,1]难道说！！",
        "\t[星钰,N1196]\b[hero,1]小粽！快！快跑！这家伙是——",
        "\t[小粽,hero]\b[hero]星钰，你怎么了？这家伙是谁？!",
        "\t[???,E518]\b[this,6,5]兄弟？我觉得你们不应该把那种垃圾与我相提并论！！",
        {
            "type": "callBook"
        },
        "\t[小粽,hero]\b[hero]这实力！怎么可能！！",
        "\t[小粽,hero]\b[hero]你究竟是谁！阴阳圣坛怎么可能会出现你这样的强者！！",
        "\t[黯夜殇,E518]\b[this,6,5]吾是谁吗？告诉你们也无妨！本座名为黯夜殇，魔塔最高实力三圣之巅之三圣阁的阁主！",
        "\t[小粽,hero]\b[hero]三圣之巅之三圣阁阁主？！！不...不可能！三圣之巅明明处于第四大领域,你怎么可能会出现在阴阳圣坛！！",
        "\t[黯夜殇,E518]\b[this,6,5]答案很简单,因为你是神之勇者！",
        "\t[黯夜殇,E518]\b[this,6,5]是为造神计划服务的存在！",
        "\t[星钰,N1196]\b[hero,1]（神之勇者？造神计划？堇姐姐传递的消息好像提到过这个名词。）",
        "\t[星钰,N1196]\b[hero,1]（他们早就已经开始预谋了吗？........）",
        "\t[小粽,hero]\b[hero]造神计划？难道你觉得你们真的能创造出一位神灵不成！",
        "\t[黯夜殇,E518]\b[this,6,5]呵呵，虽然你被魔王大人称为神之勇者，不过你的认知与庸人相差无几呢！",
        "\t[黯夜殇,E518]\b[this,6,5]造神计划所付出的时间与精力是你们这些凡人远远无法想象的！",
        "\t[黯夜殇,E518]\b[this,6,5]而本座就此前来就是为了让你们为造神计划奉献自己的肉体与灵魂！从而开启大创世时代！！",
        "\t[黯夜殇,E518]\b[this,6,5]你们知道为什么我会如此轻松的告诉你们这些秘密吗？",
        "\t[小粽,hero]\b[hero].................................",
        "\t[星钰,N1196]\b[hero,1].................................",
        "\t[黯夜殇,E518]\b[this,6,5]那是因为在我看来，你们二人已经是\r[red]死人了！",
        {
            "type": "playSound",
            "name": "138-Darkness01.ogg"
        },
        {
            "type": "animate",
            "name": "attack19",
            "loc": [
                6,
                5
            ]
        },
        "\t[小粽,hero]\b[hero]！！好恐怖的气息！！这股黑暗之力,比当初堇所释放的黑暗气息还要强悍！！",
        "\t[黯夜殇,E518]\b[this,6,5]来！让本座看看你们究竟能做到哪一步呢！！",
        "\t[星钰,N1196]\b[hero,1]（小粽,这个家伙的实力远远凌驾于我们，我可以拖延一会时间，而你赶紧带着光明圣石离开这里！）",
        "\t[小粽,hero]\b[hero](开什么玩笑！我怎么可能抛弃你不管！我们直接用最强绝招打伤他！！）",
        "\t[星钰,N1196]\b[hero,1]（...............只能这样了吗。）",
        "\t[小粽,hero]\b[hero]\\d天破！",
        "\t[星钰,N1196]\b[hero,1]\\d永生！",
        "\t[小粽/星钰]\\d苍穹/灭世！",
        "\t[黯夜殇,E518]\b[this,6,5]哦？有点意思！",
        {
            "type": "animate",
            "name": "attack17",
            "loc": [
                6,
                5
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXIce8.ogg"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "VXBreath.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "spark1.wav"
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "unfollow",
            "name": "xy.png"
        },
        {
            "type": "sleep",
            "time": 1500
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]成功了吗？",
        "\t[星钰,N1196]\b[this,6,8]....................",
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[黯夜殇]不错，不错，有点实力，的确不辱神之勇者的称号呢！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                5
            ],
            "async": true
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        "\t[小粽,hero]\b[hero]这！这怎么可能！中了我们的绝招居然一点事也没有？？！",
        "\t[黯夜殇,E518]\b[this,6,5]后面那个小丫头，我看你刚才的攻击手法，应该是属于十多年前早已灭族的星家吧！",
        "\t[星钰,N1196]\b[this,6,8]....................被看出来了吗。",
        "\t[黯夜殇,E518]\b[this,6,5]看来是我太久不管下域之事了，没想到当初星家的遗孤居然修炼到如此水平了呢！",
        "\t[黯夜殇,E518]\b[this,6,5]真是可惜呀，当初魔塔内的最强一族，结果却因领导者的谋反，导致一整个大族被全部灭杀！",
        "\t[黯夜殇,E518]\b[this,6,5]妄图颠覆魔王大人的统治，简直是愚不可及！",
        "\t[星钰,N1196]\b[this,6,8]我们星家明明不管魔塔内权力的纷争，一心只研究科技力量。",
        "\t[星钰,N1196]\b[this,6,8]结果却因为魔王的一个决定，导致我星家被直接灭族！",
        "\t[黯夜殇,E518]\b[this,6,5]是吗？那让我来告诉你这一切吧！",
        "\t[黯夜殇,E518]\b[this,6,5]是！你们星家的确不管魔塔内权力的纷争，一心只研究科技力量。",
        "\t[黯夜殇,E518]\b[this,6,5]但是！你有没有听说过怀璧其罪呢！",
        "\t[黯夜殇,E518]\b[this,6,5]你们的科技力量已经影响到了整个魔塔势力，魔王为了防止你们的力量变得不在可控，打算与你们星家的领导人谈判。",
        "\t[黯夜殇,E518]\b[this,6,5]结果你们那什么狗屁的领导者完全不领情，不好好与魔王大人交流不说，还打算有谋反的倾向！",
        "\t[黯夜殇,E518]\b[up]最后导致一整个大族被直接灭族，就留下你这样的小鬼！",
        "\t[黯夜殇,E518]\b[this,6,5]如何？这就是你想要知道的。",
        "\t[星钰,N1196]\b[this,6,8]但你们所谓的谋反绝对是你们所找的一个借口！！",
        "\t[黯夜殇,E518]\b[this,6,5]那又如何？在这个世界只有力量才是王道！",
        "\t[黯夜殇,E518]\b[this,6,5]弱肉强食，乃是这个世界的法则！",
        "\t[黯夜殇,E518]\b[this,6,5]好了，你应该要感谢我，至少死之前你还能做一个明白鬼！",
        "\t[小粽,hero]\b[hero]要想杀我的朋友，就先踏过我的尸体！",
        "\t[黯夜殇,E518]\b[this,6,5]滚！！！",
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": "hero",
            "async": true
        },
        {
            "type": "moveHero",
            "time": 10,
            "async": true,
            "steps": [
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward"
            ]
        },
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    8
                ]
            ]
        },
        "\t[星钰,N823]\b[this,6,8]小粽！",
        "\t[黯夜殇,E518]\b[this,6,8]就先让你睡一会吧，让我好好炮制一下那个小鬼！",
        "\t[星钰,N823]\b[this,6,8]不................!",
        {
            "type": "playSound",
            "name": "138-Darkness01.ogg"
        },
        {
            "type": "animate",
            "name": "attack19",
            "loc": [
                6,
                8
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "remove": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]星钰？！",
        "\t[小粽,hero]\b[hero]你这混蛋！看招！",
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        "\t[黯夜殇,E518]\b[this,6,8]无趣！",
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": "hero",
            "async": true
        },
        {
            "type": "moveHero",
            "time": 10,
            "async": true,
            "steps": [
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward"
            ]
        },
        "\t[小粽,hero]\b[hero]噗！",
        {
            "type": "vibrate",
            "time": 500
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[黯夜殇,E518]\b[this,6,8]太弱了，有形无质的剑意也妄图击败我？!",
        "\t[黯夜殇,E518]\b[this,6,8]罢了，让你直接为造神计划献身吧！",
        "\t[小粽,hero]\b[hero]你！",
        {
            "type": "setCurtain",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        "\t[???]住手！",
        {
            "type": "show",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        {
            "type": "playBgm",
            "name": "lolita3.mp3",
            "keep": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]仙琳？！！",
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        "\t[黯夜殇,E518]\b[this,6,8]你是.......仙子一族的人吗？",
        "\t[小粽,hero]\b[hero]仙琳，快跑！这个家伙是我们完全无法匹敌的存在！",
        "\t[仙琳,fairy]\b[this,6,7]小粽，你怎么了，这不像平时的你呢。",
        "\t[小粽,hero]\b[hero]？？？仙琳你在说些什么？",
        "\t[仙琳,fairy]\b[this,6,7]人家记得........你在面对强敌时，可从来没有说过什么气馁的话呢。",
        "\t[仙琳,fairy]\b[this,6,7]无论对面的实力是强还是弱，你都是给予对手你那最坚定的一面。",
        "\t[小粽,hero]\b[hero]这次不一样！对面这个家伙比我遇到的任何对手都要强大无数倍！！",
        "\t[小粽,hero]\b[hero]而仙琳你也看到了，就算是我与星钰联手施展出最强绝招都无法伤害他！",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        "\t[仙琳,fairy]\b[this,6,7]...嗯，我知道。",
        "\t[小粽,hero]\b[hero]你知道？",
        "\t[小粽,hero]\b[hero]你既然知道那为什么还要来？！你根本就不是这家伙的对手呀！",
        {
            "type": "playBgm",
            "name": "battle11.mp3",
            "keep": true
        },
        "\t[仙琳,fairy]\b[this,6,7]你与星姐姐做的已经做的够多了，就让我帮助你们收尾吧！",
        {
            "type": "insert",
            "loc": [
                12,
                12
            ]
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,12": [
            "随着仙琳语句的下落，仙琳的气息直接飙升到一个新的高度！",
            {
                "type": "setBlock",
                "number": "E957",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "time": 0
            },
            {
                "type": "callBook"
            },
            "\t[小粽,hero]\b[hero]仙琳，你...............",
            "\t[仙琳,fairy]\b[this,6,7]小粽，现在没时间解释了！赶紧带星姐姐离开这里！",
            "\t[黯夜殇,E518]\b[this,6,5]哦？有意思！有意思！！",
            "\t[黯夜殇,E518]\b[this,6,5]没想到魔塔历史书上所撰写的居然是真的！",
            "\t[黯夜殇,E518]\b[this,6,5]仙子一族拥对魔法拥有极高的领悟，可以通过秘术来提升自己的实力。",
            "\t[黯夜殇,E518]\b[this,6,5]不过这种秘术对你来说不过是饮鸩止渴罢了！",
            "\t[仙琳,fairy]\b[this,6,7]是吗？你可以试一试！",
            "\t[黯夜殇,E518]\b[this,6,5]黯魔·吞噬！",
            "\t[仙琳,fairy]\b[this,6,7]光明·驱散！",
            {
                "type": "playSound",
                "name": "139-Darkness02.ogg"
            },
            {
                "type": "animate",
                "name": "attack18",
                "loc": [
                    6,
                    7
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "aid1.ogg"
            },
            {
                "type": "animate",
                "name": "aid1",
                "loc": [
                    6,
                    7
                ]
            },
            "\t[黯夜殇,E518]\b[this,6,5]不错，不错，不愧是仙子一族的人，竟然对魔法的领悟达到了如此水平！",
            "\t[黯夜殇,E518]\b[this,6,5]可惜你是与本座为敌！",
            "\t[仙琳,fairy]\b[this,6,7](即使用秘术换取的力量也无法阻拦他么?......)",
            "\t[仙琳,fairy]\b[this,6,7]（看来只有最后一步了.........）",
            {
                "type": "pauseBgm"
            },
            {
                "type": "playBgm",
                "name": "Eternity1.mp3",
                "keep": true
            },
            "\t[仙琳,fairy]\b[this,6,7]喂！你叫黯夜殇是吧？！",
            "\t[黯夜殇,E518]\b[this,6,5]你想说什么？",
            "\t[仙琳,fairy]\b[this,6,7]既然你知道我们仙子一族可以通过秘术来提升自己的实力，但你有没有听说过另一个传说呢！",
            "\t[黯夜殇,E518]\b[this,6,5].................................",
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    5
                ]
            },
            "\t[黯夜殇,E518]\b[this,6,5]！！！你难道说的是！！！",
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    5
                ]
            },
            "\t[黯夜殇,E518]\b[this,6,5]不可能！不可能！！你才什么修为！怎么可能会掌握那种能力？？！",
            "\t[黯夜殇,E518]\b[this,6,5]仙子一族拥有这种能力的人除了那个存在以外，应该不可能有人能继承这种能力！！",
            "此时黯夜殇直冒冷汗，好像是十分忌惮那个存在。",
            "黯夜殇此时不再想的是炮制或解决他们，而是赶紧离开这里，向魔王汇报情况，因为这种情况已经不是他这个级别的人能够解决的了！",
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    5
                ]
            },
            "\t[黯夜殇,E518]\b[this,6,5]难道说！你是...............",
            "\t[仙琳,fairy]\b[this,6,7]没错！就是你想的那样哟。",
            "\t[仙琳,fairy]\b[this,6,7]就让你看看仙子一族真正的力量吧！",
            "\t[仙琳,fairy]\b[this,6,7]（话虽如此，但是我还是不舍......）",
            "\t[仙琳,fairy]\b[this,6,7]（一旦用了这种能力，我就会\r[red]死去！）",
            "\t[仙琳,fairy]\b[this,6,7]（那么.....准备开..............）",
            {
                "type": "playSound",
                "name": "stop1.wav"
            },
            {
                "type": "showImage",
                "code": 1,
                "image": "stop6.jpg",
                "loc": [
                    0,
                    0
                ],
                "opacity": 1,
                "time": 0,
                "async": true
            },
            "\t[???]...............................",
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "hideImage",
                "code": 1,
                "time": 0
            },
            {
                "type": "changeFloor",
                "floorId": ":next",
                "loc": [
                    11,
                    111
                ],
                "time": 0
            },
            {
                "type": "waitAsync"
            }
        ],
        "0,12": [
            "\t[仙琳]......时间线回到这里了吗？",
            "仙琳回忆起了以前的事情。",
            "三年前。",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "floorId": "MT158",
                "time": 0
            },
            {
                "type": "changeFloor",
                "floorId": "MT158",
                "loc": [
                    222,
                    22
                ],
                "direction": "up",
                "time": 0
            },
            {
                "type": "insert",
                "loc": [
                    12,
                    12
                ],
                "floorId": "MT158"
            }
        ],
        "0,0": [
            "\t[仙琳]对不起,外婆,我必须使用这股力量了",
            "\t[仙琳]虽说现在的我使用了这种力量后会灰飞烟灭,但是我并不后悔",
            "\t[仙琳]因为我已经找到了我人生中最重要的人了",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[仙琳]谢谢你,小粽,是你让我敞开了我那封闭的内心,是你让我学会了你们人类的情感",
            "\t[仙琳]那么这一次,就让我来——\\d守护你吧！",
            {
                "type": "playSound",
                "name": "Raise02.ogg"
            },
            {
                "type": "playBgm",
                "name": "lolita4.mp3",
                "keep": true
            },
            "仙琳在使用她体内这股力量的同时,这座魔塔的所有伟大存在都注意到了这股强大的力量",
            "圣羽洛斯的实验室内部",
            {
                "type": "changeFloor",
                "floorId": "MT445",
                "loc": [
                    111,
                    11
                ],
                "direction": "up",
                "time": 0
            },
            {
                "type": "insert",
                "loc": [
                    0,
                    0
                ],
                "floorId": "MT445"
            }
        ],
        "12,0": [
            {
                "type": "pauseBgm"
            },
            {
                "type": "autoSave"
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "playBgm",
                "name": "lolita4.mp3",
                "keep": true
            },
            {
                "type": "setBlock",
                "number": "E962",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "time": 0
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[仙琳,E962]\b[this,6,7]生死之道，尽在吾手！",
            "此时仙琳已经使用了她体内的生命力量，因为这股力量极其浓郁，从而改变了仙琳的外表！",
            {
                "type": "callBook"
            },
            "\t[小粽,hero]\b[hero]仙琳！你这究竟是..............",
            "\t[仙琳,E962]\b[this,6,7]小粽,这一次就让我守护你吧！",
            "\t[黯夜殇,E518]\b[this,6,5]这！这！这！这！这！神的威严？！这怎么可能！！！！！",
            "\t[黯夜殇,E518]\b[this,6,5]你到底是什么身份！就算是生命之森的那个存在也不可能有如此实力！！！",
            "\t[仙琳,E962]\b[this,6,7]我没有什么特别的身份！我就是我！只属于小粽的仙琳！！",
            "\t[仙琳,E962]\b[this,6,7]黯夜殇！你作恶多端！！现在就将你就地正法吧！！",
            "\t[黯夜殇,E518]\b[this,6,5]不！不！！不！！！我乃是魔塔最高势力三圣阁的阁主！我怎么可能死在这里！！",
            "\t[仙琳,E962]\b[this,6,7]生命·创世！",
            {
                "type": "animate",
                "name": "attack17",
                "loc": [
                    6,
                    5
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "VXIce8.ogg"
            },
            {
                "type": "sleep",
                "time": 150
            },
            {
                "type": "playSound",
                "name": "VXFire4.ogg"
            },
            {
                "type": "sleep",
                "time": 90
            },
            {
                "type": "playSound",
                "name": "VXBreath.ogg"
            },
            {
                "type": "sleep",
                "time": 90
            },
            {
                "type": "playSound",
                "name": "spark1.wav"
            },
            {
                "type": "setCurtain",
                "color": [
                    255,
                    255,
                    255,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "\t[黯夜殇,E518]啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "remove": true,
                "time": 0
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "playBgm",
                "name": "Eternity1.mp3",
                "keep": true
            },
            "在仙琳使用出生命·创世之后，黯夜殇的灵魂灰飞烟灭了。",
            "不过由于仙琳过度使用力量强行达到抗击神的层次，导致仙琳被这股力量给反噬了。",
            "\t[仙琳,E962]\b[this,6,7]噗！！咳咳咳！！",
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            "仙琳由于被这股力量反噬直接吐出了一口鲜血。",
            "伴随着鲜血而来的,则是身体的消亡.....",
            "\t[小粽,hero]\b[hero]仙琳！你怎么了！你不要出事呀！！",
            "小粽直接抱住仙琳，似乎是非常害怕仙琳会出事。",
            "\t[仙琳,E962]\b[this,6,7]小....粽,我很快就要走了，我以后再也不能陪伴在你的身边了。",
            "\t[小粽,hero]\b[hero]仙琳！你...你不会在开玩笑吧？这个玩笑可一点也不好笑呀！",
            "\t[仙琳,E962]\b[this,6,7]不....我说的都是真的，这...并不是玩笑...。",
            "\t[仙琳,E962]\b[this,6,7]噗！！咳咳咳！！",
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            "\t[仙琳,E962]\b[this,6,7]其实...这股力量，是要以我生命的代价才能使用的....不然....我也不可能在短时间内拥有如此实力......。",
            "\t[小粽,hero]\b[hero]为什么！为什么你要这么做啊！！明明知道你用了这股力量就一定会死，为什么还要这么去做啊！！",
            "\t[仙琳,E962]\b[this,6,7]因为....我也想.....像你一样，为了保护.....自己最珍视的人，即使是.....面对死亡也......无所畏惧！",
            "\t[仙琳,E962]\b[this,6,7]噗！！咳咳咳！！",
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            "\t[小粽,hero]\b[hero]仙琳！别说了，你现在不能再说话了。",
            "\t[小粽,hero]\b[hero]我现在带你去你外婆那，你外婆一定有办法可以救你的！",
            "\t[仙琳,E962]\b[this,6,7]不...没用的，时间已经来不及了....",
            "\t[仙琳,E962]\b[this,6,7]噗！！咳咳咳！！",
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            "\t[仙琳,E962]\b[this,6,7]而且如果再不说...就没有机会了........。",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[仙琳,E962]\b[this,6,7]我希望有朝一日可以离开这座魔塔，去你们的人类世界...但现在我没有机会了.......。",
            "\t[仙琳,E962]\b[this,6,7]所以我希望..............小粽你可以......能够把我与你的这份记忆......埋藏在你内心的最深处，等到你离开魔塔的时候.........就当我...还在你身边吧...............。",
            "\t[小粽,hero]\b[hero]不！仙琳！你不要离开我！我要的是与你本人一起去看我们的人类世界呀！",
            "\t[仙琳,E962]\b[this,6,7]我也想这样呀....可是我已经要不行了.....。",
            "\t[仙琳,E962]\b[this,6,7]其实呀....在去音律塔之前的那个晚上，我做了一个梦...。",
            "\t[仙琳,E962]\b[this,6,7]梦到我们离开了这座魔塔........，而且就像童话所描述的那样幸福快乐的生活在一起呢....。",
            "\t[仙琳,E962]\b[this,6,7]那个梦真的是我做过的最美好的梦呢。",
            "\t[仙琳,E962]\b[this,6,7]时间差不多了，小粽，我...就要离开了呢...你不要伤心哟！",
            "\t[小粽,hero]\b[hero]仙琳！！！不要！！",
            "此时仙琳反手搂住小粽，给予了小粽她那最美好的一个初吻。",
            "\t[小粽,hero]\b[hero]仙琳？！！！",
            "\t[仙琳,E962]\b[this,6,7]这是我的初吻，这样我在黄泉路上就不会太担心了哟。",
            "\t[仙琳,E962]\b[this,6,7]再见了，小粽，谢谢你教会了你们人类的情感，在未来的道路上你一定要好好活着哟！",
            {
                "type": "pauseBgm"
            },
            {
                "type": "playBgm",
                "name": "GG2.mp3",
                "keep": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "remove": true,
                "time": 0
            },
            "随着仙琳语气的下落，仙琳的身躯化成了灰烬，并且消散于在这天地之间..................唯独留下了当初外婆给她的遗物...........。",
            "小粽此时拿起了这个遗物，随着回忆起了他与仙琳过往的一切..................。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "changeFloor",
                "floorId": "MT238",
                "loc": [
                    6,
                    1
                ],
                "direction": "down",
                "time": 500
            }
        ],
        "6,0": [
            "\t[仙琳]再见了，小粽，谢谢你教会了你们人类的情感，在未来的道路上你一定要好好活着哟！",
            {
                "type": "playSound",
                "name": "051-Explosion04.ogg"
            },
            "\t[小粽]仙..............琳.................。",
            {
                "type": "pauseBgm"
            },
            "伴随着一种沉重的声音，小粽由于极度悲伤,晕倒在了阳之坛中..........。",
            "不知过了多久。",
            "\t[???]应该就是这里了，前辈最后的气息就消散了这里了。",
            "\t[???]嗯？这怎么回事，为什么人类的勇者与星钰倒在了这里..............。",
            "\t[???]看来得把他们带回去再问具体情况了...。",
            "小粽与星钰被神秘人给带走了.........",
            "与此同时梦去了生命之森了解了一些情况，发现仙月并没有成神，梦与仙月单独交谈了一会后梦就直接走了....。",
            "而此时整座魔塔都陷入一种腥风血雨当中，小粽和星钰未来究竟会如何呢，堇究竟是生是死呢？仙琳未来会不会有机会复活呢？圣羽洛斯究竟要完成什么实验呢？魔王是否能够完成造神计划呢？",
            "尽情期待第四章——\\d生死之念！",
            {
                "type": "insert",
                "loc": [
                    0,
                    12
                ],
                "floorId": "MT233"
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80033,80033,80033,80033,80033,80033,80033,80027],
    [80026,80040,80041,80041,80041,80067,80065,80066,80041,80041,80041,80042,80024],
    [80026,80048,80049,80049,80049,80075,80073,80074,80049,80049,80049,80050,80024],
    [80026,80056,80057,80057,80057,80083,80073,80082,80057,80057,80057,80058,80024],
    [80026,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80024],
    [80026,159,159,  0,  0,  0,518,  0,  0,  0,159,159,80024],
    [80026,159,159,  0,  0,  0,  0,  0,  0,  0,159,159,80024],
    [80026,159,159,  0,  0,  0,124,  0,  0,  0,159,159,80024],
    [80026,159,159,  0,  0,  0,826,  0,  0,  0,159,159,80024],
    [80026,159,159,  0,  0,  0,  0,  0,  0,  0,159,159,80024],
    [80026,159,159,  0,  0,  0,  0,  0,  0,  0,159,159,80024],
    [80026,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80024],
    [80020,80017,80017,80017,80017,80018,  0,80016,80017,80017,80017,80017,80019]
],
    "bgmap": [
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80164,80078,80131,80132,80133,  0,80131,80132,80133,80078,80164,  0],
    [  0,80172,80086,80139,80140,80141,  0,80139,80140,80141,80086,80172,  0],
    [  0,80180,150039,80147,80148,80149,  0,80147,80148,80149,150039,80180,  0],
    [  0,  0,150047,80155,80156,80157,  0,80155,80156,80157,150047,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,150039,  0,150162,150163,  0,150178,150179,  0,150039,  0,  0],
    [  0,  0,150047,  0,150170,150171,  0,150186,150187,  0,150047,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,150123,  0,  0,  0,  0,  0,  0,  0,  0,  0,150123,  0],
    [  0,150131,  0,  0,  0,  0,  0,  0,  0,  0,  0,150131,  0],
    [  0,150139,  0,150037,  0,  0,  0,  0,  0,150037,  0,150139,  0],
    [  0,  0,  0,150045,  0,  0,  0,  0,  0,150045,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,150037,  0,  0,  0,  0,  0,150037,  0,  0,  0],
    [  0,  0,  0,150045,  0,  0,  0,  0,  0,150045,  0,  0,  0],
    [  0,150123,  0,  0,  0,  0,  0,  0,  0,  0,  0,150123,  0],
    [  0,150131,  0,150037,  0,  0,  0,  0,  0,150037,  0,150131,  0],
    [  0,150139,  0,150045,  0,  0,  0,  0,  0,150045,  0,150139,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}