main.floors.MT231=
{
    "floorId": "MT231",
    "title": "阳之坛之巅",
    "name": "阳之坛之巅",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 20000000,
    "defaultGround": "ground",
    "bgm": "spendid1.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "spendid1.mp3",
            "keep": true
        },
        {
            "type": "moveHero",
            "time": 200,
            "steps": [
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                12
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]你们是.............",
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[圣护之手·天,E520]\b[this,6,4]了不起！没想到你们居然有如此实力，数十位圣护之手的围剿都不能解决掉你们呢！",
        "\t[圣护之手·天,E520]\b[this,6,4]自我介绍一下，吾乃圣护之手·天！",
        "\t[圣护之手·地,E955]\b[this,5,5]吾乃圣护之手·地！",
        "\t[圣护之手·人,E956]\b[this,7,5]吾........吾乃圣护之手·人！你.......你们束手就擒吧！",
        "\t[圣护之手·地,E955]\b[this,5,5]人弟，你能不能不要在这个时候紧张啊，你这样很丢我们圣护之手的颜面！",
        "\t[圣护之手·人,E956]\b[this,7,5]我.....我........",
        "\t[圣护之手·地,E955]\b[this,5,5]哎！算了,你这个问题看来是改不了了！",
        "\t[小粽,hero]\b[hero]....................",
        "\t[星钰,N1196]\b[hero,1]哦？圣护之手天地人吗？有趣！",
        "\t[星钰,N1196]\b[hero,1]我有个问题呀，圣护之手·地对圣护之手·人叫人弟，那圣护之手·天是不是要叫圣护之手·地为\\d“地弟”呀！",
        "\t[圣护之手·地,E955]\b[this,5,5]小婊子！你特么找死！！",
        "\t[圣护之手·天,E520]\b[this,6,4]冷静！",
        "\t[圣护之手·地,E955]\b[this,5,5]是！大哥",
        "\t[圣护之手·天,E520]\b[this,6,4]星钰呀，星钰，你本来是除了剑神星尊以外最优秀的星尊，以你的资质，即使到了我们这里的阴阳圣坛也算得上是顶尖人物了。",
        "\t[圣护之手·天,E520]\b[this,6,4]结果你却勾搭上人类勇者，而且还妄图颠覆整个魔塔世界！",
        "\t[圣护之手·天,E520]\b[this,6,4]你这就叫做自毁前程！",
        "\t[星钰,N1196]\b[hero,1]哼！圣羽洛斯的走狗罢了，乱叫什么！你真当我怕你不成？！",
        "\t[圣护之手·地,E955]\b[this,5,5]大哥！别拦着我！！老子现在要把这个贱人千刀万剐！！！",
        "\t[圣护之手·天,E520]\b[this,6,4]............也罢，既然你不领情，那就只能请你去死了！！",
        {
            "type": "moveHero",
            "time": 50,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                5
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                5
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                4
            ]
        },
        "\t[小粽,hero]\b[hero]那得问过我才行！",
        "\t[圣护之手·人,E956]\b[this,7,5]你......你不要过来啊！！！！",
        "\t[圣护之手·地,E955]\b[this,5,5]那就先拿你开刀吧！小鬼！！",
        {
            "type": "battle",
            "id": "E956"
        },
        "\t[圣护之手·人,E956]\b[this,7,5]呃啊啊啊啊！！！我要去世了！！",
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    5
                ]
            ],
            "remove": true,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 50
        },
        {
            "type": "battle",
            "id": "E955"
        },
        "\t[圣护之手·地,E955]\b[this,5,5]不...不可能！你们为什么会有这么强大的力量！！",
        "\t[圣护之手·地,E955]\b[this,5,5]不！呃啊啊啊啊啊啊啊啊啊啊啊啊啊！！！",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[小粽,hero]\b[hero]那么现在就只剩下你了！",
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "good.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[圣护之手·天,E520]\b[this,6,4]厉害！厉害！看来我之前还是小看你们了呢，没想到连他们两个都被你们给斩杀了呢。",
        "\t[圣护之手·天,E520]\b[this,6,4]虽说他们两个性格有缺陷，但是他们可是这阴阳圣坛中最顶尖的存在....",
        "\t[圣护之手·天,E520]\b[this,6,4]但没想到你们的潜力居然如此之大，远远超出了我的预料呢。",
        "\t[星钰,N1196]\b[hero,1]哼！圣羽洛斯的走狗，你害怕了吗？！",
        "\t[圣护之手·天,E520]\b[this,6,4]害怕？啊哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！",
        "\t[圣护之手·天,E520]\b[this,6,4]诶，我说你们两个，不就是打败了我两个小弟吗?居然还如此嚣张，真当自己天下无敌了吗！",
        "\t[星钰,N1196]\b[hero,1]天下无敌？那到没有。",
        "\t[星钰,N1196]\b[hero,1]不过对付你这样的走狗还是绰绰有余的！！",
        "\t[圣护之手·天,E520]\b[this,6,4]很好！很好！！现在的小孩子到是越来越嚣张了呢，我倒要看看你们的实力是否像你们嘴那样强硬呢！",
        "\t[小粽,hero]\b[hero]星钰，不要大意！这家伙的实力要比刚才那两个要强得多！",
        "\t[星钰,N1196]\b[hero,1]我知道！！看招！",
        "\t[圣护之手·天,E520]\b[this,6,4]来！",
        {
            "type": "battle",
            "id": "E520"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        "\t[圣护之手·天,E520]\b[this,6,4]噗！！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[圣护之手·天,E520]\b[this,6,4]不可能！不可能！！区区两个小鬼怎么可能击败我？！",
        "\t[星钰,N1196]\b[hero,1]呼.....呼...看来你现在变成癞皮狗了呢！",
        "\t[圣护之手·天,E520]\b[this,6,4]为什么！圣羽洛斯大人！在您的帮助下，我明明已经达到三圣之巅精英级别的水平了，为什么会对付不了这两个小鬼？！！",
        "\t[圣护之手·天,E520]\b[this,6,4]为什么啊啊啊啊啊啊啊！！！",
        "\t[小粽,hero]\b[hero]他要爆炸了！小心！！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "floorId": "MT232",
            "time": 0
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "floorId": "MT232",
            "time": 0
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "floorId": "MT232",
            "time": 0
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "remove": true,
            "time": 0
        },
        {
            "type": "changeFloor",
            "floorId": "MT445",
            "loc": [
                111,
                5
            ],
            "time": 0
        },
        {
            "type": "hideStatusBar"
        },
        {
            "type": "insert",
            "loc": [
                12,
                12
            ],
            "floorId": "MT445"
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,12": [
            "\t[小粽,hero]\b[hero]好险，刚才差点被炸死。",
            "\t[星钰,N1196]\b[hero,1]嗯，不过看起来光明圣石不在他身上，我们得在附近继续寻找才行。",
            "\t[小粽,hero]\b[hero]好。",
            "\t[星钰,N1196]\b[hero,1]（刚才那个，服用的药剂是伪劣药剂导致自己自爆吗？）",
            "\t[星钰,N1196]\b[hero,1]（圣羽洛斯！居然连他自己的部署都不放过！！）",
            "接下来就是纯剧情了，如果是要刷榜的话可以选择直接到结局处。",
            {
                "type": "choices",
                "text": "是否跳过剧情？",
                "choices": [
                    {
                        "text": "是",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "sleep",
                                "time": 500
                            },
                            {
                                "type": "unfollow",
                                "name": "xy.png"
                            },
                            {
                                "type": "insert",
                                "loc": [
                                    0,
                                    12
                                ],
                                "floorId": "MT233"
                            }
                        ]
                    },
                    {
                        "text": "不是",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            "不知过了多久，小粽与星钰他们终于找到了阴阳圣坛的至宝——光明圣石！",
                            {
                                "type": "changeFloor",
                                "floorId": ":next",
                                "loc": [
                                    6,
                                    13
                                ],
                                "direction": "up",
                                "time": 0
                            },
                            {
                                "type": "hide",
                                "remove": true,
                                "time": 0
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80034, 91,80032,80033,80033,80033,80033,80027],
    [80026,80040,80041,80041,80041,80067,  0,80066,80041,80041,80041,80042,80024],
    [80026,80048,80049,80049,80049,80075,  0,80074,80049,80049,80049,80050,80024],
    [80026,80056,80057,80057,80057,80083,  0,80082,80057,80057,80057,80058,80024],
    [80026,159,80155,80156,80157,  0,520,  0,80155,80156,80157,159,80024],
    [80026,159,  0,  0,  0,955,  0,956,  0,  0,  0,159,80024],
    [80026,159,  0,  0,  0,  0,  0,  0,  0,  0,  0,159,80024],
    [80026,159,  0,  0,  0,  0,  0,  0,  0,  0,  0,159,80024],
    [80026,159,159,  0,  0,  0,  0,  0,  0,  0,159,159,80024],
    [80026,159,159,159,  0,  0,  0,  0,  0,  0,159,159,80024],
    [80026,159,159,159,159,  0,  0,  0,159,159,159,159,80024],
    [80026,159,159,159,159,159,  0,159,159,159,159,159,80024],
    [80020,80017,80017,80017,80017,80018,  0,80016,80017,80017,80017,80017,80019]
],
    "bgmap": [
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80087,80131,80132,80133,  0,  0,  0,80131,80132,80133,80087,  0],
    [  0,  0,80139,80140,80141,  0,  0,  0,80139,80140,80141,  0,  0],
    [  0,  0,80147,80148,80149,  0,  0,  0,80147,80148,80149,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}