main.floors.MT241=
{
    "floorId": "MT241",
    "title": "堇之家（回忆）",
    "name": "堇之家（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "defaultGround": "ground",
    "color": [
        92,
        92,
        92,
        0.27
    ],
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "setCurtain",
            "color": [
                92,
                92,
                92,
                0.27
            ],
            "time": 0,
            "keep": true
        },
        "\t[小粽,hero]\b[hero]这...这是哪里？",
        "\t[仙琳,fairy]\b[this,4,3]呀！小粽你终于醒了！",
        "\t[小粽,hero]\b[hero]仙琳？我这是在哪里，我之前不是在登天之巅吗？",
        "\t[仙琳,fairy]\b[this,4,3]这里是堇姐姐的家",
        "\t[小粽,hero]\b[hero]什么？！",
        "\t[仙琳,fairy]\b[this,4,3]诶！你先别起来，你的伤势还没有恢复呢。",
        "\t[小粽,hero]\b[hero]不用了，已经没什么大碍了。",
        {
            "type": "moveHero",
            "time": 200,
            "steps": [
                "left",
                "down",
                "down",
                "right",
                "right",
                "up"
            ]
        },
        "\t[小粽,hero]\b[hero]还有，仙琳你说这里是堇的家？！！",
        "\t[仙琳,fairy]\b[this,4,3].....是",
        "\t[小粽,hero]\b[hero]..........................",
        "\t[小粽,hero]\b[hero]仙琳！你之前说你那个什么堇姐姐只对剑感兴趣，你告诉只用相互切磋就行了。",
        "\t[仙琳,fairy]\b[this,4,3].....这......应该是这样....",
        "\t[小粽,hero]\b[hero]结果呢？！你口中说的什么堇姐姐她实际上就是个变态！差点把我给虐杀的变态！",
        "\t[小粽,hero]\b[hero]早在之前我就对你的身份感到些奇怪，只是没有什么依据罢了！",
        "\t[小粽,hero]\b[hero]告诉我，你的目的究竟是什么？！",
        {
            "type": "vibrate",
            "time": 500
        },
        "\t[仙琳,fairy]\b[this,4,3].....小粽，我知道你现在在想些什么。",
        "\t[仙琳,fairy]\b[this,4,3]或许你会感到疑惑，感到不安，甚至感到愤怒。",
        "\t[仙琳,fairy]\b[this,4,3]或许我告诉了你一些事情之后，你会第一时间无法接受。",
        "\t[仙琳,fairy]\b[this,4,3]但是事实的真相绝对不是你想象的那样........",
        "\t[小粽,hero]\b[hero]那究竟是什么？！！",
        "\t[???]不要在逼仙琳妹妹了，让我来告诉你你想要知道的一切。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "changePos",
            "loc": [
                4,
                4
            ],
            "direction": "down"
        },
        "\t[小粽,hero]\b[hero]这声音是.....！",
        {
            "type": "show",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "floorId": "MT107",
            "time": 1
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "left",
                "up",
                "left",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1417",
            "loc": [
                [
                    4,
                    7
                ]
            ],
            "time": 0
        },
        "\t[小粽,hero]\b[hero]是你！！",
        {
            "type": "animate",
            "name": "buff1",
            "loc": "hero"
        },
        "\t[仙琳,fairy]\b[this,4,3]小粽，不要冲动呀！",
        "\t[小粽,hero]\b[hero]..............",
        "\t[堇,N1417]\b[this,4,7]仙琳妹妹，你先到我这来，我再慢慢告诉他。",
        "\t[仙琳,fairy]\b[this,4,3]小粽........",
        "\t[小粽,hero]\b[hero]..............我要得知这一切的真相，你去吧。",
        "\t[仙琳,fairy]\b[this,4,3].....好",
        {
            "type": "move",
            "loc": [
                4,
                3
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "right",
                "down",
                "down",
                "down",
                "down",
                "down"
            ]
        },
        "\t[小粽,hero]\b[hero]现在我可以问你了吧？！",
        "\t[堇,N1417]\b[this,4,7]你问吧。",
        "\t[小粽,hero]\b[hero]第一个问题就是关于你！",
        "\t[堇,N1417]\b[this,4,7].....你指的是在这不久之前与你对决时出现的异变吧。",
        "\t[堇,N1417]\b[this,4,7]之所以我在最后的时候性情大变.....是因为我的体内有一缕非常恐怖的黑暗之力！",
        "\t[小粽,hero]\b[hero]黑暗之力？？",
        "\t[堇,N1417]\b[this,4,7]对！就是黑暗之力，这一缕黑暗之力很早以前就出现在我的体内，开始潜移默化的影响我。",
        "\t[堇,N1417]\b[this,4,7]就连我也不知道这一缕黑暗之力是从何而来。",
        "\t[小粽,hero]\b[hero].......你曾有尝试过回忆这一缕黑暗之力是从哪来的吗？",
        "\t[堇,N1417]\b[this,4,7]我试过，可是每当回忆的时候头就特别痛，似乎是有什么东西阻断我的回忆，类似于另一个人格。",
        "\t[堇,N1417]\b[this,4,7]而且在回忆的时候这一缕黑暗之力对我的侵蚀就会大大加深。",
        "\t[堇,N1417]\b[this,4,7]一旦这一缕黑暗之力对我的侵蚀达到一个临界点时，我就会暂时失去属于自我的意识，变成一个毫无感情波动的工具人",
        {
            "type": "pauseBgm"
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]原来如此.....你这种黑暗之力应该也会不间断的受到外来环境的影响而加深它的侵蚀。",
        "\t[堇,N1417]\b[this,4,7]的确如此，就比如这个东西。",
        "\t[小粽,hero]\b[hero]！！！这是我母亲的项链。",
        "\t[堇,N1417]\b[this,4,7]这个东西我不知道为什么感觉在哪里见过....",
        "\t[小粽,hero]\b[hero]啊？",
        "\t[堇,N1417]\b[this,4,7]但是我怎么想也想不出来是在哪里见过.....",
        "\t[堇,N1417]\b[this,4,7]算了，既然想不起来，就把这个项链还给你吧。",
        "小粽拿回了堇手上的项链，小粽仔细一看，发现与之前相比，项链的色泽更加鲜艳了。",
        "\t[小粽,hero]\b[hero]....真是麻烦你在这些天照顾好它了。",
        "\t[小粽,hero]\b[hero]之前对你说的一些非礼的话真是深感抱歉。",
        "\t[堇,N1417]\b[this,4,7]没关系，我能理解你当时的心情。",
        "\t[堇,N1417]\b[this,4,7]第二个问题就是关于仙琳妹妹的真实目的吧。",
        "\t[小粽,hero]\b[hero]嗯。",
        "堇那冰冷的面容此时露出了一丝玩味的表情",
        "\t[堇,N1417]\b[this,4,7]仙琳妹妹，是我说，还是你说呢？",
        "\t[仙琳,fairy]\b[this,5,8]啊？啊！？",
        "\t[仙琳,fairy]\b[this,5,8]堇姐姐你在说些什么呢！",
        "\t[小粽,hero]\b[hero]什么情况？你们在说些什么。",
        "\t[堇,N1417]\b[this,4,7]嗯....算了，那就换个替代吧!",
        "\t[小粽,hero]\b[hero]什么替代？",
        "\t[堇,N1417]\b[this,4,7]嗯.....反正仙琳妹妹肯定不会对你不利的，我也就帮你个忙。",
        "\t[堇,N1417]\b[this,4,7]我去潜入这座高塔的第三个大区域：阴阳圣坛中的阴之坛，为你们搜集些有关这座高塔的核心情报。",
        "\t[小粽,hero]\b[hero]你可以直接去第三个大区域？？！",
        "\t[堇,N1417]\b[this,4,7]嗯，我有一种秘法可以直接打破空间限制去第三个区域。",
        "\t[堇,N1417]\b[this,4,7]但这种秘法只能我一个人使用，如果你们要去第三个区域的话就必须打败我们四星尊，拿到身份符。",
        "\t[堇,N1417]\b[this,4,7]然后每一个都输入相同的力量，形成一个小隧道进入第三区域。",
        "\t[仙琳,fairy]\b[this,5,8]堇姐姐，这会不会太危险了？",
        "\t[堇,N1417]\b[this,4,7]这是我应该做的，毕竟我感觉我体内黑暗之力的来源和解决方法应该就藏在第三个区域里。",
        "\t[仙琳,fairy]\b[this,5,8]但是........",
        "\t[堇,N1417]\b[this,4,7]那我就说出来了，这样我也不用.....",
        "\t[仙琳,fairy]\b[this,5,8]啊...啊！堇姐姐，我....",
        "\t[堇,N1417]\b[this,4,7]好了，我们可是好姐妹呢，有些话姐姐我决对不会乱说的。",
        "\t[堇,N1417]\b[this,4,7]嗯....小粽！我就只能帮你到这了，剩下的三星尊得靠你自己解决了。",
        "\t[小粽,hero]\b[hero]....接下来的顺序应该是体之巅，音之巅，器之巅。",
        "\t[堇,N1417]\b[this,4,7]嗯，体之巅对现在的你来说问题不是很大了，器之巅的星钰妹妹我和仙琳妹妹到时会说的，不会让她对你有什么不利。",
        "\t[堇,N1417]\b[this,4,7]关键是音之巅的星尊，你要特别留意。",
        "\t[堇,N1417]\b[this,4,7]在对决的时候一定要守住本心。",
        "\t[堇,N1417]\b[this,4,7]我就告诉你这么多了，剩下的得靠你自己去摸索吧。",
        "\t[小粽,hero]\b[hero]感谢你的教导！",
        "\t[小粽,hero]\b[hero]不过我究竟昏迷了多久？",
        "\t[堇,N1417]\b[this,4,7]差不多一个星期吧。",
        "\t[小粽,hero]\b[hero]啊？这么久？！",
        "\t[堇,N1417]\b[this,4,7]呵呵，不废话了，我得赶紧去准备了。",
        "\t[堇,N1417]\b[this,4,7]再见了，仙琳妹妹，小粽。",
        "\t[仙琳,fairy]\b[this,5,8]堇姐姐你一定要小心呀！",
        "\t[堇,N675]\b[this,4,7]嗯，我会小心的。",
        "\t[小粽,hero]\b[hero]麻烦你了！",
        "\t[堇,N1417]\b[this,4,7]你也要小心，不要出什么意外了,",
        "\t[堇,N1417]\b[this,4,7]如果以后还有机会，我希望再一次与你论剑！",
        "\t[小粽,hero]\b[hero]嗯！一定会的！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": ":next",
            "loc": [
                6,
                10
            ],
            "direction": "down",
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20,10016,10017,10017,10017,10017,10017,10017,10017,10018, 20, 20],
    [ 20, 20,10024,181430,10025,10025,10025,10025,10025,10025,10026, 20, 20],
    [ 20, 20,  0,  0,124,  0,  0,  0,  0,  0,  0, 20, 20],
    [ 20, 20,  0,181446,  0,  0,  0,  0,  0,  0,  0, 20, 20],
    [ 20, 20,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20, 20],
    [ 20, 20,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20, 20],
    [ 20, 20,  0,  0,  0,  0,  0,181019,181020,181021,  0, 20, 20],
    [ 20, 20,  0,  0,  0,  0,  0,181027,181028,181029,  0, 20, 20],
    [ 20,10018,10094,  0,  0,  0,  0,181035,181036,181037,10094,10016, 20],
    [ 20,10026,10102,  0,  0,  0,  0,  0,  0,  0,10102,10024, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20, 20, 20, 20, 20, 20,675, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,10111,170039,10120,10121,10122,  0,180702,180703,  0,  0],
    [  0,  0,  0,  0,170047,10128,10129,10130,181153,180710,180711,  0,  0],
    [  0,  0,  0,181438,  0,10136,10137,10138,181161,180718,180719,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,181295,170198,170199,  0,181311,  0,  0],
    [  0,  0,  0,  0,  0,  0,181303,  0,10161,10162,181319,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,181307,  0,181307,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,10025,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,180531,180532,180533,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,180539,180540,180541,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,180547,180548,180549,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}