main.floors.MT243=
{
    "floorId": "MT243",
    "title": "星天的家",
    "name": "星天的家",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "defaultGround": "ground",
    "color": null,
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]仙琳！！！",
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "right",
                "down"
            ]
        },
        "\t[???,N592]\b[this,2,8]看来，你终于醒了呀。",
        {
            "type": "move",
            "loc": [
                2,
                8
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "right",
                "right",
                "up",
                "up",
                "up",
                "left",
                "left"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1195",
            "loc": [
                [
                    2,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "backward"
            ]
        },
        "\t[小粽,hero]\b[hero]你是谁！想对我做些什么？！",
        "\t[???,N1195]\b[this,2,5]诶，放轻松，我对你并没有恶意。",
        "\t[小粽,hero]\b[hero]我不信！你有什么证据证明你自己吗？！",
        "\t[???,N1195]\b[this,2,5]证据吗？在我说了几句话之后...你一定会相信我说的一切。",
        "\t[小粽,hero]\b[hero]什么话？",
        "\t[星天,N1195]\b[this,2,5]自我介绍一下，我的名字叫星天，是星钰的父亲！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]啊？你是星钰的父亲吗？!",
        "\t[星天,N1195]\b[this,2,5]是的，在当年我星家被灭族之后，\n我为了保护好我星家最后的血脉，\n特意把星钰这孩子送到了四星尊天的领域去了。",
        "\t[星天,N1195]\b[this,2,5]你是不是很好奇我为什么会这么去做吗？",
        "\t[小粽,hero]\b[hero](点头）",
        "\t[星天,N1195]\b[this,2,5]其实我们这座魔塔各个区域的空间是被严格划分的，\n高等领域的生物去偏低等的领域是被严格禁止的！\n而且所付出的代价非常大！！",
        "\t[星天,N1195]\b[this,2,5]而低等一些的生物去高等领域....\n在这一点上,是以一种十分支持的态度！",
        "\t[星天,N1195]\b[this,2,5]因为高等领域所给予的福利和身份，\n对于低等一些的生物来说是非常诱人的！",
        "\t[星天,N1195]\b[this,2,5]在这种利益的趋势下，他们就会努力提升自己的实力，\n目的就是能被更高区域的人物所重视,并且加以培养！",
        "\t[星天,N1195]\b[this,2,5]但这种利益的争夺却会导致整座魔塔的内斗，\n各大势力为了巩固自己的利益，从而牵涉甚至危害到其他人..........。",
        "\t[星天,N1195]\b[this,2,5]哎，就是因为魔塔内部存在着这种体系，\n从而导致了我星家的灭亡了.....。",
        "\t[星天,N1195]\b[this,2,5]好像我刚才说的有点跑题了，就让我直接说正题吧！",
        "\t[星天,N1195]\b[this,2,5]由于我星家的灭亡，阴阳圣坛及以上的区域正在如狼似虎一般瓜分我星家的遗产，\n他们那个时候根本不会去管四星尊天这个低等区域，\n所以把星钰这孩子送到四星尊天是最好的选择。",
        "\t[星天,N1195]\b[this,2,5]让她在那里生活着。",
        "\t[小粽,hero]\b[hero]我有一个问题，\n我记得星钰她是四星尊天四大星尊中的造物星尊，\n是四星尊天其中一位主管者。",
        "\t[小粽,hero]\b[hero]她的身份对于魔塔高层来说是了如指掌的吧！",
        "\t[小粽,hero]\b[hero]而你之前跟我说，\n你是为了保护星钰才把她送到四星尊天去的吧，\n正确的做法应该是隐姓埋名才对吧！",
        "\t[小粽,hero]\b[hero]但是她现在是四星尊天的主管者！\n这你该怎么解释呢？！",
        "\t[星天,N1195]\b[this,2,5]......................",
        "\t[星天,N1195]\b[this,2,5]因为在当时我只能送一个人到四星尊天去，\n我不能待在星钰这孩子身边，\n而且我要时时刻刻隐瞒自己，不能被魔塔高层所发现。",
        "\t[星天,N1195]\b[this,2,5]不然我们父女俩就会被他们给彻底抹杀！",
        "\t[星天,N1195]\b[this,2,5]所以我让星钰这孩子带着我的信物去四星尊天寻求帮助。",
        "\t[小粽,hero]\b[hero]让星钰去寻求帮助？找谁？",
        "\t[星天,N1195]\b[this,2,5]我早年认识的一位前辈....我让星钰去生命之森找那位前辈。",
        "\t[小粽,hero]\b[hero]（生命之森.....仙琳的故乡吗？）",
        "\t[星天,N1195]\b[this,2,5]不过后来我也没有想到，\n前辈她居然让她参加了四星尊天的星尊争霸赛！",
        "\t[小粽,hero]\b[hero]星尊争霸赛？",
        "\t[星天,N1195]\b[this,2,5]那是一场四星尊天内部的争霸赛，\n在当时魔塔高层似乎是为了完成些什么计划，\n没有派人去督战那场星尊争霸赛。",
        "\t[星天,N1195]\b[this,2,5]只是在结束的时候把名字传到了阴阳圣坛那里去记录。",
        "\t[小粽,hero]\b[hero]那他们看到星钰的名字不会产生怀疑吗？",
        "\t[星天,N1195]\b[this,2,5]哈哈，不一定姓星的人就一定是星家呀，\n魔塔内这么多魔物,姓为星的魔物太多了，\n他们哪有兴趣查这个呢。",
        "\t[小粽,hero]\b[hero]这样吗？.........",
        "\t[星天,N1195]\b[this,2,5]好了，你想知道的我都告诉你了，\n那么现在我要问一下有关于你的情况了。",
        "\t[小粽,hero]\b[hero]..........哎，是这样的...............",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "小粽把他旅途的历程都说了一遍，\n其中包括诸多人物:堇,罗天,星钰,以及母亲与仙琳。",
        "不知过了多久。",
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        "\t[小粽,hero]\b[hero]..........就是这样的，仙琳为了保护我和星钰，\n以自身生命为代价毁灭了三圣阁的黯夜殇.......。",
        "\t[星天,N1195]\b[this,2,5]............................是吗,看来你经历了许多呀..........。",
        "\t[星天,N1195]\b[this,2,5]我知道你内心现在很悲伤，\n但是你那朋友仙琳，\n为了让你好好的活着而献出了自己的生命。",
        "\t[星天,N1195]\b[this,2,5]就是希望你能达到这个世界的巅峰，\n达到战胜魔王的存在，从而离开这座魔塔！",
        "\t[星天,N1195]\b[this,2,5]而现在你不应该悲天悯人，\n因为这对于现实来说没有任何帮助！",
        "\t[小粽,hero]\b[hero].....是...我知道。",
        "\t[小粽,hero]\b[hero]但是！如果在当时我有力量的话，\n星钰她就不会昏迷不醒,而仙琳她更不会因此而死！",
        "\t[星天,N1195]\b[this,2,5]你说这些有什么用吗？！！",
        "星天突然一阵怒吼让小粽清醒过来了！",
        "\t[星天,N1195]\b[this,2,5]如果你现在再这么费靡不振的话，\n你觉得你能完成你那朋友的遗愿吗？！",
        "\t[星天,N1195]\b[this,2,5]在未来每天浑浑噩噩的活着，\n这是你那朋友希望看到的吗？！！\n你觉得她看到你现在的现状她在黄泉路上会开心吗？！！",
        "\t[星天,N1195]\b[this,2,5]如果你想强的话就跟我来！\n我来助你一臂之力！！",
        "\t[小粽,hero]\b[hero]好！！",
        "\t[星天,N1195]\b[this,2,5]对嘛！这才像样呀！",
        "\t[星天,N1195]\b[this,2,5]来吧,我带你去我隐藏的训练营吧。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "小粽跟着星天带到了他那隐藏的训练营处。",
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "100000000000"
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "value": "50000000000"
        },
        {
            "type": "setValue",
            "name": "status:def",
            "value": "50000000000"
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "value": "50000000000"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:yellowKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:blueKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:redKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "addValue",
            "name": "item:centerFly",
            "value": "-114514"
        },
        {
            "type": "addValue",
            "name": "item:pickaxe",
            "value": "-114514"
        },
        {
            "type": "changeFloor",
            "floorId": ":next",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,10016,10017,10017,10017,10017,10017,10017,10017,10017,10017,10018, 20],
    [ 20,10071,10025,10071,10025,10025,10025,10025,10025,10025,10025,10026, 20],
    [ 20,  0,  0,963,  0,  0,  0,  0,  0,  0,  0,181155, 20],
    [ 20,10087,  0,10087,  0,  0,  0,  0,  0,  0,  0,181163, 20],
    [ 20,  0,  0,  0,  0,  0,  0,181674,  0,  0,  0,  0, 20],
    [ 20,160032,160033,160034,  0,  0,  0,181682,  0,  0,170130,170131, 20],
    [ 20,160040,160041,160042,  0,  0,  0, 20, 20, 20, 20, 20, 20],
    [ 20,181362,592,181364,  0,  0,  0,10016,10056,10057,10058,10017, 20],
    [ 20,181370,181371,181372,  0,  0,  0,10024,10064,10065,10066,10025, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,10094,  0,  0,  0,170231,  0,170231,  0,  0,  0,10094, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,170216,  0,  0,170036,  0,170185,  0,  0,170187,170120,170121,  0],
    [  0,170224,  0,  0,  0,10092,10093,180968,180969,180970,170128,170129,  0],
    [  0,10079,  0,10079,  0,10100,10101,180976,180977,180978,170136,170137,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,181363,181364,  0,  0,  0,  0,  0,  0,  0,170187,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,181362,181363,181364,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,181370,181371,181372,  0,  0],
    [  0,  0,  0,170183,  0,  0,  0,  0,  0,170183,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10024,  0,10025,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10048,10049,10050,  0,  0,  0,  0,10017,10017,10017,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10025,10025,10025,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}