main.floors.MT253=
{
    "floorId": "MT253",
    "title": "训练营九重",
    "name": "训练营九重",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 200000000,
    "defaultGround": "ground",
    "weather": [
        "rain",
        1
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT245\", \"MT246\", \"MT247\", \"MT248\", \"MT249\", \"MT250\", \"MT251\", \"MT252\", \"MT253\"]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==1)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "time": 0
                    }
                ]
            }
        ],
        "6,1": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[星天,E511]\b[this,6,1]你果然没有让我失望，\n击败了我所有的机械并且走到了我面前。",
                "\t[小粽,hero]\b[hero]是星天前辈让我看清我现在该走的路:\n不是停滞不前，而是继续向前！",
                "\t[星天,E511]\b[this,6,1]嗯，看来你的状态是完全恢复过来了，\n这样才对啊。",
                "\t[星天,E511]\b[this,6,1]虽然你成功的走在了我的面前，\n但你最终的目的则是要击败我！",
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "playSound",
                    "name": "cgefc01.wav"
                },
                {
                    "type": "animate",
                    "name": "unexpected1",
                    "loc": "hero"
                },
                "\t[小粽,hero]\b[hero]击败星天前辈你？！",
                "\t[星天,E511]\b[this,6,1]怎么？你难道连这点信心都没有吗？！",
                "\t[小粽,hero]\b[hero]这....星天前辈，\n是晚辈认为自己的实力还不足以击败您。",
                "\t[星天,E511]\b[this,6,1]哈哈哈！小粽，你太看得起我了。\n你难道没听说过一句古话：长江后浪推前浪吗？",
                "\t[星天,E511]\b[this,6,1]你的资质，\n是我平生以来见过最为优秀与顶尖的！",
                "\t[星天,E511]\b[this,6,1]短短数月，从一个手无寸铁的普通人。\n如今成为了可以斩杀阴阳圣坛最强圣护之手的存在！",
                "\t[星天,E511]\b[this,6,1]古往今来，你说这种成就又有几个人能够做到呢？",
                "\t[小粽,hero]\b[hero].............",
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[小粽,hero]\b[hero]晚辈受教了！",
                "\t[星天,E511]\b[this,6,1]那就对了！既然你有如此资质，\n又何必担心能否击败我这件事呢？",
                "\t[星天,E511]\b[this,6,1]来吧！就让我看看，\n你究竟能走到哪一步！",
                "\t[小粽,hero]\b[hero]前辈会见识到的！",
                "小粽话一落下，手中的利剑顿时绽放出万千光芒，\n但是小粽却让之前显露出的光芒隐秘在其利剑之中。",
                "内化于行？星天此时不由自主的挑了挑眉头，\n似乎是惊讶于小粽对剑的领悟。",
                "与此同时，小粽的气场也变得沉厚起来，\n周围的环境因受小粽的影响而变得寂静。",
                "有点意思，那我也不继续藏拙了，\n星天如是说道。",
                "在刹那间，星天的气息正在以一种令人发指的速度飙升着，\n而且这个气息不再是一种普通的威压。",
                "而类似于一位君主降临，帝统天下的磅礴气概！\n仿佛他就是九天之上的君王！那遨游四海的神龙！！",
                "好恐怖的气息！居然让我有俯首称臣的欲望！！小粽心想。",
                "看来只有将全部力量灌输到一点才能突破这股力量吧！",
                "小粽此时解封所有力量来面对星天的招数。",
                "\t[星天,E511]\b[this,6,1]小粽,小心了！\n这是我的成名绝技：龙啸九天决！",
                "\t[小粽,hero]\b[hero]来吧！！",
                {
                    "type": "battle",
                    "id": "E964"
                },
                {
                    "type": "setCurtain",
                    "color": [
                        255,
                        255,
                        255,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                "\t[小粽,hero]\b[hero]..................",
                "\t[星天,E511]\b[this,6,1]....................",
                "\t[星天,E511]\b[this,6,1]看来是你赢了，居然突破了我的绝技。",
                "\t[小粽,hero]\b[hero]是晚辈侥幸，占据了一些优势。",
                "\t[星天,E511]\b[this,6,1]赢了就是赢了，没有什么侥幸之分。",
                "\t[星天,E511]\b[this,6,1]你该调整的现在都已经调整完了，\n我们是时候该回去重新制定一些计划了。",
                "\t[小粽,hero]\b[hero]好。",
                "\t[小粽,hero]\b[hero]（不过我感觉星天前辈最后好像刻意收敛了剑意呀........）",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "hideStatusBar"
                },
                "小粽与星天回到了星天的家去制定计划，并且等待星钰苏醒过来。",
                "不知过了多久......。",
                {
                    "type": "playBgm",
                    "name": "disorder4.mp3",
                    "keep": true
                },
                "\t[???]终于来了吗.......。",
                "\t[???]没错，我感受到了，感受到了！",
                "\t[???]那属于我们一类的气息.....。",
                "\t[???]快来吧,我们已经等不及了呢......。",
                "\t[???]没错，你靠近一点......，\n再靠近一点....，快来到我们这里吧....。",
                {
                    "type": "playSound",
                    "name": "049-Explosion02.ogg"
                },
                {
                    "type": "playSound",
                    "name": "084-Monster06.ogg"
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[???]所有造物....终将融为一体！",
                {
                    "type": "pauseBgm"
                },
                "在小粽与星天回到家那一个月之后，星钰终于苏醒过来，\n并且星钰看到了他的父亲与小粽安然无事的时候非常惊喜与兴奋。",
                "星天告诉了星钰过往发生的一切，并且打算去阻止魔王完成造神计划，\n毕竟一旦魔王完成了造神计划,他们所有人都无法幸免........。",
                "于是星天就打算跟着小粽他们一起去三圣之巅去解决这一切....。",
                "三圣之巅一共有三位阁主：黯夜殇，圣羽洛斯，以及最为神秘的君阁主。",
                "而现在黯夜殇已死,黯夜一族正处于群龙无首的状态，\n而君阁主由于十分隐秘且实力极其强大,短时间内难以攻破。",
                "所以小粽他们只有先去击毙掌握科技力量的圣羽洛斯！",
                "圣羽洛斯作为魔塔内的顶尖高层人物，\n在三圣之巅管辖三个区域：玄天道门,本部实验室,永生之巅。",
                "此时小粽他们已经到达了圣羽洛斯管辖的第一个区域：玄天道门！",
                {
                    "type": "setValue",
                    "name": "status:money",
                    "value": "0"
                },
                {
                    "type": "disableShop",
                    "id": "249Fshop"
                },
                {
                    "type": "changeFloor",
                    "floorId": ":next",
                    "loc": [
                        12,
                        12
                    ],
                    "direction": "up",
                    "time": 500
                },
                {
                    "type": "showStatusBar"
                },
                {
                    "type": "setCurtain",
                    "time": 500
                }
            ]
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,1": {
            "0": null,
            "1": null,
            "2": null
        }
    },
    "cannotMove": {},
    "map": [
    [145,145, 22,145,145,145,145,145,145,145, 22,145,145],
    [145,387,371,387,145,145,964,145,145,387,371,387,145],
    [145,371,976,371,145,145,670,145,145,371,976,371,145],
    [145,145, 82,145,145,145, 83,145,145,145, 82,145,145],
    [145,371,387,979, 82,399, 22,399, 82,979,387,371,145],
    [145, 21,371, 22,145, 22,399, 22,145, 22,371, 21,145],
    [145,145,145,145,145,145,  0,145,145,145,145,145,145],
    [145,399, 81, 33, 33, 81,  0, 81, 33, 33, 81,399,145],
    [145, 82,145, 81,145,145,  0,145,145, 81,145, 82,145],
    [145,399,145,399,145,145,  0,145,145,399,145,399,145],
    [145,399,145, 81,145,145,  0,145,145, 81,145,399,145],
    [145,399,145,399,145,145, 88,145,145,399,145,399,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145]
],
    "bgmap": [
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302],
    [302,302,302,302,302,302,302,302,302,302,302,302,302]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "bgm": "battle15.mp3"
}