main.floors.MT271=
{
    "floorId": "MT271",
    "title": "玄天道门（坟墓）",
    "name": "玄天道门（坟墓）",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 300000000,
    "defaultGround": "ground",
    "bgm": null,
    "firstArrive": [
        {
            "type": "hideStatusBar"
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                9
            ]
        },
        "\t[小粽,hero]\b[hero]这里是！坟墓吗？！",
        "\t[星钰,N1196]\b[hero,1]这里居然有这么多的坟墓？",
        "\t[小粽,hero]\b[hero]星天前辈，这里究竟.....",
        "\t[星天,N1195]\b[hero,2]这里就是..........。",
        {
            "type": "playBgm",
            "name": "disorder4.mp3",
            "keep": true
        },
        "\t[？？？]桀桀桀！！这里就是你们的葬身之地！！",
        {
            "type": "unfollow",
            "name": "xy.png"
        },
        {
            "type": "unfollow",
            "name": "jwt.png"
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "changePos",
            "loc": [
                6,
                8
            ],
            "direction": "down"
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ]
        },
        "\t[星天,N1252]\b[this,6,10]什么人在装神弄鬼？！",
        "\t[？？？]嘿嘿嘿嘿嘿嘿！！！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire2",
            "loc": [
                6,
                12
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ]
        },
        "\t[小粽,hero]\b[hero]这家伙的力量.......。",
        {
            "type": "callBook"
        },
        "\t[小粽,hero]\b[hero]好！好强！！这个家伙居然拥有接近阁主的力量！！",
        "\t[星钰,N1250]\b[this,6,9]！！！什么？！",
        "\t[星钰,N1250]\b[this,6,9]父亲大人！我们该怎么办！！",
        "\t[星天,N1252]\b[this,6,10]我来拖住他！你们赶紧离开这里！！",
        "\t[？？？,E1024]\b[this,6,12]桀桀桀！就凭你？",
        "\t[星天,N1252]\b[this,6,10]不试试怎么知道！",
        "\t[？？？,E1024]\b[this,6,12]嘿嘿嘿！黑暗吞噬！！",
        "\t[星天,N1252]\b[this,6,10]龙啸九天决！",
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "双方产生的能量波动使周围的环境天地失色......。",
        "\t[星天]我以自身的力量暂时束缚了他，\n但是我必须时刻在这里来维持力量防止它突破！\n所以剩下的都靠你们了！",
        "\t[小粽]星天前辈！！",
        "\t[星钰]父亲大人！！！",
        "\t[？？？]你们.....是逃避不了的！你们一定会死的！！",
        "\t[？？？]哈哈哈哈哈哈哈哈！！！",
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "changeFloor",
            "floorId": "MT272",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [30148,30153,30153,30153,30153,30153,30153,30153,30153,30153,30153,30153,30147],
    [30146,30160,30161,30161,30161,30161,30161,30161,30161,30161,30161,30162,30144],
    [30146,30168,30169,30169,30169,30169,30169,30169,30169,30169,30169,30170,30144],
    [30146,30176,30177,30177,30177,30177,30177,30177,30177,30177,30177,30178,30144],
    [30146,30081,  0,30081,  0,30081,  0,30081,  0,30081,  0,30081,30144],
    [30146,30089,  0,30089,  0,30089,  0,30089,  0,30089,  0,30089,30144],
    [30146,30081,  0,30081,  0,30081,  0,30081,  0,30081,  0,30081,30144],
    [30146,30089,  0,30089,  0,30089,  0,30089,  0,30089,  0,30089,30144],
    [30146,30081,  0,30081,  0,30081,  0,30081,  0,30081,  0,30081,30144],
    [30146,30089,  0,30089,  0,30089,1250,30089,  0,30089,  0,30089,30144],
    [30146,30081,  0,30081,  0,30081,1252,30081,  0,30081,  0,30081,30144],
    [30146,30089,  0,30089,  0,30089,  0,30089,  0,30089,  0,30089,30144],
    [30140,30137,30137,30137,30137,30138,1024,30136,30137,30137,30137,30137,30139]
],
    "bgmap": [
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [171,171,171,171,171,171,301,171,171,171,171,171,171],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [171,171,171,171,171,171,301,171,171,171,171,171,171],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [171,171,171,171,171,171,301,171,171,171,171,171,171],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}