main.floors.MT270=
{
    "floorId": "MT270",
    "title": "黯夜塔五层",
    "name": "黯夜塔五层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "Sky4.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 300000000,
    "defaultGround": "ground",
    "bgm": "battle17.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,4": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[黯夜殒,E1008]\b[this,6,4]杀！杀！杀！",
                "\t[小粽,hero]\b[hero]这个家伙好像失去理智了.....。",
                "\t[黯夜殒,E1008]\b[this,6,4]死！死！死！",
                "\t[星天,N1195]\b[hero,2]看他的头部，好像是被人打伤才导致这样的...。",
                "\t[星天,N1195]\b[hero,2]小粽,直接解决掉他吧！",
                "\t[小粽,hero]\b[hero]好！",
                "\t[黯夜殒,E1008]\b[this,6,4]死！死！死！",
                {
                    "type": "battle",
                    "id": "E1008"
                },
                {
                    "type": "hide",
                    "remove": true,
                    "time": 500
                },
                {
                    "type": "insert",
                    "loc": [
                        0,
                        0
                    ]
                }
            ]
        },
        "0,0": [
            "\t[小粽,hero]\b[hero]这家伙！好强！！",
            "\t[星天,N1195]\b[hero,2]....小粽，我感觉楼上有许多危险的气息，我们现在不能继续再上楼了！",
            "\t[星天,N1195]\b[hero,2]这次就直接离开吧，我们途中收获的宝物已经够多了。",
            "\t[小粽,hero]\b[hero]好！听前辈的，我也感觉楼上有许多恐怖的气息。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "6,1": {
            "floorId": "MT270",
            "loc": [
                6,
                11
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240005,240005,240005,240005,240005,240005,240005,240005,240005,240005,240005,240005,240005],
    [240005,240005, 21,396, 85, 85, 87, 85, 85,396, 21,240005,240005],
    [240005,240005,240005,400,364, 85, 85, 85,364,400,240005,240005,240005],
    [240005,240005,240005,380,400,348, 85,348,400,380,240005,240005,240005],
    [240005,240005,240005,400,396,400,1008,400,396,400,240005,240005,240005],
    [240005,240005,240005,240005,240005,240005, 81,240005,240005,240005,240005,240005,240005],
    [240005,399,240005,240005,240005,240005, 21,240005,240005,240005,240005,402,240005],
    [240005,399,240005,354,354,1015, 21,1015,354,354,240005,400,240005],
    [240005, 81,240005,240005,240005,240005,384,240005,240005,240005,240005, 82,240005],
    [240005, 33,240005,338,338,1015, 21,1015,338,338,240005,402,240005],
    [240005, 33,240005,240005,240005,240005,399,240005,240005,240005,240005,399,240005],
    [240005,399, 81, 33,399, 81, 88, 82, 34,402, 82, 33,240005],
    [240005,240005,240005,240005,240005,240005,240005,240005,240005,240005,240005,240005,240005]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}