main.floors.MT27=
{
    "floorId": "MT27",
    "title": "光明圣堂",
    "name": "光明圣堂",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "item_ratio": 2,
    "defaultGround": "ground",
    "bgm": "spendid1.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "spendid1.mp3"
        },
        {
            "type": "setBgFgBlock",
            "name": "fg",
            "number": "N831",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "choices",
            "text": "是否查看怪物属性？",
            "choices": [
                {
                    "text": "是",
                    "action": [
                        {
                            "type": "callBook"
                        },
                        {
                            "type": "waitAsync"
                        }
                    ]
                },
                {
                    "text": "不",
                    "action": []
                }
            ]
        },
        "\t[???,N831]\b[this,6,6]该来的都来了吧？",
        "\t[???,N1379]\b[this,6,9]大人，你叫我们来究竟是有何事？",
        "\t[???,N1379]\b[this,6,9]如果没有什么要紧的事，还是让属下完善刚刚尚未完成的实验吧。",
        "\t[???,N831]\b[this,6,6]哼！圣羽洛斯，你觉得本座叫你们前来只是为了闲聊吗？",
        "\t[圣羽洛斯,N1379]\b[this,6,9]当然不会，只是我这次的试验有时间限制，过了时间试验就失败了，并且....。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]那种可爱的试验品现在在人类世界可并不好找呀！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N1387]\b[this,4,10]哼！圣羽洛斯，你直接向大人说你有炼铜倾向，让大人送你出去 然后你自己找些这种人类不就行了！你一个爷们说那么多废话！",
        "\t[???,N1387]\b[this,4,10]我看你这性格也就只有第二区域的若影卡萨能跟你相比了",
        "\t[圣羽洛斯,N1379]\b[this,6,9]哎呀呀，黯夜殇老弟，此言差矣，我这是为了科学！怎么叫炼铜呢？你说是不是。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]那些可爱的小女孩，可都是为了我伟大的科学而付出了肉体和灵魂呢！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]她们死前把自己最美好的一面奉献给了我的科学，让我的科学得到飞跃的提升，这种感觉真的是......",
        "\t[圣羽洛斯,N1379]\b[this,6,9]\r[red]令人愉悦呀！哈哈哈哈哈哈哈哈！！！！",
        {
            "type": "playSound",
            "name": "Raise1.ogg"
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": [
                4,
                9
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "Raise1.ogg"
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": [
                7,
                10
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[???,N831]\b[this,6,6]圣羽洛斯，你废话有点多了！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]对不起，大人 这是我的职业病，不好改呀。",
        "\t[???,N831]\b[this,6,6]关于试验品这件事，我到时叫梦跟你手下一起去人类世界挑选，别在我面前提你那所谓的科学。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]是，是！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]那么回归正题，我叫你们前来是因为我现在要开始实施\r[red]【】计划！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                10
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                9
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[圣羽洛斯,N1379]\b[this,6,9]哦！大人你终于要开始实施\r[red]【】计划了吗？！",
        "\t[???,N831]\b[this,6,6]没错！现在正是要实施\r[red]【】计划的时刻！",
        "\t[黯夜殇,N1387]\b[this,4,10]等等......大人您不是说过要成功实施\r[red]【】计划，\r[white]必须要人类世界最强大的勇者作为祭品才能实施吗？",
        "\t[黯夜殇,N1387]\b[this,4,10]而祭品的最低要求是达到我们三圣阁主这样的实力。",
        "\t[黯夜殇,N1387]\b[this,4,10]可是大人您也知道，虽然这些年有不少的人类勇者进入了这座高塔，但是他们的实力都太过弱小，无一例外都栽在了第一区域的安兹乌洛斯手中",
        "\t[黯夜殇,N1387]\b[this,4,10]难道是有人类勇者斩杀了第一区域的安兹乌洛斯？",
        "\t[???,N831]\b[this,6,6]你说的没错，我刚刚得到消息,这个人类不仅斩杀了第一区域的安兹乌洛斯，而且第二区域的若影卡萨也被这个人类斩杀!",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                4,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                10
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                9
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[黯夜殇,N1387]\b[this,4,10]嘶......不可能！若影卡萨虽然性格怪异，但他的实力对于人类来说就如同天壤之别，区区一个人类怎么可能斩杀掉若影卡萨！",
        "\t[???,N831]\b[this,6,6]不管你们信不信，反正根据情报显示，这个人类现在应该已经到四星尊天的领域了。",
        "\t[圣护之手·天,N1389]\b[this,7,10]大人，需要属下去做些什么吗？",
        "\t[???,N831]\b[this,6,6]不需要，你们现在只用干好自己分内的事情就可以了，圣羽洛斯！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]属下在！",
        "\t[???,N831]\b[this,6,6]你是【】计划的核心人物，该做什么你自己心里清楚吧！",
        "\t[圣羽洛斯,N1379]\b[this,6,9]属下定会不辱使命！",
        "\t[???,N831]\b[this,6,6]那就好，如果你们没有什么事的话就自行离开吧。",
        "\t[圣羽洛斯,N1379]\b[this,6,9]对了，大人，君阁主怎么没有跟我们一起开会？",
        "\t[???,N831]\b[this,6,6]君阁主他现在在闭关，不方便出来。",
        "\t[???,N831]\b[this,6,6]等君阁主出关以后，实施【】计划将会有更大的把握。",
        "\t[圣羽洛斯,E510]\b[this,6,9]那属下就先行告退了。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    9
                ]
            ],
            "time": 500
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    10
                ]
            ],
            "time": 500
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "time": 500
        },
        {
            "type": "stopSound"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "memory2.mp3"
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[梦,N1256]\b[this,8,5]大人你在思考些什么呢？",
        "\t[???,N831]\b[this,6,6]我在思考如何实施\r[red]【】计划。",
        "\t[梦,N1256]\b[this,8,5]不，大人你不会只是在思考\r[red]【】计划。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                6
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]嗯？你......",
        "\t[梦,N1256]\b[this,8,5]因为你的心告诉了我你的答案。",
        "\t[梦,N1256]\b[this,8,5]我感受到你埋藏在内心的情感，那是一种期望与思念的情感。",
        "\t[梦,N1256]\b[this,8,5]但在这情感的更深处，我却感受到了无尽的悲伤......。",
        "\t[梦,N1256]\b[this,8,5]其实早在你告诉我你要打算实施【】计划的时候，你无意的流露出的......。",
        "\t[梦,N1256]\b[this,8,5]是一种类似于兴奋的情感。",
        "\t[梦,N1256]\b[this,8,5]大人这种内心的情感应该与【】计划有着千丝万缕的关系吧。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[???,N831]\b[this,6,6].......你很聪明，并且很会察言观色，但可惜......",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]罢了，说这个也没什么意义，你先离开吧，我再在这里思考一会。",
        "\t[梦,N1256]\b[this,8,5]......是。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500
        },
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    5
                ]
            ],
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[???,N831]\b[this,6,6]\\d......时间是没有声音的锉刀，它可以斩断一切存在的事物，甚至可以斩断因果。",
        "\t[???,N831]\b[this,6,6]\\d但唯独斩断不了我对你的思念。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N831]\b[this,6,6]梦 你很好！ 但可惜 你不是\\d“她”。",
        "\t[???,N831]\b[this,6,6]等到【】计划完成以后，我就能再见到你了吧......。",
        {
            "type": "disableShop",
            "id": "shop1"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500
        },
        {
            "type": "changeFloor",
            "floorId": "MT28",
            "loc": [
                2,
                0
            ],
            "direction": "down",
            "time": 0
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80034,80009,80032,80033,80033,80033,80033,80027],
    [80026,80044,80040,80041,80067,80044,80009,80044,80066,80041,80041,80044,80024],
    [80026,80052,80048,80049,80075,80052,80009,80052,80074,80049,80049,80052,80024],
    [80026,80060,80056,80057,80083,80060,80009,80060,80082,80057,80058,80060,80024],
    [80026,80009,80178,80179,80009,80009,80009,80009,80009,80178,80179,80009,80024],
    [80026,80009,80009,  0,  0,  0,  0,  0,514,  0,80009,80009,80024],
    [80026,70124,80009,  0,  0,90610,90611,90612,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,80009,80009,  0,519,  0,510,  0,  0,  0,80009,80009,80024],
    [80026,80151,80135,  0,  0,  0,  0,521,  0,  0,80135,80151,80024],
    [80026,80159,80143,80009,80009,80009,80009,80009,80009,80009,80143,80159,80024],
    [80020,80017,80017,80017,80018,80201,80201,80201,80016,80017,80017,80017,80019]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,70069,  0,  0,  0,  0,  0,70069,  0,  0,  0],
    [  0,  0,80162,80163,  0,  0,  0,  0,  0,80162,80163,  0,  0],
    [  0,80151,80170,80171,  0,80151,  0,80151,  0,80170,80171,80151,  0],
    [  0,80159,  0,101,  0,80159,  0,80159,  0,101,  0,80159,  0],
    [  0,70116,  0,102,  0,90602,90603,90604,  0,102,  0,70116,  0],
    [  0,70116,  0,  0,  0,90610,90611,90612,  0,  0,  0,70116,  0],
    [  0,70116,  0,  0,  0,  0,  0,  0,  0,  0,  0,70116,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,102,  0,  0,  0,  0,  0,102,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}