main.floors.MT288=
{
    "floorId": "MT288",
    "title": "本部实验室（最深处）",
    "name": "本部实验室（最深处）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "disorder4.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[？？？,E578]\b[this,6,6]终于来了吗.......",
        "\t[？？？,E578]\b[this,6,6]没错，我感受到了，感受到了！",
        "\t[星钰,N1196]看来前面应该就是这座实验室的最深处了。",
        "\t[？？？,E578]\b[this,6,6]那属于我们一类的气息.....。",
        "\t[小粽,hero]嗯？前面那位是.........。",
        "\t[？？？,E578]快来吧，我已经等不及了呢......。",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unknown",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unknown",
            "loc": [
                6,
                12
            ]
        },
        "\t[小粽,hero]\b[hero]你是........。",
        "\t[？？？,E578]\b[this,6,6]没错，你靠近一点......，\n再靠近一点....，快来到我们这里吧....。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                12
            ]
        },
        "\t[星钰,N1196]\b[hero,1]等等？！！你......是.............！！",
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[堇,E671]\b[this,6,6]所有造物....终将融为一体！",
        {
            "type": "playSound",
            "name": "049-Explosion02.ogg"
        },
        {
            "type": "playSound",
            "name": "084-Monster06.ogg"
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "playBgm",
            "name": "disorder3.mp3",
            "keep": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero",
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                12
            ]
        },
        "\t[星钰,N1196]\b[hero,1]！！！堇？！！！堇姐姐？？！！！！！",
        "\t[星钰,N1196]\b[hero,1]真的是你吗？！！堇姐姐！！",
        "\t[小粽,hero]\b[hero]你是堇小姐？？！！！",
        "\t[小粽,hero]\b[hero]不....不可能！明明你已经死在魔王的手中了！！",
        "\t[小粽,hero]\b[hero]怎么可能会出现在这里？！！！",
        "\t[堇,E671]\b[this,6,6]我们又见面了,第二代试验体！",
        "\t[星钰,N1196]\b[hero,1]第二代试验体？堇姐姐你在说些什么呀？",
        "\t[小粽,hero]\b[hero]第二代试验体.............",
        "\t[堇,E671]\b[this,6,6]怎么？没有印象了吗，\n我记得以前我用过秘术告诉过你们这些消息呢。",
        "\t[星钰,E593]\b[hero,1]堇姐姐....你到底怎么了？到底在说些什么呢......",
        "\t[堇,E671]\b[this,6,6]算了，我直接告诉你们这一切的真相吧！",
        "\t[堇,E671]\b[this,6,6]圣羽洛斯大人在魔塔内有数十年的阅历，\n在这数十年内完成了三大试验！",
        "\t[堇,E671]\b[this,6,6]第一次试验是以魔王为主导，圣羽洛斯大人为辅助的试验。",
        "\t[堇,E671]\b[this,6,6]而这次的试验铸就了一位非常伟大的存在！",
        "\t[星钰,E593]\b[hero,1]............................堇姐姐。",
        "\t[堇,E671]\b[this,6,6]或许初代试验体对于我们来说太过遥远，\n我们就来说重点的：第二代试验体！",
        "\t[堇,E671]\b[this,6,6]第二次试验圣羽洛斯大人完成于十六年前，\n是与魔王一同完成的试验。",
        "\t[堇,E671]\b[this,6,6]是一种以胚胎的形式生产出试验体。",
        "\t[堇,E671]\b[this,6,6]不过等到试验完成后，魔王却说这个试验体是失败品，\n把他连带其承载的容器给一同丢弃了。",
        "\t[小粽,hero]\b[hero].....你是说.....",
        "\t[堇,E671]\b[this,6,6]也就是说：你就是在十六年前被圣羽洛斯大人与魔王所创造的试验体！",
        {
            "type": "playSound",
            "name": "049-Explosion02.ogg"
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[星钰,N1196]\b[hero,1]什么？！！也就是说小粽不是人类！！\n是被魔王与那个圣羽洛斯所创造的试验体？？！！！",
        "\t[星钰,N1196]\b[hero,1]这.....怎么可能！我明明用科技力量感知小粽是一个彻彻底底的人类呀！",
        "\t[堇,E671]\b[this,6,6]哼！圣羽洛斯大人的科技水平岂是你们这些末流人物所能探测的！！",
        "\t[小粽,hero]\b[hero]...............",
        "\t[小粽,hero]\b[hero]..............................",
        "\t[小粽,hero]\b[hero]..............................是这样的吗？",
        "\t[星钰,N1196]\b[hero,1]小粽.......你.....",
        "\t[小粽,hero]\b[hero]对于我不是人类这件事情，其实我早就从母亲那里知道了.....。",
        "\t[小粽,hero]\b[hero]因为母亲曾经跟我说过，我不是母亲的亲生儿子，\n是母亲在一次外出时从一个容器中捡到我的。",
        "\t[堇,E671]\b[this,6,6]所以.....对你来说这一切你并不感到意外吗？",
        "\t[小粽,hero]\b[hero]不，虽然我早已知道我不是纯粹的人类，\n但是我对于你所说的第二代试验体这个身份是感到十分诧异的.......。",
        "\t[堇,E671]\b[this,6,6]哼！的确，一个被魔王抛弃的试验体却成为了讨伐魔王的勇者，\n这个故事可真是有趣呀！",
        "\t[堇,E671]\b[this,6,6]接下来,我要告诉你们的真相是！",
        "\t[星钰,N1196]\b[hero,1]是什么？..........",
        "\t[小粽,hero]\b[hero]..................",
        "\t[堇,E671]\b[this,6,6]\\d我！就是圣羽洛斯大人创造的第三代试验体！神之力的掌控者！！",
        "\t[星钰,N1196]\b[hero,1]什么？！！堇姐姐你！！居然是........！！！",
        "\t[星钰,N1196]\b[hero,1]这..........怎么会！！",
        "\t[小粽,hero]\b[hero]第三代试验体？",
        "\t[星钰,N1196]\b[hero,1]堇姐姐你一定在开玩笑吧！\n你怎么可能会是圣羽洛斯的试验体呢？！",
        "\t[堇,E671]\b[this,6,6]身为圣羽洛斯大人的试验体，是一种无上的荣光！\n怎么可能会是玩笑话呢！！",
        "\t[星钰,N1196]\b[hero,1]不.....不是.....绝对不是...！",
        "\t[星钰,N1196]\b[hero,1]堇姐姐！难道你忘记了我们当初在四星尊天过往的一切了吗？！！",
        "\t[星钰,N1196]\b[hero,1]难道你忘记了你与仙琳妹妹和我在一起的时光了吗？！！",
        "\t[堇,E671]\b[this,6,6]你在说些什么呢？小丫头，我...............",
        "\t[堇,E671]\b[this,6,6]\r[red]认识你吗？",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[星钰,N1196]\b[hero,1]这.................不！",
        "\t[小粽,hero]\b[hero]星钰！她已经不再是我们认识的那个堇了！！",
        "\t[小粽,hero]\b[hero]她现在这个模样我曾经在四星尊天那里见过一次！\n她的体内有一股非常恐怖的黑暗之力！！",
        "\t[小粽,hero]\b[hero]这一缕黑暗之力很早以前就出现在堇的体内，\n并且会开始潜移默化的影响她！",
        "\t[小粽,hero]\b[hero]一旦这一缕黑暗之力对她的侵蚀达到一个临界点时，\n她就会暂时失去属于自我的意识，\n变成一个毫无感情波动的工具人！",
        "\t[星钰,N1196]\b[hero,1]这...我曾经听仙琳妹妹说过，\n只是没有亲自看到堇姐姐出现过这种状况。",
        "\t[小粽,hero]\b[hero]而且这一次我感觉她体内的黑暗之力又升华了！",
        "\t[星钰,N1196]\b[hero,1]那....我们该怎么办？",
        "\t[小粽,hero]\b[hero]我们现在只有想办法击败她！让她清醒过来！",
        "\t[星钰,N1196]\b[hero,1]这...看来也没其他的办法了。",
        "\t[堇,E671]\b[this,6,6]好了好了，既然我已经告诉你们这一切的真相，那么就请你们",
        "\t[堇,E671]\b[this,6,6]\r[red]与所有的造物融为一体吧！",
        "\t[小粽,hero]\b[hero]还是像上次一样！用我们的最强绝招！",
        "\t[星钰,N1196]\b[hero,1]好！",
        "小粽与星钰联手：全属性暂时提高两倍！",
        {
            "type": "setValue",
            "name": "status:atk",
            "operator": "*=",
            "value": "2"
        },
        {
            "type": "setValue",
            "name": "status:def",
            "operator": "*=",
            "value": "2"
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "operator": "*=",
            "value": "2"
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true,
            "time": 0
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "callBook"
        },
        {
            "type": "unfollow",
            "name": "xy.png"
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 0
        },
        {
            "type": "battle",
            "id": "E1042"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "operator": "/=",
            "value": "2"
        },
        {
            "type": "setValue",
            "name": "status:def",
            "operator": "/=",
            "value": "2"
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "operator": "/=",
            "value": "2"
        },
        {
            "type": "playBgm",
            "name": "Eternity1.mp3",
            "keep": true
        },
        "\t[小粽,hero]\b[hero]咳咳咳！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "hideStatusBar"
        },
        "\t[星钰,N1196]\b[this,6,12]呼......呼....堇姐姐体内居然有如此恐怖的黑暗之力！\n我们两个联手居然都难以制服！",
        "\t[堇,E671]\b[this,6,6]没想到呀....当初在四星尊天的那个弱小存在，\n如今居然有如此实力！",
        "\t[堇,E671]\b[this,6,6]不过......你们也即将是强弩之末了！",
        {
            "type": "playSound",
            "name": "VXMagic.ogg"
        },
        {
            "type": "animate",
            "name": "yongchang",
            "loc": [
                6,
                7
            ]
        },
        "\t[堇,E671]\b[this,6,6]永别了！第二代试验体！！\n为圣羽洛斯大人奉献出自己的生命吧！！！",
        "\t[小粽,hero]\b[hero]！！！不好",
        "\t[星钰,N1196]\b[this,6,12]不要啊！！！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire2",
            "loc": [
                6,
                7
            ],
            "async": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "remove": true,
            "time": 0
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire2",
            "loc": [
                6,
                9
            ],
            "async": true
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 1,
            "keep": true,
            "steps": [
                "right",
                "up",
                "up",
                "left"
            ]
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[小粽,hero]\b[hero]星钰！！！",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[星钰,N1196]\b[this,6,12]噗！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[小粽,hero]\b[hero]星钰！！！你....",
        "\t[星钰,N1196]\b[this,6,12]堇姐姐.......你难道真的忘记了过往的一切了吗....\n完全忘记我们了吗.......。",
        "\t[堇,E671]\b[this,6,6].......................你？",
        "\t[星钰,N1196]\b[this,6,12]我依稀还记得当初是堇姐姐保护我和仙琳妹妹呢.....\n是你带我们一同修炼呢...............。",
        "\t[堇,E671]\b[this,6,6].......................",
        "\t[星钰,N1196]\b[this,6,12]所以！堇姐姐！醒过来吧！！",
        "\t[堇,E671]\b[this,6,6]！！！",
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[星钰,N1196]\b[this,6,12]..............噗！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[小粽,hero]\b[hero]星钰！！！没事吧！！",
        "\t[星钰,N1196]\b[this,6,12]我.......还......",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[小粽,hero]\b[hero]太虚弱导致昏迷了吗.......",
        "\t[小粽,hero]\b[hero]不过那个堇怎么不见了.....",
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        "\t[？？？]所有造物....终将融为一体！",
        "\t[小粽,hero]\b[hero]嗯？！这个声音怎么这么熟悉？",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                8
            ]
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]你！你是？？！！",
        "\t[小粽,hero]\b[hero]黯夜殇？？？！！！！",
        "\t[小粽,hero]\b[hero]你？！你不是已经死了吗？！！\n怎么可能还活着！！！",
        "\t[黯夜殇？,N827]\b[this,6,8]我们又见面了，名为小粽的勇者。",
        "\t[小粽,hero]\b[hero]哼！虽然不知道你为什么还活着！\n但是就算你是从地狱爬出来，我也会将你碎尸万段！",
        "\t[小粽,hero]\b[hero]\\d天破苍穹！",
        {
            "type": "move",
            "loc": [
                6,
                8
            ],
            "time": 500,
            "async": true,
            "steps": [
                "down"
            ]
        },
        {
            "type": "animate",
            "name": "attack17",
            "loc": [
                6,
                8
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXIce8.ogg"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "VXBreath.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "spark1.wav"
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "remove": true,
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "N729",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]！！！你.......是！！",
        "\t[母亲,N729]\b[this,6,10]好久不见，我的孩子，\n没想到你已经长这么大了呢。",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "backward"
            ]
        },
        "\t[小粽,hero]\b[hero]这........怎么会？！！",
        "\t[小粽,hero]\b[hero]母亲你不是已经死了吗？！！！",
        "\t[母亲,N729]\b[this,6,10]你在说些什么呢，我的孩子，\n母亲我不是一直都在这里吗？",
        "\t[小粽,hero]\b[hero]不...........................这......................。",
        "\t[母亲,N729]\b[this,6,10]过来吧，我的孩子，\n母亲还会像以前一样一直陪伴你的。",
        "\t[小粽,hero]\b[hero]对不起，虽然我很思念你，但是！",
        "\t[小粽,hero]\b[hero]我不能就此停下！",
        "\t[小粽,hero]\b[hero]天破苍穹！给我破！！",
        {
            "type": "animate",
            "name": "attack17",
            "loc": [
                6,
                10
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "VXIce8.ogg"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "VXBreath.ogg"
        },
        {
            "type": "sleep",
            "time": 90
        },
        {
            "type": "playSound",
            "name": "spark1.wav"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": "MT289",
            "loc": [
                6,
                10
            ],
            "direction": "up",
            "time": 0
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240115,240129,240129,240129,240129,240129,240129,240129,240129,240129,240129,240129,240131],
    [240122,240037,240037,240037,240037,240037,240037,240037,240037,240037,240037,240037,240120],
    [240122,240045,240045,240045,240045,240045,240045,240045,240045,240045,240045,240045,240120],
    [240122,240053,240053,240053,240053,240053,240053,240053,240053,240053,240053,240053,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,240606,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,675,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,1042,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,827,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,1042,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240099,240105,240105,240105,240105,240106,826,240104,240105,240105,240105,240105,240091]
],
    "bgmap": [
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,240324,  0,  0,  0,  0,240306,  0,  0,  0,  0,240324,  0],
    [  0,240294,240295,  0,240306,  0,  0,  0,240306,  0,240294,240295,  0],
    [  0,240302,240303,240320,240321,240589,240590,240591,  0,240320,240302,240303,  0],
    [  0,240310,240311,240328,240329,240597,240598,240599,  0,240328,240310,240311,  0],
    [  0,  0,  0,240336,  0,240605,  0,240607,  0,240336,  0,  0,  0],
    [  0,  0,  0,  0,240337,240337,  0,  0,  0,  0,240337,  0,  0],
    [  0,240696,240697,240698,  0,  0,  0,  0,  0,240696,240697,240698,  0],
    [  0,240704,240705,240706,  0,  0,  0,  0,  0,240704,240705,240706,  0],
    [  0,240712,240713,240714,  0,  0,  0,  0,  0,240712,240713,240714,  0],
    [  0,240720,240721,240722,  0,  0,  0,  0,  0,240720,240721,240722,  0],
    [  0,240728,240729,240730,  0,  0,  0,  0,  0,240728,240729,240730,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,240356,  0,240356,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,240364,  0,240364,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}