main.floors.MT28=
{
    "floorId": "MT28",
    "title": "登天潭径（左一）",
    "name": "登天潭径（左一）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 10,
    "defaultGround": "grass2",
    "bgm": "battle2.mp3",
    "firstArrive": [
        {
            "type": "showStatusBar"
        },
        {
            "type": "setCurtain",
            "color": [
                85,
                85,
                85,
                0.3
            ],
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,1": [
            "\t[仙琳,fairy]\b[this,2,1]小粽，我们已经来到剑之巅的外围地带：登天潭径。",
            "\t[仙琳,fairy]\b[this,2,1]堇姐姐所管辖的区域分为三个大区域:登天潭径 登天之路 登天之巅。",
            "\t[仙琳,fairy]\b[this,2,1]这中间每一个区域都至少是你之前打的前20F那样大小的区域。",
            "\t[小粽,hero]\b[hero]仙琳，那么我们现在所在的登天潭径与之前相比有什么不一样的地方？",
            "\t[仙琳,fairy]\b[this,2,1]登天潭径这个地方首先是处于四星尊天的边缘地带，这里常年光照稀少，全年潮湿。",
            "\t[仙琳,fairy]\b[this,2,1]并且登天潭径这个地方其实算是一个比较大的迷宫，就算是常年在这里生存的生灵也会在这里迷路。",
            "\t[仙琳,fairy]\b[this,2,1]由于四星尊天这个领域太过庞大，光靠四大巅峰的掌门人是完全无法全面管辖的。",
            "\t[仙琳,fairy]\b[this,2,1]所以当初魔塔高层决定：将四星尊天的各个中等大小的领域全部配有数位实力强大的高手驻守。",
            "\t[仙琳,fairy]\b[this,2,1]简单的说，就是我们现在所处的登天潭径就至少有三位头目级的高手在其驻守和闭关。",
            "\t[小粽,hero]\b[hero]三位头目级别的高手......看来是一场苦战了！",
            "\t[仙琳,fairy]\b[this,2,1]还有，因为这里是野外，你的楼层传送器会暂时失灵。",
            "\t[仙琳,fairy]\b[this,2,1]嗯......我这里有三颗五阶黄宝石，如果你觉得打的很吃力的话可以从我这里拿走，并且我还会送你一把绿钥匙！",
            {
                "type": "choices",
                "text": "\t[仙琳,fairy]三颗五阶黄宝石外加一把绿钥匙",
                "choices": [
                    {
                        "text": "咸了！！！",
                        "action": [
                            {
                                "type": "addValue",
                                "name": "item:greenKey",
                                "value": "1"
                            },
                            {
                                "type": "addValue",
                                "name": "status:atk",
                                "value": "150"
                            },
                            {
                                "type": "addValue",
                                "name": "status:def",
                                "value": "150"
                            },
                            {
                                "type": "hide",
                                "loc": [
                                    [
                                        2,
                                        1
                                    ]
                                ],
                                "time": 0
                            }
                        ]
                    },
                    {
                        "text": "不用",
                        "action": [
                            "\t[仙琳,fairy]\b[this,2,1]那好吧，等会要是被这些魔物锤死可不要怪人家。",
                            {
                                "type": "hide",
                                "loc": [
                                    [
                                        2,
                                        1
                                    ]
                                ],
                                "time": 0
                            }
                        ]
                    }
                ]
            }
        ],
        "2,2": [
            "【系统】这个区域所有宝石与血瓶提升的能力为10倍",
            "【系统】第二章结尾钥匙道具属性会进行大调整与清空,所以要咸赶紧咸呀！！",
            "\t[小粽,hero]\b[hero]居然清空道具与钥匙，不亲民！",
            {
                "type": "hide",
                "time": 0
            }
        ]
    },
    "changeFloor": {
        "12,9": {
            "floorId": "MT29",
            "loc": [
                0,
                9
            ],
            "time": 0
        },
        "12,4": {
            "floorId": "MT29",
            "loc": [
                0,
                4
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [141,141,  0,141,141,141,141,141,141,141,141,141,141],
    [141,141,124,141, 21,141,437,100016,100017, 21,141,141,141],
    [141,141,  0,141, 30,404, 29,100023,141,366, 81,100007,141],
    [141,141, 21,141, 31,141,100021,100031,141, 30,460, 27,141],
    [141,141, 21,141,141,141, 31,100012,141,141,141,485, 94],
    [141,141, 22,100038,100039,100010,140, 29,140,100007,141,141,141],
    [141,141, 33, 34,  0,456,140,231,141, 31,141,141,141],
    [141,141,141,141,141,141, 31,141,141, 27,141,141,141],
    [141,141,141,141,141,141,467,141,141,140,140,141,141],
    [141,141,100021, 21, 29,100007, 28,141,141,141,100021,478, 94],
    [141,141,141,433,141,141,441,141,141,141, 81,141,141],
    [141,141, 27, 31, 27,141, 21, 30,141,141, 34,141,141],
    [141,141,141,141,141,141,141,141,141,141,141,141,141]
],
    "bgmap": [
    [141,141,140,141,141,141,141,141,141,141,141,141,141],
    [141,141,140,141,140,141,140,140,140,140,141,141,141],
    [141,141,140,141,140,140,140,140,141,140,140,140,141],
    [141,141,140,141,140,141,140,140,141,140,140,140,141],
    [141,141,140,141,141,141,140,140,141,141,141,140,140],
    [141,141,140,140,140,140,140,140,140,140,141,141,141],
    [141,141,140,140,140,140,140,140,141,140,141,141,141],
    [141,141,141,141,141,141,140,141,141,140,141,141,141],
    [141,141,141,141,141,141,140,141,141,140,140,141,141],
    [141,141,140,140,140,140,140,141,141,141,140,140,140],
    [141,141,141,140,141,141,140,141,141,141,140,141,141],
    [141,141,140,140,140,141,140,140,141,141,140,141,141],
    [141,141,141,141,141,141,141,141,141,141,141,141,141]
],
    "fgmap": [
    [ 17, 17,  0, 17, 17, 17, 17, 17, 17, 17, 17, 17,100015],
    [ 17, 17,  0, 17,  0, 17,  0,  0,  0,  0, 17, 17, 17],
    [ 17, 17,  0, 17,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [100091, 17,  0, 17,  0, 17,  0,  0,  0,  0,  0,  0, 17],
    [100029, 17,  0, 17, 17, 17,  0,  0, 17, 17, 17,  0,  0],
    [100037, 17,  0,  0,  0,  0,  0,  0,  0,  0, 17, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0, 17,  0, 17,100091, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17,  0, 17, 17, 17],
    [100015, 17, 17, 17, 17, 17,  0, 17, 17,  0,  0, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0, 17, 17, 17,  0,  0,  0],
    [ 17, 17, 17,  0, 17, 17,  0, 17, 17, 17,  0, 17, 17],
    [ 17, 17,  0,  0,  0, 17,  0,  0, 17, 17,  0, 17, 17],
    [100091, 17, 17, 17, 17, 17, 17, 17, 17,100014, 17, 17,100091]
],
    "color": [
        85,
        85,
        85,
        0.3
    ],
    "bg2map": [

],
    "fg2map": [

]
}