main.floors.MT289=
{
    "floorId": "MT289",
    "title": "本部实验室（最深处）",
    "name": "本部实验室（最深处）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "disorder2.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]看来，与我设想的一样，这是你独特的领域。",
        "\t[堇·未知形态,N1424]\b[this,6,6]不可能！你怎么可能突破圣羽洛斯大人所给予我的神之力？！",
        "\t[小粽,hero]\b[hero]趁星钰准备感悟你的一瞬间，\n施展出所谓的神之力来创造一种假象来迷惑我们。",
        "\t[小粽,hero]\b[hero]相比之前纯粹的黑暗之力，这股力量更为诡异与阴险！",
        "\t[小粽,hero]\b[hero]不过这也是你最后的底牌了！",
        "\t[堇·未知形态,N1424]\b[this,6,6]不可能！我怎么可能败给一个失败的试验体！！",
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        "\t[小粽,hero]\b[hero]消失吧！你体内本不应该存在的力量！！",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[？？？？]不可能！一个小鬼怎么可能做到如此！！",
        "\t[？？？]混蛋！你究竟是什么身份？！\n一个废弃的试验体怎么可能打破我们两个联手的禁制！！",
        "\t[小粽,hero]呵,看来你们就是寄生于堇身上的邪恶力量吧:黑暗之力与神之力！",
        "\t[黑暗之力]嘿嘿嘿！虽然你这个小鬼实力不差，但是在我们面前还是不够看的！！",
        "\t[神之力]就是就是！你现在速速投降，\n说不定我们还会大发慈悲饶你一命呢！！",
        "此时这两股力量看到小粽胸口上的项链顿时吓了一跳。",
        "\t[黑暗之力]这是！！神之祭品内最纯粹的力量！！\n怎么可能在你手上？！",
        "\t[神之力]这...这！这的确是神之祭品的核心力量！",
        "\t[神之力]明明八年前神之祭品已经被我们所截获了！\n这东西怎么可能在你的手中！！",
        "\t[小粽,hero]项链？神之祭品？？八年前.......",
        "\t[小粽,hero]你们是说.....这个项链是神之祭品的？",
        "\t[黑暗之力]不然呢！没想到你这个被废弃的试验体居然侥幸获得了神之祭品的核心力量！\n真是走了狗屎运！！",
        "\t[神之力]就是！就是！要不是当年没有这股核心力量，\n大人早就完成最后的试验了！",
        "\t[神之力]所以快快交出来吧！垃圾品！！",
        "\t[小粽,hero]你们知道.....为什么这个项链会在我的手中吗？",
        "\t[黑暗之力/神之力]为什么？",
        "\t[小粽,hero]因为..............这个项链..................",
        "\t[小粽,hero]\r[red]是母亲给予我最后的遗物！！！",
        "\t[小粽,hero]\r[red]而且我的母亲.......也就是所谓的神之祭品......\n也就是在八年前被你们害死的！！！",
        "\t[小粽,hero]\r[red]去死吧！你们这两个罪恶滔天的灵气！！",
        "\t[黑暗之力/神之力]等等！！我们可以！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 200,
            "times": 5
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        "\t[黑暗之力/神之力]不！！！！！",
        "\t[黑暗之力/神之力]大人是不会！！放过你的！！！",
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        "\t[小粽,hero]\b[hero]呼....呼............",
        "\t[小粽,hero]\b[hero]看来一切都结束了.........",
        "\t[堇,N1424]\b[this,6,6]....................我................我这是在哪...............。",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                6
            ]
        },
        "\t[堇,N1424]\b[this,6,6]你是..................小粽吗......。",
        "\t[小粽,hero]\b[hero]你先别说话了，让我看看你现在身体状况如何。",
        {
            "type": "sleep",
            "time": 500
        },
        "小粽感知了一下堇的情况。",
        "\t[小粽,hero]\b[hero]嗯？为什么我感受不到你修为力量的波动。",
        "\t[堇,N1424]\b[this,6,6]呼.....呼.....呼........看来...的确是这样的.......。",
        "\t[小粽,hero]\b[hero]什么意思？",
        "\t[堇,N1424]\b[this,6,6]因为...........我......已经.....修为净损了....与凡人无异了....。",
        "\t[小粽,hero]\b[hero]什么？！！这.......",
        "\t[小粽,hero]\b[hero]怎么会这样.....究竟发生了些什么？！",
        "\t[堇,N1424]\b[this,6,6]是这样的........",
        {
            "type": "autoSave"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": ":next",
            "loc": [
                6,
                4
            ],
            "direction": "down",
            "time": 500
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240115,240129,240129,240129,240129,240129,240129,240129,240129,240129,240129,240129,240131],
    [240122,240037,240037,240037,240037,240037,240037,240037,240037,240037,240037,240037,240120],
    [240122,240045,240045,240045,240045,240045,240045,240045,240045,240045,240045,240045,240120],
    [240122,240053,240053,240053,240053,240053,240053,240053,240053,240053,240053,240053,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,240606,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,1424,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240099,240105,240105,240105,240105,240106,  0,240104,240105,240105,240105,240105,240091]
],
    "bgmap": [
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,240324,  0,  0,  0,  0,240306,  0,  0,  0,  0,240324,  0],
    [  0,240294,240295,  0,240306,  0,  0,  0,240306,  0,240294,240295,  0],
    [  0,240302,240303,240320,240321,240589,240590,240591,  0,240320,240302,240303,  0],
    [  0,240310,240311,240328,240329,240597,240598,240599,  0,240328,240310,240311,  0],
    [  0,  0,  0,240336,  0,240605,  0,240607,  0,240336,  0,  0,  0],
    [  0,  0,  0,  0,240337,240337,  0,  0,  0,  0,240337,  0,  0],
    [  0,240696,240697,240698,  0,  0,  0,  0,  0,240696,240697,240698,  0],
    [  0,240704,240705,240706,  0,  0,  0,  0,  0,240704,240705,240706,  0],
    [  0,240712,240713,240714,  0,  0,  0,  0,  0,240712,240713,240714,  0],
    [  0,240720,240721,240722,  0,  0,  0,  0,  0,240720,240721,240722,  0],
    [  0,240728,240729,240730,  0,  0,  0,  0,  0,240728,240729,240730,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,240356,  0,240356,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,240364,  0,240364,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}