main.floors.MT287=
{
    "floorId": "MT287",
    "title": "本部实验室负一层（下四）",
    "name": "本部实验室负一层（下四）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "Sky4.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 200000000,
    "defaultGround": "ground",
    "bgm": "battle17.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,0": [
            "\t[星钰,N1250]\b[hero,1]它最后好像说了些什么？",
            "\t[小粽,hero]\b[hero]不知道....",
            "\t[小粽,hero]\b[hero]走吧，既然星天前辈没事,我们就继续前进吧，\n相信星天前辈会与我们汇合的。",
            "\t[星钰,N1250]\b[hero,1]嗯"
        ],
        "6,11": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT273\", \"MT274\", \"MT275\", \"MT276\", \"MT277\", \"MT278\", \"MT279\", \"MT280\", \"MT284\", \"MT285\", \"MT286\", \"MT287\"]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==0)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "time": 0
                    }
                ]
            }
        ],
        "6,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[？？？,E1024]\b[this,6,9]终于找到你们了！",
                {
                    "type": "playSound",
                    "name": "cgefc01.wav"
                },
                {
                    "type": "animate",
                    "name": "unexpected1",
                    "loc": [
                        6,
                        7
                    ],
                    "async": true
                },
                {
                    "type": "playSound",
                    "name": "cgefc01.wav"
                },
                {
                    "type": "animate",
                    "name": "unexpected1",
                    "loc": "hero"
                },
                "\t[小粽,hero]\b[hero]你..是之前在玄天道门阻拦我们的家伙？！",
                "\t[小粽,hero]\b[hero]你会出现在这里那也就是说........。",
                {
                    "type": "playSound",
                    "name": "cgefc01.wav"
                },
                {
                    "type": "animate",
                    "name": "unexpected1",
                    "loc": [
                        6,
                        7
                    ]
                },
                "\t[星钰,N1250]\b[hero,1]不......不可能！难道父亲大人他........。",
                "\t[？？？,E1024]\b[this,6,9]哦？你说那个男人嘛？！",
                "\t[？？？,E1024]\b[this,6,9]哼！那个家伙也就只有逃跑的本事了！",
                "\t[星钰,N1250]\b[hero,1]呼！没事就好！！",
                "\t[小粽,hero]\b[hero]星钰,现在的情况好像不是很对呀..",
                "\t[？？？,E1024]\b[this,6,9]放心！等你们死后,那个家伙也会陪你们上路的！",
                "\t[小粽,hero]\b[hero]星钰！小心！！这个家伙虽然受过伤,但还是不容小觑！！",
                "\t[星钰,N1250]\b[hero,1]我知道！",
                {
                    "type": "battle",
                    "id": "E1024"
                },
                "\t[？？？,E1024]\b[this,6,9]唔啊！不可能！你们两个小鬼怎么可能击败我？！",
                "\t[小粽,hero]\b[hero]你那罪恶的身躯！就此终结吧！",
                "\t[？？？,E1024]\b[this,6,9]等等！你....你原来与她一样是！",
                {
                    "type": "animate",
                    "name": "attack9",
                    "loc": [
                        6,
                        9
                    ],
                    "async": true
                },
                {
                    "type": "playSound",
                    "name": "Attack09.wav"
                },
                {
                    "type": "screenFlash",
                    "color": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "times": 1
                },
                {
                    "type": "sleep",
                    "time": 200
                },
                {
                    "type": "playSound",
                    "name": "Blow4.ogg"
                },
                "\t[？？？,E1024]\b[this,6,9]呃啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！",
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            7
                        ]
                    ],
                    "floorId": "MT288",
                    "time": 0
                },
                {
                    "type": "hide",
                    "remove": true,
                    "time": 500
                },
                {
                    "type": "insert",
                    "loc": [
                        0,
                        0
                    ]
                },
                {
                    "type": "waitAsync"
                }
            ]
        },
        "6,12": [
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        12
                    ]
                ],
                "floorId": "MT288",
                "time": 0
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        10
                    ]
                ],
                "floorId": "MT288",
                "time": 0
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "floorId": "MT288",
                "time": 0
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "floorId": "MT288",
                "time": 0
            },
            "小粽和星钰在击败这些未知生物之后不断继续前进\n并且在途中小粽感觉到这座实验室内的呼唤声愈发强烈",
            "但是奇怪的是\n在击败之前阻拦他们的未知生物之后就再也没有任何试验体来阻拦小粽他们了....",
            "很快,小粽与星钰就来到了圣羽洛斯本部实验室的最深处！\n而在此等候他们的是..............",
            {
                "type": "changeFloor",
                "floorId": ":next",
                "loc": [
                    6,
                    14
                ],
                "direction": "up",
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "MT286",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {
        "3,8": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "1,8": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "2,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "3,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "1,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "9,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "10,7": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "9,8": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,8": [
            {
                "type": "setValue",
                "name": "flag:door_MT287_6_8",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,8": {
            "0": {
                "condition": "flag:door_MT287_6_8==10",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "map": [
    [  0,230102,230102,230102,230102,230103, 91,230101,230102,230102,230102,230102,  0],
    [230095,230288,230288,230288,230288,  0, 34,  0,230288,230288,230288,230288,230093],
    [230095,230288,230288,230288,230288,367,  0,367,230288,230288,230288,230288,230093],
    [230095,230288,230288,230288,230288,  0, 34,  0,230288,230288,230288,230288,230093],
    [230095,230288,230288,230288,230288,351,383,351,230288,230288,230288,230288,230093],
    [230095,230288,230288,230288,230288,  0, 34,  0,230288,230288,230288,230288,230093],
    [230095,1040,  0,1040,230288,335,383,335, 81,1040,  0,1040,230093],
    [230095,  0,1040,  0, 81,  0, 34,  0,230288,  0,1040,  0,230093],
    [230095,1040,  0,1040,230288,230288, 85,230288,230288,1040,  0,1040,230093],
    [230095,230288,230288,230038,230060,230061,1024,230060,230061,230038,230288,230288,230093],
    [230095,230288,230288,230046,396,348,364,348,396,230046,230288,230288,230093],
    [230095,230288,230288,230054,667,396,670,396,667,230054,230288,230288,230093],
    [  0,230086,230086,230086,230086,230087, 93,230085,230086,230086,230086,230086,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,230005,  0,  0,  0,  0,  0,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,230005,  0],
    [  0,  0,  0,  0,  0,  0,230005,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}