main.floors.MT291=
{
    "floorId": "MT291",
    "title": "研究室(回忆）",
    "name": "研究室(回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "choices",
            "text": "是否查看怪物属性？",
            "choices": [
                {
                    "text": "是",
                    "action": [
                        {
                            "type": "callBook"
                        },
                        {
                            "type": "waitAsync"
                        }
                    ]
                },
                {
                    "text": "不",
                    "action": []
                }
            ]
        },
        "\t[圣羽洛斯,N1379]\b[this,2,4]哎呀呀，没想到梦大人真的屈尊前来我这小小实验室来监督我呢！",
        "\t[梦,N1271]\b[this,3,5]哼！油嘴滑舌！赶快完成魔王大人交给你的试验！",
        "\t[圣羽洛斯,N1379]\b[this,2,4]诶，是，是，我一定好好完成试验,行了吧",
        "\t[？？？]圣羽洛斯！你给我认真一点！！别再划水了！！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                2,
                7
            ]
        },
        {
            "type": "setBlock",
            "number": "E1423",
            "loc": [
                [
                    2,
                    7
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                2,
                4
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                3,
                5
            ]
        },
        {
            "type": "setBlock",
            "number": "E509",
            "loc": [
                [
                    2,
                    4
                ]
            ],
            "time": 0
        },
        {
            "type": "setBlock",
            "number": "E514",
            "loc": [
                [
                    3,
                    5
                ]
            ],
            "time": 0
        },
        "\t[圣羽洛斯,E509]\b[this,2,4]是魔王大人？！",
        "\t[梦,E514]\b[this,3,5]这么快就回来了？是遇到什么事了吗......",
        "\t[魔王,E1423]\b[this,2,7]嗯,这次我在阴之坛找到了有趣的人，就让你们来看看。",
        "\t[圣羽洛斯,E509]\b[this,2,4]哦？是什么人物居然让魔王大人感兴趣呢！",
        "\t[梦,N682]\b[this,3,5]..................",
        "\t[魔王,E1423]\b[this,2,7]冥道门 ！开！！",
        {
            "type": "playSound",
            "name": "138-Darkness01.ogg"
        },
        {
            "type": "animate",
            "name": "attack19",
            "loc": [
                2,
                6
            ]
        },
        {
            "type": "setBlock",
            "number": "N1043",
            "loc": [
                [
                    2,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                2,
                4
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                3,
                5
            ]
        },
        "\t[魔王,E1423]\b[this,2,7]这个人，你们应该非常熟悉吧！",
        "\t[圣羽洛斯,E509]\b[this,2,4]哦？让我想一想......。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                2,
                4
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[圣羽洛斯,E509]\b[this,2,4]哦！我想起来了！！这个家伙不是在当年逃脱的试验体吗？",
        "\t[魔王,E1423]\b[this,2,7]你说的没错！这个人的确是当年那个试验体！\n而现在这个人却已经成为神之勇者的朋友，并且还闯到了阴阳圣坛中的阴之坛！",
        "\t[圣羽洛斯,E509]\b[this,2,4]啧啧啧......没想到呀......，\n当年逃脱掉的试验体居然成为了神之勇者的朋友呢.......。",
        "\t[圣羽洛斯,E509]\b[this,2,4]对了，魔王大人，你现在打算怎么处理这个试验体呢？",
        "\t[魔王,E1423]\b[this,2,7]本座把这个试验体重新交给你手上，\n你自己心里清楚该怎么去做吧！",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                2,
                4
            ]
        },
        "\t[圣羽洛斯,E509]\b[this,2,4]原来如此........属下心中自有分寸！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "不知道过了多久.......。",
        {
            "type": "playBgm",
            "name": "disorder4.mp3",
            "keep": true
        },
        "\t[圣羽洛斯]我将这两股具有灵智的力量重新输入你的体内！",
        "\t[圣羽洛斯]而且从现在起！你就是神之力与黑暗之力的掌控者！！",
        "\t[圣羽洛斯]去完成你的使命吧！！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[堇]................是！圣羽洛斯大人！！",
        "等被圣羽洛斯洗脑后的堇离去之后.....。",
        "\t[圣羽洛斯]去吧！赶快去完成吧！！帮我把神之勇者带回来！！\n帮我带来那最后的材料吧！！",
        "\t[圣羽洛斯]至于最后吗......你最后化为一个废人吧！！",
        "\t[圣羽洛斯]这就是你的使命！！这就是你的命运！！",
        "\t[圣羽洛斯]嘿嘿嘿嘿嘿！！！哈哈哈哈哈哈哈！！",
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "insert",
            "loc": [
                12,
                0
            ]
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,0": [
            {
                "type": "pauseBgm"
            },
            {
                "type": "setHeroIcon",
                "name": "hero.png"
            },
            {
                "type": "setValue",
                "name": "flag:heroLight",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "flag:darkRatio",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "flag:lightRadius",
                "value": "0"
            },
            {
                "type": "function",
                "function": "function(){\ncore.control.drawHero();\n}"
            },
            {
                "type": "changeFloor",
                "floorId": "MT289",
                "loc": [
                    6,
                    7
                ],
                "direction": "up",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[堇,N1424]\b[this,6,6]我只记得......我被那个叫圣羽洛斯的人给洗脑了.......。\n并且在你清除掉我那体内的黑暗与神之力的同时....我的修为也就净损了...。",
            "\t[小粽,hero]\b[hero]居然会这样............",
            "\t[小粽,hero]\b[hero]圣羽洛斯！这个混蛋！！",
            "\t[堇,N1424]\b[this,6,6]不要生气.....毕竟我还活着呀............这已经算是不幸中的万幸了呀.......。",
            "\t[小粽,hero]\b[hero]...............",
            "\t[???]他们的气息最后遗留在这门口了呢......。",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            {
                "type": "changePos",
                "loc": [
                    6,
                    7
                ],
                "direction": "down"
            },
            "\t[小粽,hero]什么人？！",
            {
                "type": "setBlock",
                "number": "N1195",
                "loc": [
                    [
                        6,
                        12
                    ]
                ],
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[小粽,hero]\b[hero]星天前辈！你没事吧！",
            "\t[星天,N1195]\b[this,6,12]我没事,这里发生了些什么？\n怎么感觉这里这么诡异......",
            "\t[星天,N1195]\b[this,6,12]诶？你背后的那个女孩子是谁？\n还有星钰怎么在你身边昏迷了？",
            "\t[小粽,hero]\b[hero]是这样的...........",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "小粽把之前发生的一切都告诉给了星天",
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[星天,N1195]\b[this,6,12]........这样呀.....没想到居然会发生这种事......",
            "\t[小粽,hero]\b[hero]嗯,都怪我的实力还不够强，\n不然也不会让星钰她陷入昏迷了.......",
            "\t[星天,N1195]\b[this,6,12]不，这并不怪你，,是我低估了圣羽洛斯的手段了，\n被他阴了一手才导致如此现状的。",
            "\t[星天,N1195]\b[this,6,12]同时我们也没想到这个实验室居然是圣羽洛斯打的幌子........，\n这个实验室居然已经被他给废弃了...，\n只留下了那些奇形怪状的生物.....。",
            "\t[星天,N1195]\b[this,6,12]不过现在星钰的状态比较差，\n我必须把她送到前辈那里去治疗，\n不然就危险了。",
            "\t[星天,N1195]\b[this,6,12]并且你这个叫堇的朋友我也会一同送到前辈那里去，\n毕竟她已经没有战斗能力了，帮不了你什么了。",
            "\t[星天,N1195]\b[this,6,12]而你就直接去最后一个领域：永生之巅！\n等我把她们两个送到前辈那里去之后，\n我会第一时间去支援你！毕竟已经没有时间继续拖延了！",
            "\t[小粽,hero]\b[hero].......行！",
            "\t[堇,N1424]\b[this,6,6]小粽，一路顺风！我现在只有祈祷的力量了.....。",
            "\t[小粽,hero]\b[hero]有这句话就足够了！",
            "\t[星天,N1195]\b[this,6,12]小粽，一定要小心！\n圣羽洛斯这个人非常危险，一定要小心应对！",
            "\t[小粽,hero]\b[hero]明白了，星天前辈你也同样抓紧时间吧，\n不然就来不及了。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "小粽在与堇,星天告别之后，\n来到了圣羽洛斯管辖的最后一个区域：永生之巅！",
            {
                "type": "changeFloor",
                "floorId": "MT292",
                "loc": [
                    6,
                    12
                ],
                "direction": "up",
                "time": 0
            },
            {
                "type": "waitAsync"
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,160016,160017,160017,160017,230324,230325,230322,230323,160017,160017,160018,149],
    [149,160024,160025,160025,160025,230332,230333,230330,230331,160025,160025,160026,149],
    [149,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,149],
    [149,  0,1379,  0,  0,  0,  0,  0,  0,  0,  0,  0,149],
    [149,  0,  0,1271,  0,  0,  0,  0,  0,  0,  0,  0,149],
    [160016,  0,  0,230273,230129,230129,230129,230129,230129,230272,  0,  0,149],
    [160024,  0,  0,230281,  0,  0,  0,  0,  0,230280,  0,  0,149],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,149],
    [149,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,149],
    [149,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,149],
    [149,149,149,149,149,  0,  0,  0,149,149,149,149,149],
    [149,149,149,149,149,149,149,149,149,149,149,149,149]
],
    "bgmap": [
    [150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000],
    [150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000],
    [150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,150000],
    [150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000,150000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,220976,220977,  0,  0,220979,  0,  0,  0,  0,  0,  0,  0],
    [  0,220984,220985,230105,230106,  0,  0,  0,  0,230104,230090,230091,  0],
    [  0,220992,  0,230113,230114,  0,  0,  0,  0,230112,230098,230099,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,230124,230125,  0,  0,  0,  0,  0,  0,  0,230126,230127,  0],
    [  0,230132,230133,  0,  0,  0,  0,  0,  0,  0,230134,230135,  0],
    [  0,230140,230141,  0,  0,  0,220988,  0,  0,  0,230142,230143,  0],
    [  0,  0,  0,  0,  0,  0,220996,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,230324,230325,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,230332,230333,  0,  0,  0,  0,  0,  0],
    [  0,230014,220993,230014,230014,230342,230343,230342,230343,230014,230014,230014,  0],
    [  0,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,  0],
    [  0,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,  0],
    [  0,230014,230014,230128,230014,230014,230014,230014,230014,230130,230014,230014,  0],
    [  0,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,  0],
    [230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,230014,  0],
    [  0,230014,230014,230014,230014,220979,220980,220981,230014,230014,230014,230014,  0],
    [  0,230014,230014,230014,230014,220987,220988,220989,230014,230014,230014,230014,  0],
    [  0,230014,230014,230014,230014,220995,220996,220997,230014,230014,230014,230014,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}