main.floors.MT29=
{
    "floorId": "MT29",
    "title": "登天潭径（左二）",
    "name": "登天潭径（左二）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 10,
    "defaultGround": "grass2",
    "bgm": "battle2.mp3",
    "color": [
        85,
        85,
        85,
        0.3
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,9": [
            {
                "type": "choices",
                "text": "\t[???,N321]三百块即可够买三把黄钥匙！",
                "choices": [
                    {
                        "text": "买了！",
                        "action": [
                            {
                                "type": "if",
                                "condition": "(status:money>=300)",
                                "true": [
                                    "\t[???,N321]\b[this,8,9]果然是三百金币，给你三把黄钥匙。",
                                    {
                                        "type": "addValue",
                                        "name": "status:money",
                                        "value": "-300"
                                    },
                                    {
                                        "type": "addValue",
                                        "name": "item:yellowKey",
                                        "value": "3"
                                    },
                                    "\t[???,N321]\b[this,8,9]好了，我该去下一个地方卖钥匙了，有缘再见。",
                                    {
                                        "type": "hide",
                                        "time": 500
                                    }
                                ],
                                "false": [
                                    "\t[???,N321]\b[this,8,9]钱呢？！没钱还想要钥匙？？"
                                ]
                            }
                        ]
                    },
                    {
                        "text": "等等",
                        "action": [
                            "\t[???,N321]\b[this,8,9]机不可失时不再来呀！快来买呀！！",
                            {
                                "type": "exit"
                            }
                        ]
                    }
                ]
            }
        ],
        "9,9": [
            {
                "type": "changePos",
                "direction": "left"
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[小粽,hero]\b[hero]你是......？",
            "\t[???,N321]\b[this,8,9]嘿！兄弟你好呀！要不要买点东西？！",
            "\t[小粽,hero]\b[hero]卖东西的？这个地方人烟稀少，根本没有什么生物会在你这里买东西吧？",
            "\t[???,N321]\b[this,8,9]嘿嘿，你有所不知，这个地方是通往四星尊天的必由之路，这个地方也是货物运输的地方，我只是在这里做点小买卖",
            "\t[小粽,hero]\b[hero](这个家伙说的话不可信，但我却完全感受不到他的气息的强弱。）",
            "\t[小粽,hero]\b[hero]（他在这个边缘时间出现在边缘地点，肯定是有什么目的的......）",
            "\t[???,N321]\b[this,8,9]嗯？兄弟你怎么了，怎么发起呆来了。",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[小粽,hero]\b[hero]你这里有什么东西卖吗？",
            "\t[???,N321]\b[this,8,9]啊！这个好说，我是专门卖钥匙的。",
            "\t[???,N321]\b[this,8,9]三百金币三把黄钥匙.看你是新顾客。如果你买了，我后面的宝石和血瓶就送给你了，就当做见面礼。",
            "\t[小粽,hero]\b[hero]......我考虑一下。",
            {
                "type": "hide",
                "time": 500
            }
        ],
        "9,11": [
            {
                "type": "if",
                "condition": "(flag:登天潭径进度==3)",
                "true": [
                    "\t[小粽,hero]嗯？那个商人呢",
                    {
                        "type": "setValue",
                        "name": "flag:登天潭径进度",
                        "value": "4"
                    },
                    {
                        "type": "if",
                        "condition": "(flag:买了钥匙==1)",
                        "true": [
                            {
                                "type": "hide",
                                "time": 500
                            }
                        ]
                    }
                ],
                "false": [
                    {
                        "type": "exit"
                    }
                ]
            }
        ],
        "1,1": [
            {
                "type": "if",
                "condition": "flag:登天潭径进度==3",
                "true": [
                    {
                        "type": "setValue",
                        "name": "flag:登天潭径进度",
                        "value": "4"
                    },
                    "\t[小粽,hero]嗯？那个商人呢",
                    {
                        "type": "if",
                        "condition": "flag:买了钥匙==1",
                        "true": [
                            {
                                "type": "hide",
                                "time": 500
                            }
                        ]
                    }
                ],
                "false": [
                    {
                        "type": "hide",
                        "time": 500
                    }
                ]
            }
        ],
        "10,10": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "这里钥匙不一定是必买的，如果你想省的话，就把这个区域的道傀使给打死吧。"
            ]
        },
        "6,12": [
            "\t[小粽,hero]嗯？那个商人呢？",
            {
                "type": "hide",
                "time": 500
            }
        ],
        "11,9": [
            {
                "type": "if",
                "condition": "(flag:登天潭径进度==3)",
                "true": [
                    "\t[小粽,hero]嗯？那个商人呢",
                    {
                        "type": "setValue",
                        "name": "flag:登天潭径进度",
                        "value": "4"
                    },
                    {
                        "type": "if",
                        "condition": "(flag:买了钥匙==1)",
                        "true": [
                            {
                                "type": "hide",
                                "time": 500
                            }
                        ]
                    }
                ],
                "false": [
                    {
                        "type": "exit"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "12,9": {
            "floorId": "MT30",
            "loc": [
                0,
                9
            ],
            "time": 0
        },
        "0,9": {
            "floorId": "MT28",
            "loc": [
                12,
                9
            ],
            "time": 0
        },
        "0,4": {
            "floorId": "MT28",
            "loc": [
                12,
                4
            ],
            "time": 0
        },
        "9,12": {
            "floorId": "MT34",
            "loc": [
                9,
                0
            ],
            "time": 0
        },
        "1,0": {
            "floorId": "MT39",
            "loc": [
                1,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 17, 91, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 34, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,406, 17, 17, 17, 17, 17,383, 17, 17, 17, 17, 17],
    [ 17, 32, 17, 17, 17, 17,467, 32,467, 17, 17, 17, 17],
    [ 92, 32, 17, 17, 17, 17, 27,100010, 27, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 17,467,100021,467, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 31,413, 21,  0,404, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 30, 17, 82, 81, 28, 17, 17, 17],
    [ 17, 17, 17, 17, 81,100007, 17, 83,100010,  0, 17, 17, 17],
    [ 92, 29, 31,140, 28,433, 17,397,1268,140, 28,522, 94],
    [ 17, 81,100012,460, 17, 17, 17,400, 17,100007,129, 17, 17],
    [ 17, 31, 27, 21, 17, 17, 17, 17, 17,485, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 93, 17, 17, 17]
],
    "bgmap": [
    [141,140,141,141,141,141,141,141,141,141,141,141,141],
    [141,140,141,141,141,141,141,141,141,141,141,141,141],
    [141,140,141,141,141,141,141,140,141,141,141,141,141],
    [141,140,141,141,141,141,140,140,140,141,141,141,141],
    [140,140,141,141,141,141,140,140,140,141,141,141,141],
    [141,141,141,141,141,141,140,140,140,141,141,141,141],
    [141,141,141,141,141,140,140,140,140,140,141,141,141],
    [141,141,141,141,141,140,141,140,140,140,141,141,141],
    [141,141,141,141,140,140,141,140,140,140,141,141,141],
    [140,140,140,140,140,140,141,140,140,140,140,140,140],
    [141,140,140,140,141,141,141,140,141,140,140,141,141],
    [141,140,140,140,141,141,141,141,141,140,141,141,141],
    [141,141,141,141,141,141,141,141,141,140,141,141,141]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,100027,100028,  0,  0,100091,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,100044,100045,100046,  0],
    [  0,  0,  0,  0,100091,  0,  0,  0,  0,100052,100053,100054,100055],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,100060,100061,100062,100063],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,100068,100069,100070,100071],
    [  0,  0,  0,100014,  0,  0,  0,  0,  0,  0,  0,  0,100015],
    [100091,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,100027,100028,  0,  0,  0,  0,  0,  0,  0,  0,  0,100091],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,100027,100028,  0,  0,100091,  0,  0,  0,  0,  0,100091]
],
    "bg2map": [

],
    "fg2map": [

]
}