main.floors.MT301=
{
    "floorId": "MT301",
    "title": "永生之巅第九层",
    "name": "永生之巅第九层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "004-CloudySky01.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "ground",
    "bgm": "battle18.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,12": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT293\", \"MT294\", \"MT295\", \"MT296\", \"MT297\", \"MT298\", \"MT299\", \"MT300\"]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==0)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    {
                        "type": "pauseBgm"
                    },
                    {
                        "type": "setCurtain",
                        "color": [
                            0,
                            0,
                            0,
                            1
                        ],
                        "time": 500,
                        "keep": true
                    },
                    {
                        "type": "changeFloor",
                        "floorId": ":next",
                        "loc": [
                            6,
                            14
                        ],
                        "direction": "up",
                        "time": 500
                    },
                    {
                        "type": "hide",
                        "time": 0
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240006,240006,240006,240006,240006,240006,240006,240006,240006,240006,240006,240006,240006],
    [401,402, 83,402,400, 82, 88, 82,400,402, 83,402,401],
    [240006,240006,240006,240006,240006,240006, 21,240006,240006,240006,240006,240006,240006],
    [401,402, 83,402,400, 82,400, 82,400,402, 83,402,401],
    [240006,240006,240006,240006,240006,240006, 21,240006,240006,240006,240006,240006,240006],
    [401,402, 83,402,400, 82,400, 82,400,402, 83,402,401],
    [240006,240006,240006,240006,240006,240006, 21,240006,240006,240006,240006,240006,240006],
    [401,402, 83,402,400, 82,400, 82,400,402, 83,402,401],
    [240006,240006,240006,240006,240006,240006, 22,240006,240006,240006,240006,240006,240006],
    [401,402, 83,402,400, 82,400, 82,400,402, 83,402,401],
    [240006,240006,240006,240006,240006,240006, 22,240006,240006,240006,240006,240006,240006],
    [401,402, 83,402,400, 82,400, 82,400,402, 83,402,401],
    [240006,240006,240006,240006,240006,240006,670,240006,240006,240006,240006,240006,240006]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}