main.floors.MT318=
{
    "floorId": "MT318",
    "title": "光明圣堂(回忆）",
    "name": "光明圣堂(回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50000,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "spendid1.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[众人]参见魔王大人！",
        "\t[魔王,N831]\b[this,6,6]该来的都来了吧！",
        "\t[圣羽洛斯,E510]\b[this,7,9]魔王大人,这次邀我们前来可是为了星家之事？",
        "\t[君无天,N1067]\b[this,6,10]（................）",
        "\t[魔王,N831]\b[this,6,6]姑且算是吧！",
        "\t[圣羽洛斯,E510]\b[this,7,9]诶，那这次我们是打算直接.....。",
        "\t[魔王,N831]\b[this,6,6]看情况，本座虽然身为魔王，但还是得考虑一下众魔物的处境。",
        "\t[圣羽洛斯,E510]\b[this,7,9]....这样呀，那有点可惜了。",
        "\t[圣羽洛斯,E510]\b[this,7,9]不过魔王大人你也应该知道...如果能得到星家的核心科技，\n对我们接下来的计划可谓是一种里程碑的发展！",
        "\t[魔王,N831]\b[this,6,6]................",
        "\t[圣羽洛斯,E510]\b[this,7,9]而且魔王大人你不是打算选拔出第三位三圣之巅的阁主吗？\n那么我们可以利用这次计划找出一些优秀的人才。",
        "\t[圣羽洛斯,E510]\b[this,7,9]其中战果最为优秀的人则可以被评为第三位阁主。",
        "\t[圣羽洛斯,E510]\b[this,7,9]魔王大人你意下如何呢？",
        "\t[君无天,N1067]\b[this,6,10]（！！！圣羽洛斯！原来这就是你打的如意算盘吗？！）",
        "\t[魔王,N831]\b[this,6,6]............好！就按照圣羽洛斯阁主说的吧！",
        "\t[君无天,N1067]\b[this,6,10]（！！不好，魔王他居然答应了！这下麻烦大了！！）",
        "\t[魔王,N831]\b[this,6,6]我们这次兵分两路，一路是正面迎战，一路则是背后包抄。",
        "\t[黯夜殇,N830]\b[this,5,9]魔王大人请放心，属下定能凯旋而归！",
        "\t[圣羽洛斯,E510]\b[this,7,9]嘿嘿嘿，虽说背后包抄有伤颜面，\n但历史是由胜利者书写的！所以我也同意！！",
        "\t[魔王,N831]\b[this,6,6]嗯，那剩下三位就自由选择吧。",
        "\t[圣护之手·天,N740]\b[this,8,10]我选择与圣羽洛斯大人一同行动！",
        "\t[圣护之手·闇,N1083]\b[this,4,10]那我就跟随黯夜殇阁主一起作战！",
        "\t[君无天,N1067]\b[this,6,10]....................我。",
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                6
            ]
        },
        "\t[魔王,N831]\b[this,6,6]你是最近梦所提拔的人吗？\n听说你是来自低等领域的散修呢。",
        "\t[魔王,N831]\b[this,6,6]那你的选择是什么呢？",
        "此时圣羽洛斯头微微一偏看向了君无天，随着逼线成音说道：",
        "我相信你会到我这里的，毕竟你也需要我呀！",
        "\t[君无天,N1067]\b[this,6,10]！！！.......",
        "\t[君无天,N1067]\b[this,6,10]........魔王大人，那我选择跟圣羽洛斯阁主一起背后包抄。",
        "\t[魔王,N831]\b[this,6,6]......是吗？既然你心意已决，那我也没有什么好说的。",
        "\t[魔王,N831]\b[this,6,6]众位听令！在一个星期之后——\r[red]开始执行！",
        "\t[黯夜殇,N830]\b[this,5,9]明白！",
        "\t[圣羽洛斯,E510]\b[this,7,9]嘿嘿嘿，终于要来了吗！我可是非常期待呢！！",
        "\t[圣护之手·天/闇]明白！",
        "\t[君无天,N1067]\b[this,6,10]......明白。",
        "\t[君无天,N1067]\b[this,6,10]（该死！我居然被迫摊上了这潭浑水！\n而且还有阁主级别的人物盯上，这下脱身都成问题了！！）",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "pauseBgm"
        },
        "不久之后",
        {
            "type": "changeFloor",
            "floorId": "MT319",
            "loc": [
                51,
                8
            ],
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,0": [
            {
                "type": "autoSave"
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "changeFloor",
                "floorId": "MT318",
                "loc": [
                    6,
                    4
                ],
                "time": 500
            },
            {
                "type": "playBgm",
                "name": "spendid1.mp3",
                "keep": true
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[众人]参见魔王大人！",
            "\t[魔王,N831]\b[this,6,6]嗯，免礼吧。",
            "\t[众人]谢魔王大人！",
            "\t[魔王,N831]\b[this,6,6]这次本座邀你们前来是因为我已经选好了——三圣之巅的第三位阁主！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    7,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    4,
                    10
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    8,
                    10
                ]
            },
            "\t[圣羽洛斯,N736]\b[this,7,9]哦？！魔王大人！！你已经选好了吗？！！",
            "\t[魔王,N831]\b[this,6,6]没错！本座已经选好了！！",
            "\t[黯夜殇,N830]\b[this,5,9]哦？！会是哪一位呢？！！",
            "\t[魔王,N831]\b[this,6,6]他的名字是.................",
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[魔王,N831]\b[this,6,6]\\d君无天！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    7,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    4,
                    10
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    8,
                    10
                ]
            },
            "\t[圣护之手·天,N740]\b[this,8,10]什么？！为什么是他？！他何德何能能担任阁主之位！！",
            "\t[圣护之手·闇,N1083]\b[this,4,10]就是！就是！明明我为黯夜殇阁主大人在前线浴血奋战，他一个背后包抄者的功劳能跟我相比吗？！",
            "\t[魔王,N831]\b[this,6,6]你们两个....是在质疑本座的\r[red]决定吗！",
            {
                "type": "vibrate",
                "time": 500
            },
            "\t[圣护之手·天,N740]\b[this,8,10]不....不是....只是属下觉得........君无天他并没有干什么就....就..。",
            "\t[魔王,N831]\b[this,6,6]你觉得他没有什么功劳就能担任阁主之位了吗？",
            "\t[魔王,N831]\b[this,6,6]哼！愚蠢！！",
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            "\t[魔王,N831]\b[this,6,6]既然你们这么想知道，那本座就成全你们！",
            "\t[魔王,N831]\b[this,6,6]君无天他独自一人拖住了星家的族长，为黯夜殇与圣羽洛斯分担了足够的压力，而且最后...........!",
            "\t[魔王,N831]\b[this,6,6]\r[red]他独自一人击杀了星家的族长！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    4,
                    10
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    8,
                    10
                ]
            },
            "\t[圣护之手·闇,N1083]\b[this,4,10]什么！这.....怎么会！！",
            "\t[圣护之手·天,N740]\b[this,8,10]这怎么可能！！",
            "\t[圣护之手·天,N740]\b[this,8,10]我与君无天是一起行动的，在那个时候我受到了阵法的攻击，差点就当场暴毙了..他怎么会没事？！",
            "\t[圣护之手·闇,N1083]\b[this,4,10]对呀！我严重怀疑他是不是有什么神秘手段！",
            "\t[魔王,N831]\b[this,6,6]\r[red]哼！学艺不精！！还诬陷他人！！！",
            "\t[魔王,N831]\b[this,6,6]\r[red]梦！给我打飞这两个丢人现眼的家伙！！",
            "\t[圣护之手·天/闇]魔王大人！不要啊！！！",
            "\t[圣羽洛斯/黯夜殇]魔王大人请留手！",
            {
                "type": "screenFlash",
                "color": [
                    255,
                    255,
                    255,
                    1
                ],
                "time": 100,
                "times": 1,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        5
                    ]
                ],
                "time": 0
            },
            {
                "type": "show",
                "loc": [
                    [
                        8,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    7,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    10
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "050-Explosion03.ogg"
            },
            {
                "type": "animate",
                "name": "attack11",
                "loc": [
                    8,
                    10
                ],
                "async": true
            },
            {
                "type": "show",
                "loc": [
                    [
                        4,
                        9
                    ]
                ],
                "time": 0,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "playSound",
                "name": "050-Explosion03.ogg"
            },
            {
                "type": "animate",
                "name": "attack11",
                "loc": [
                    4,
                    10
                ],
                "async": true
            },
            {
                "type": "move",
                "loc": [
                    4,
                    10
                ],
                "time": 1,
                "async": true,
                "steps": [
                    "backward",
                    "backward",
                    "backward",
                    "backward",
                    "backward"
                ]
            },
            {
                "type": "move",
                "loc": [
                    8,
                    10
                ],
                "time": 1,
                "steps": [
                    "backward",
                    "backward",
                    "backward",
                    "backward",
                    "backward"
                ]
            },
            "\t[圣护之手·天/闇]啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！",
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        9
                    ]
                ],
                "time": 0,
                "async": true
            },
            {
                "type": "show",
                "loc": [
                    [
                        8,
                        5
                    ]
                ],
                "time": 0
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    10
                ],
                "async": true
            },
            "\t[君无天,N1067]\b[this,6,10]（这！这速度！！居然连移动的残影都难以捕捉！！！）",
            "\t[君无天,N1067]\b[this,6,10]（这个女人的实力绝对在黯夜殇与圣羽洛斯之上.....甚至直逼仙月前辈！）",
            "\t[魔王,N831]\b[this,6,6]嗯，老鼠飞了，果然就安静的许多呢！",
            "\t[圣羽洛斯/黯夜殇]........................。",
            "\t[魔王,N831]\b[this,6,6]君无天。",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    10
                ],
                "async": true
            },
            "\t[君无天,N1067]\b[this,6,10]魔王大人有什么吩咐？",
            "\t[魔王,N831]\b[this,6,6]过来吧，让我好好看看你。",
            "\t[君无天,N1067]\b[this,6,10]啊...是！是！！",
            {
                "type": "move",
                "loc": [
                    6,
                    10
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "up",
                    "up"
                ]
            },
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[魔王,N831]\b[this,6,6]不错......不错....走的是修剑之道....，而且作为一个散修出身居然能达到如此水平。",
            "\t[魔王,N831]\b[this,6,6]看来你的确有担任阁主的资格！",
            "\t[君无天,N1067]\b[this,6,8]魔王言重了，我还有很长的一段路要走。",
            "\t[魔王,N831]\b[this,6,6]不必谦虚，我相信未来你的成就并不比他们二人差！",
            "\t[君无天,N1067]\b[this,6,8].....................",
            "\t[魔王,N831]\b[this,6,6]\\d从今天起——你就是三圣之巅的第三位阁主了！",
            "\t[魔王,N831]\b[this,6,6]现在你与黯夜殇，圣羽洛斯地位相同，共同管辖三圣之巅！",
            "\t[君无天,N1067]\b[this,6,8]谢魔王大人！魔王大人对我的栽培属下定会铭记于心！！",
            "\t[魔王,N831]\b[this,6,6]呵呵呵........，未来在魔塔之巅定有你的一席之位！",
            "\t[黯夜殇,N830]\b[this,5,9]君阁主，欢迎你的到来。",
            "\t[圣羽洛斯,N736]\b[this,7,9]呵呵呵.....恭喜，恭喜了。",
            "\t[梦,N682]\b[this,8,5]...................。",
            "\t[君无天,N1067]\b[this,6,8]（我成功了，我终于成功了....）",
            "\t[君无天,N1067]\b[this,6,8]（兄弟！灭族之仇，我一定会为你报仇的！）",
            "\t[君无天,N1067]\b[this,6,8]（而这一次,我不会再逃避！我定会让陷害你星家的人付出——\r[red]血的代价！！）",
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "insert",
                "loc": [
                    12,
                    12
                ],
                "floorId": "MT313"
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80034,80009,80032,80033,80033,80033,80033,80027],
    [80026,80044,80040,80041,80067,80044,80009,80044,80066,80041,80041,80044,80024],
    [80026,80052,80048,80049,80075,80052,80009,80052,80074,80049,80049,80052,80024],
    [80026,80060,80056,80057,80083,80060,80009,80060,80082,80057,80058,80060,80024],
    [80026,80009,80178,80179,80009,80009,80009,80009,80009,80178,80179,80009,80024],
    [80026,80009,80009,  0,  0,90602,90603,90604,1371,  0,80009,80009,80024],
    [80026,70124,80009,  0,  0,90610,831,90612,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,80009,80009,  0,682,1387,  0,1379,682,  0,80009,80009,80024],
    [80026,80151,80135,  0,1388,  0,1067,  0,1389,  0,80135,80151,80024],
    [80026,80159,80143,80009,  0,  0,80009,  0,  0,80009,80143,80159,80024],
    [80020,80017,80017,80017,80018,80201,80201,80201,80016,80017,80017,80017,80019]
],
    "bgmap": [
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,143,143,143,143,143,143,143,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009],
    [80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,70069,  0,  0,  0,  0,  0,  0,  0,70069,  0,  0],
    [  0,  0,80162,80163,  0,  0,  0,  0,  0,80162,80163,  0,  0],
    [  0,  0,80170,80171,  0,  0,  0,  0,  0,80170,80171,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,80179,  0,  0],
    [  0,80175,  0,102,  0,  0,  0,  0,  0,102,  0,80175,  0],
    [  0,80175,  0,  0,  0,  0,  0,  0,  0,  0,  0,80175,  0],
    [  0,80175,  0,  0,  0,  0,  0,  0,  0,  0,  0,80175,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,102,  0,  0,  0,  0,  0,102,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90611,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80151,  0,  0,  0,80151,  0,80151,  0,  0,  0,80151,  0],
    [  0,80159,  0,  0,  0,80159,  0,80159,  0,  0,  0,80159,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}