main.floors.MT311=
{
    "floorId": "MT311",
    "title": "魔塔顶层",
    "name": "魔塔顶层",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "holy3.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "defaultGround": "ground",
    "weather": [
        "rain",
        10
    ],
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "holy1.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "choices",
            "text": "是否查看怪物属性？",
            "choices": [
                {
                    "text": "是",
                    "action": [
                        {
                            "type": "callBook"
                        },
                        {
                            "type": "waitAsync"
                        }
                    ]
                },
                {
                    "text": "不",
                    "action": []
                }
            ]
        },
        "\t[魔王,E898]\b[this,6,4]............................",
        "\t[梦,E517]\b[this,7,6]............................",
        "\t[魔王,E898]\b[this,6,4]你知道吗，圣羽洛斯的气息已经消失了.....。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                6
            ]
        },
        "\t[梦,E517]\b[this,7,6]怎么会.......那个家伙怎么可能这么容易就死掉呢！",
        "\t[梦,E517]\b[this,7,6]就算是大人出手也难以解决掉他，到底是怎么一回事..............。",
        "\t[魔王,E898]\b[this,6,4]的确，以武修的方式来杀死他的确非常困难.....但是！",
        "\t[魔王,E898]\b[this,6,4]他是被科技的力量毁灭的！",
        "\t[梦,E517]\b[this,7,6]科技力量........吗？",
        "\t[梦,E517]\b[this,7,6]在当年星家陨落后，圣羽洛斯可以说是除大人以外最顶尖的科学家\n......以他的水平应该没有人的科技力量凌驾他之上吧！",
        "\t[梦,E517]\b[this,7,6]是谁干的呢.............大人您知道吗？",
        "\t[魔王,E898]\b[this,6,4].........................应该是......",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                4
            ]
        },
        "\t[魔王,E898]\b[this,6,4]算了，不管是谁杀死的，跟我并没有什么关系....",
        "\t[魔王,E898]\b[this,6,4]毕竟......圣羽洛斯那个家伙早就该去死了!",
        "\t[梦,E517]\b[this,7,6].............................",
        "\t[梦,E517]\b[this,7,6]大人.....你不是之前说圣羽洛斯是造神计划的核心人物吗？",
        "\t[梦,E517]\b[this,7,6]既然他是核心人物.....那为什么您得知他死讯的时候是以一种漠不关心的态度呢....。",
        "\t[梦,E517]\b[this,7,6]而且您应该是十分在意造神计划的呀.......为什么会出现这种态度呢.........。",
        "\t[魔王,E898]\b[this,6,4]那是我骗他的，我只是在压榨他的价值而已！",
        "\t[梦,E517]\b[this,7,6]..........真的是这样吗.............",
        "\t[魔王,E898]\b[this,6,4]是与不是，这与你并没有什么关系，你只要听从我的命令即可！",
        "\t[梦,E517]\b[this,7,6].........................是。",
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "GG1.mp3",
            "keep": true
        },
        "\t[魔王,E898]\b[this,6,4]............时间也差不多了..........而这次....我将会为你下达最后一道命令！",
        "\t[梦,E517]\b[this,7,6]........是什么?",
        "\t[魔王,E898]\b[this,6,4]你这次会担当一个身份..............那就是.............",
        "\t[魔王,E898]\b[this,6,4]\r[red]神之圣女！",
        {
            "type": "playSound",
            "name": "049-Explosion02.ogg"
        },
        {
            "type": "vibrate",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[梦,E517]\b[this,7,6]................",
        "\t[梦,E517]\b[this,7,6]................................",
        "\t[梦,E517]\b[this,7,6].............................................",
        "\t[梦,E517]\b[this,7,6].............................................神之圣女吗?",
        "\t[梦,E517]\b[this,7,6].............................................",
        "\t[梦,E517]\b[this,7,6].............................................我知道了",
        "\t[梦,E517]\b[this,7,6]\r[red]..................................毕竟这也是我的使命呀！",
        "\t[魔王,E898]\b[this,6,4].............................................",
        "\t[梦,E517]\b[this,7,6]希望大人能够完成造神计划。",
        "\t[梦,E517]\b[this,7,6]毕竟.......这些年我能够一直服侍在大人身边....真的非常开心呢！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                4
            ]
        },
        "此时魔王的身躯不由自主的颤抖了一下,随之回头看向了梦............。",
        {
            "type": "setBlock",
            "number": "N319",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "time": 0
        },
        "\t[魔王,N319]\b[this,6,4].........................你...............",
        "\t[梦,E517]\b[this,7,6]那.......属下我就去完成自己的使命了！",
        {
            "type": "setBlock",
            "number": "N685",
            "loc": [
                [
                    7,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    7,
                    6
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                7,
                6
            ],
            "time": 500,
            "steps": [
                "down",
                "down",
                "down",
                "down"
            ]
        },
        "\t[魔王,N319]\b[this,6,4].............",
        "\t[魔王,N319]\b[this,6,4]..........................",
        "\t[魔王,N319]\b[this,6,4]..........................对不起，或者这对于来说很不公平。",
        "\t[魔王,N319]\b[this,6,4]但是............",
        "\t[魔王,N319]\b[this,6,4]\r[red]这就是我把你创造出来的意义啊！..........",
        "\t[魔王,N319]\b[this,6,4]虽然你与她长相完全一样..............但你不是她...........对不起！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "start.mp3",
            "keep": true
        },
        ".............................",
        {
            "type": "sleep",
            "time": 500
        },
        "...........................................",
        {
            "type": "sleep",
            "time": 500
        },
        "...........................................为什么会这样！",
        {
            "type": "sleep",
            "time": 500
        },
        "不可能！不可能！！这一切都是骗人的吧！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[君无天（回忆）]是吗？你真的认为我说的都是真的吗？！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[君无天（回忆）]你所看到的真的就是现实吗？而不是镜花水月吗？！",
        {
            "type": "playSound",
            "name": "084-Monster06.ogg"
        },
        {
            "type": "sleep",
            "time": 500
        },
        ".............................",
        {
            "type": "sleep",
            "time": 500
        },
        "........................................",
        {
            "type": "sleep",
            "time": 500
        },
        "...................................................",
        {
            "type": "playBgm",
            "name": "disorder4.mp3",
            "keep": true
        },
        "\t[未知的声音]情感的存在即是虚伪！\n正是因为人有七情六欲！\n才会导致这一系列悲剧的产生！！",
        "\t[未知的声音]所以！快来吧！！快来到我们身边吧！！！",
        "\t[未知的声音]抛弃那毫无意义的情感！\n让恶意充斥自己的内心！\n成为只为自己而活的存在吧！！",
        "\t[未知的声音]你还在犹豫什么！快过来吧！！",
        "\t[小粽]我.............",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽]我......................",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽]我..............................",
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "god1.mp3",
            "keep": true
        },
        "\t[？？？]不要相信他！\n你的未来的道路只会属于你自己！！\n容不得任何人去染指！！",
        "\t[未知的声音]你真觉得你能够一手遮天吗！！【    】",
        "\t[？？？]你我虽然都只剩下一缕神识,\n但是你真的以为你可以为所欲为吗！！",
        "\t[？？？]小粽,记住！\n你背后牵连着整个世界的因果之线！！\n绝对不能就此停下！！！",
        "\t[？？？]而有朝一日！你将是这个世界的神！\n这个世界的救世主！所以..........",
        "\t[？？？]你的未来！在你自己手中！！",
        "\t[？？？]以神的名义！拨动命运之针啊！\n来引领迷途的羔羊寻得本心！！！",
        "\t[未知的声音]休............想！！！",
        "\t[？？？]\r[red]生死之念！",
        {
            "type": "screenFlash",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 100,
            "times": 10,
            "async": true
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "changeFloor",
            "floorId": "MT312",
            "loc": [
                6,
                8
            ],
            "direction": "down",
            "time": 0
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80016,80017,80017,80018,  0,  0,  0,80016,80017,80017,80018,  0],
    [  0,80024,80028,80033,80034,  0,  0,  0,80032,80033,80027,80026,  0],
    [  0,80024,80026,80040,80042,  0,898,  0,80040,80042,80024,80026,  0],
    [  0,80024,80026,80048,80050,  0,  0,  0,80048,80050,80024,80026,  0],
    [  0,80024,80026,80056,80058,  0,  0,517,80056,80058,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80026,  0,  0,  0,  0,  0,  0,  0,80024,80026,  0],
    [  0,80024,80020,80017,80017,80017,80017,80017,80017,80017,80019,80026,  0],
    [  0,80032,80033,80033,80033,80033,80033,80033,80033,80033,80033,80034,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80009,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80009,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80009,80009,80009,  0,  0,  0,  0,  0],
    [  0,  0,  0,80009,80009,80009,80009,80009,80009,80009,  0,  0,  0],
    [  0,  0,  0,80009,80009,80009,80009,80009,80009,80009,  0,  0,  0],
    [  0,  0,  0,80009,80009,80009,80009,80009,80009,80009,  0,  0,  0],
    [  0,  0,  0,80009,80009,80009,80009,80009,80009,80009,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,102,  0,  0,  0,  0,  0,102,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,143,143,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}