main.floors.MT314=
{
    "floorId": "MT314",
    "title": "生命之森(回忆）",
    "name": "生命之森(回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "autoSave"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[仙月,E600]\b[this,6,5].....................",
        "\t[仙月,E600]\b[this,6,5].....................出来吧。",
        {
            "type": "setBlock",
            "number": "N585",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                6,
                8
            ]
        },
        {
            "type": "setBlock",
            "number": "N832",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "time": 0
        },
        "\t[魔王,N832]\b[this,6,8]呵呵呵.....好久不见呀！",
        "\t[仙月,N585]\b[this,6,5]..............魔王这次前来是有何目的？",
        "\t[魔王,N832]\b[this,6,8]这次前来我是为了告诉你一件事！",
        "\t[仙月,N585]\b[this,6,5]哦？是什么事情值得魔王....到我这个小地方来呢。",
        "\t[魔王,N832]\b[this,6,8]那是因为....我要打算完成造神计划！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                5
            ]
        },
        "\t[仙月,N585]\b[this,6,5].....你真的想好了吗？你应该知道这个计划的难易度吧！",
        "\t[魔王,N832]\b[this,6,8]哈哈哈哈哈哈哈哈！！关于造神计划\n...我早就已经想好要实施了！而且....",
        "\t[魔王,N832]\b[this,6,8]你也应该知道我要完成造神计划的真正目的吧！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                5
            ]
        },
        "\t[仙月,N585]\b[this,6,5].....................",
        "\t[仙月,N585]\b[this,6,5]........................................",
        "\t[仙月,N585]\b[this,6,5]........................................哎...",
        "\t[仙月,N585]\b[this,6,5]你应该明白.....人死不能复生的.....",
        "\t[魔王,N832]\b[this,6,8]对！你说的没错！！人死的确不能复生！！\n\r[red]但是那是对于人这个层次而言的！！！",
        "\t[魔王,N832]\b[this,6,8]但是对于神来说：\r[red]人是一定可以复生的！！！",
        "\t[魔王,N832]\b[this,6,8]所以！我一定会成功的！！",
        "\t[仙月,N585]\b[this,6,5]............................你这次来就是为了告诉我这些？",
        "\t[魔王,N832]\b[this,6,8]没错！我就是要告诉你我要做些什么！！\n当然你是不可能阻止我的....\r[red]你说是吧！",
        "\t[魔王,N832]\b[this,6,8]\r[red]【         】",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                5
            ]
        },
        "\t[仙月,N585]\b[this,6,5]不要这么跟我称呼！我并不认识你！",
        "\t[仙月,N585]\b[this,6,5]如果你再这么称呼我..........\r[red]我会杀了你！",
        "\t[魔王,N832]\b[this,6,8]哈哈哈哈哈哈哈哈！！！\n那我先感谢你现在不妨碍我完成造神计划了！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[魔王]\b[this,6,8]下次见面！应该就是我完成造神计划的时候了！\n哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[仙月,N585]\b[this,6,5]...............................",
        {
            "type": "setBlock",
            "number": "fairy",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "time": 500
        },
        "\t[仙琳,fairy]\b[this,6,6]外婆.....刚才那个人是谁呀\n....他为什么要笑这么开心呀.........",
        "\t[仙月,N585]\b[this,6,5]...........................................",
        "\t[仙琳,fairy]\b[this,6,6]但是总觉得............\n我对那个人有一种莫名的亲切感呢\n......是怎么回事呢？",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                5
            ]
        },
        "\t[仙月,N585]\b[this,6,5](摸了摸仙琳的头）哎....................",
        "\t[仙月,N585]\b[this,6,5]\r[red]这都是报应！报应呀！！",
        "\t[仙琳,fairy]\b[this,6,6]............................",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "insert",
            "loc": [
                12,
                0
            ],
            "floorId": "MT313"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,0": [
            {
                "type": "playBgm",
                "name": "slience1.mp3",
                "keep": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "remove": true,
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N1067",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "time": 0
            },
            {
                "type": "setWeather"
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    8
                ]
            },
            "\t[君无天,N1067]\b[this,6,8]！！！这！！这里是！！！",
            "\t[？？？,N585]\b[this,6,5]我平时居住的地方——生命之森。",
            "\t[君无天,N1067]\b[this,6,8]！！！！什么！这！！瞬发跨领域空间传送！！",
            "\t[君无天,N1067]\b[this,6,8]这不是魔王才拥有的能力吗？！\n为什么你也能掌握这种力量！",
            "\t[？？？,N585]\b[this,6,5]呵呵呵....一点小手段而已...不足为提。",
            "\t[君无天,N1067]\b[this,6,8]......................",
            "\t[？？？,N585]\b[this,6,5]小家伙，不要紧张，我对你并没有恶意。",
            "\t[君无天,N1067]\b[this,6,8]........................您之所以救我。\n...是因为我是星家的人吗？",
            "\t[？？？,N585]\b[this,6,5].............或许是....或许不是.....",
            "\t[？？？,N585]\b[this,6,5]其实.....从你说第一句话开始\n....我就知道..你不是星家的人！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    8
                ],
                "async": true
            },
            "\t[君无天,N1067]\b[this,6,8]！！！",
            "\t[？？？,N585]\b[this,6,5]你是不是想知道，\n为什么即使知道你不是星家的人，\n还对你出手相助呢？",
            "\t[君无天,N1067]\b[this,6,8]............................",
            "\t[？？？,N585]\b[this,6,5]最主要的是因为你怀中的孩子，\n我感受到她的生命气息，那是属于星家的！",
            "\t[君无天,N1067]\b[this,6,8]............................您究竟想说些什么？",
            "\t[？？？,N585]\b[this,6,5]................因为一些原因..\n我不能帮星家改变被灭族的现状...",
            "\t[？？？,N585]\b[this,6,5]话虽如此...但是我还是不忍心看到一个大族被时间长河所吞噬。",
            "\t[君无天,N1067]\b[this,6,8]所以你就出手救助我，\n目的是为了保留星家最后的火种？",
            "\t[？？？,N585]\b[this,6,5]..........不仅如此，也是为了救你一命。",
            "\t[？？？,N585]虽然我不知道你一个外来族为什么要帮助星家，\n但是从你的行为举止上，\n我看出你绝对不是一个阴险之辈！",
            "\t[？？？,N585]\b[this,6,5]小兄弟，你愿意告诉我这一切的故事吗？",
            "\t[君无天,N1067]\b[this,6,8]..................",
            "\t[君无天,N1067]\b[this,6,8]................................",
            "\t[君无天,N1067]\b[this,6,8]................................哎，是这样的.......",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "君无天把一切的真相都告诉了面前的这个老婆婆。",
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    5
                ]
            },
            "\t[？？？,N585]\b[this,6,5]原来如此....怪不得星家会被灭族.....原来是他.........",
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unknown",
                "loc": [
                    6,
                    8
                ]
            },
            "\t[君无天,N1067]\b[this,6,8]仙月前辈，您在说什么？",
            "\t[仙月,N585]\b[this,6,5]不...没什么",
            "\t[仙月,N585]\b[this,6,5].....你把这孩子交给我照护吧，\n毕竟你被阁主级别的人物盯上了,\n带着这孩子风险性太大了。",
            "\t[君无天,N1067]\b[this,6,8].....看来只能如此了。",
            "\t[君无天,N1067]\b[this,6,8]就麻烦仙月前辈了！",
            "\t[仙月,N585]\b[this,6,5]不必多礼,这是我应该做的",
            "\t[仙月,N585]\b[this,6,5]不过这个孩子的名字叫什么呢？",
            "\t[君无天,N1067]\b[this,6,8]这个孩子的名字叫星钰。",
            "\t[仙月,N585]\b[this,6,5]星钰吗？好名字呀.......",
            "\t[君无天,N1067]\b[this,6,8]对了，仙月前辈，我希望她不要知道\n......他的亲生父亲是被谁杀死的....",
            "\t[仙月,N585]\b[this,6,5]..........................这样吗",
            "\t[君无天,N1067]\b[this,6,8]至于她的身世吗.....\n仙月前辈您自行打算是否告诉她吧.....",
            "\t[仙月,N585]\b[this,6,5]嗯........我会慎重考虑的。",
            "\t[君无天,N1067]\b[this,6,8]那就好",
            "\t[仙月,N585]\b[this,6,5]嗯,如果未来你成为了第三位阁主，\n有时间的话...就回来看看吧。",
            "\t[君无天,N1067]\b[this,6,8]...............是。",
            "\t[仙月,N585]\b[this,6,5]我即将将你送到三圣之巅，\n剩下的都靠你自己了！",
            "\t[君无天,N1067]\b[this,6,8]仙月前辈！保重！！",
            {
                "type": "setCurtain",
                "color": [
                    255,
                    255,
                    255,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "remove": true,
                "time": 0
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    5
                ]
            },
            "\t[仙月,N585]\b[this,6,5]................",
            "\t[仙月,N585]\b[this,6,5].............................",
            "\t[仙月,N585]\b[this,6,5].............................你究竟想干什么？！\n难道你真的要做到如此吗？！",
            "\t[仙月,N585]\b[this,6,5]\r[red]魔王！！",
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "在仙月的帮助下，君无天成功的回到了三圣之巅这个领域。",
            "而君无天运用许多手段也成功的让自己摆脱其他人对他的怀疑。",
            "几天后，在光明圣堂处。",
            {
                "type": "insert",
                "loc": [
                    6,
                    0
                ],
                "floorId": "MT318"
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [200065,200066,200067,200168,200169,200170,200171,200172,200173,200174,200049,200050,  0],
    [200073,200074,200075,200176,200177,200178,200179,200180,200181,200182,200057,  0,  0],
    [200081,200082,200083,200184,200185,200186,200187,200188,200189,200190,200191,  0,200049],
    [200050,  0,  0,  0,  0,182149,182150,182151,200197,200198,  0,  0,  0],
    [200058,200059,  0,  0,190106,182157,182158,182159,190106,  0,  0,200082,  0],
    [200050,200067,  0,  0,190114,182165,588,182167,190114,  0,  0,  0,200048],
    [200058,200059,  0,  0,190122,  0,  0,  0,190122,  0,  0,  0,200056],
    [200066,200067,  0,  0,  0,  0,  0,  0,  0,90541,90542,90543,200081],
    [200074,200075,  0,  0,190106,  0,  0,  0,190106,90549,90550,90551,  0],
    [  0,200083,  0,  0,190114,  0,  0,  0,190114,  0,  0,200049,200080],
    [  0,200048,200049,200050,190122,  0,  0,  0,190122,  0,200056,200057,200058],
    [  0,200056,200057,200058,  0,200049,200050,200049,200050,  0,200064,200065,200066],
    [  0,200064,200065,200066,200067,200049,200056,200057,200058,200059,200072,200073,200074]
],
    "bgmap": [
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,200048,  0,200050,200051],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200058,200059],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200066,200067],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200073,200074,200075],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,200080,200081,  0,200083],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180985,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180984,  0,200050],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180985,  0,  0],
    [  0,  0,  0,  0,200059,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,200072,200073,200074,200075,  0,  0,  0,  0,200064,200069,200070],
    [  0,  0,200080,200081,200082,200083,  0,  0,  0,200056,200072,200077,200078],
    [200049,200050,  0,  0,  0,  0,  0,  0,  0,200064,200065,200085,200086],
    [200057,200058,200059,  0,200193,200194,200195,200196,  0,200072,  0,200056,200057],
    [200065,200066,200067,  0,  0,  0,  0,  0,  0,  0,  0,200064,200065],
    [200066,200074,200075,  0,  0,  0,182166,  0,  0,  0,  0,200072,200073],
    [  0,200082,200083,  0,182152,182153,182154,182155,182156,  0,  0,200080,200081],
    [  0,  0,  0,  0,182160,182161,182162,182163,182164,  0,  0,  0,  0],
    [200049,200050,  0,  0,182168,182169,182170,182171,182172,  0,  0,  0,  0],
    [200057,200058,200059,  0,182176,182177,182178,182179,182180,  0,  0,  0,  0],
    [200069,200070,200055,  0,182184,182185,182186,182187,182188,  0,  0,  0,  0],
    [200077,200078,200079,  0,  0,  0,  0,  0,  0,  0,200049,  0,  0],
    [200085,200086,200087,  0,200068,200077,200078,200079,  0,200060,200057,200058,  0]
],
    "fg2map": [

]
}