main.floors.MT317=
{
    "floorId": "MT317",
    "title": "小型图书房（回忆）",
    "name": "小型图书房（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "disableShop",
            "id": "296Fshop"
        },
        {
            "type": "playBgm",
            "name": "memory3.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[君无天,N1067]\b[this,5,7]嗯......让我看看有什么关键的信息.....。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                5,
                7
            ]
        },
        "\t[君无天,N1067]\b[this,5,7]——基础剑技讲解。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                5,
                7
            ]
        },
        "\t[君无天,N1067]\b[this,5,7]....真的是基础剑技讲解，\n....写的全是我早已掌握的剑法...。",
        "\t[君无天,N1067]\b[this,5,7]那么下一本........。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                5,
                7
            ]
        },
        "\t[君无天,N1067]\b[this,5,7]——魔塔区域大全。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                5,
                7
            ]
        },
        "\t[君无天,N1067]\b[this,5,7]魔塔一共分为五大领域：\n初始魔塔,四星尊天,阴阳圣坛,三圣之巅,以及最终的......。",
        "\t[君无天,N1067]\b[this,5,7]等等，什么玩意？怎么写了一半就没了？？",
        "\t[君无天,N1067]\b[this,5,7]不过现在三圣之巅只有两位阁主，\n而第三位阁主现在还没有选定呢.........。",
        "\t[君无天,N1067]\b[this,5,7]哎，不过这现在跟我并没有什么关系，\n我现在的目的只是为了刺探情报而已，\n...而且我的实力还不够到达那个水平。",
        "\t[君无天,N1067]\b[this,5,7]下一本，下一本。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                5,
                7
            ]
        },
        "\t[君无天,N1067]\b[this,5,7]这本书的名字是..........。",
        "\t[君无天,N1067]\b[this,5,7]——魔雨剑传记。",
        "\t[君无天,N1067]\b[this,5,7]哦？听名字就感觉这本书很有意思！",
        "\t[君无天,N1067]\b[this,5,7]让我看看.....。",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                5,
                7
            ]
        },
        "\t[君无天,N1067]\b[this,5,7]......这本书的目录写的是——\n一位魔族皇子一路挨揍的故事.....。",
        "\t[君无天,N1067]\b[this,5,7]什么鬼........。",
        "\t[君无天,N1067]\b[this,5,7]这三圣之巅的图书管理员是干什么吃的，\n怎么都放些奇奇怪怪的书籍！",
        "\t[君无天,N1067]\b[this,5,7]看来得另想办法了，\n去查阅图书简直是毫无意义！",
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        "\t[？？？]不知你在此处观览些什么呢？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                7
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    5,
                    7
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                5,
                7
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down",
                "right"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    8
                ]
            ]
        },
        "\t[君无天,N1064]\b[this,6,8]什么人？！",
        {
            "type": "playSound",
            "name": "VXFire4.ogg"
        },
        {
            "type": "animate",
            "name": "fire1",
            "loc": [
                6,
                11
            ]
        },
        {
            "type": "setBlock",
            "number": "N736",
            "loc": [
                [
                    6,
                    11
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        "\t[君无天,N1064]\b[this,6,8]你是.......圣羽洛斯阁主？！",
        "\t[圣羽洛斯,N736]\b[this,6,11]怎么？我就不能在这里吗？",
        "\t[君无天,N1064]\b[this,6,8]不...这倒不是，\n属下只是好奇阁主大人为什么会来这个小地方..。",
        "\t[圣羽洛斯,N736]\b[this,6,11]呵呵呵...虽然说这个地方在三圣之巅算不了什么，\n....但是\\d这里的人却并非如此呢！",
        "\t[君无天,N1064]\b[this,6,8]......阁主大人此言何意？",
        "\t[圣羽洛斯,N736]\b[this,6,11]哈哈哈哈.....没什么意思，\n....就是说\\d某些人的潜力很大而已！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        "\t[君无天,N1064]\b[this,6,8]..............................",
        "\t[圣羽洛斯,N736]\b[this,6,11]好了，我也不拐弯抹角了，\n我就是要告诉你：\\d我看上你了！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        "\t[君无天,N1064]\b[this,6,8]啥？？？",
        "\t[圣羽洛斯,N736]\b[this,6,11]咳咳，你在想什么呢，\n我说我看上你的资质而已，你以为是什么！",
        {
            "type": "playSound",
            "name": "Raise1.ogg"
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": [
                6,
                8
            ]
        },
        "\t[君无天,N1064]\b[this,6,8]这样呀.......。",
        "\t[君无天,N1064]\b[this,6,8]那阁主大人究竟想让我干些什么呢？",
        "\t[圣羽洛斯,N736]\b[this,6,11]你知道最近三圣之巅打算要选拔第三位阁主吗？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                8
            ]
        },
        "\t[君无天,N1064]\b[this,6,8]难不成....阁主大人是打算把我担任阁主候选人？！！",
        "\t[圣羽洛斯,N736]\b[this,6,11]聪明！便是如此！！",
        "\t[君无天,N1064]\b[this,6,8]这......阁主大人真是太看得起我了，\n我现在只是一个护法级别的人物，\n...以我的实力....对于我来说阁主之位可能太过遥远了吧...。",
        "\t[圣羽洛斯,N736]\b[this,6,11]呵呵呵.....不要随意妄自菲薄....毕竟你....。",
        "\t[圣羽洛斯,N736]\b[this,6,11]\r[red]的确是一个很有意思的人呢！",
        "\t[君无天,N1064]\b[this,6,8]....................。",
        "\t[圣羽洛斯,N736]\b[this,6,11]我记得你是从一个低等领域来的散修，\n而你心里也应该清楚：\n在下等领域修炼的速度是比这里要慢上许多的！",
        "\t[圣羽洛斯,N736]\b[this,6,11]但是！你凭借一个散修的身份却达到了三圣之巅的护法级别！！\n你说是不是很有意思呢！",
        "\t[君无天,N1064]\b[this,6,8]....................",
        "\t[圣羽洛斯,N736]\b[this,6,11]\r[red]而且.....你不是很需要一些情报吗！",
        {
            "type": "vibrate",
            "time": 500,
            "async": true
        },
        {
            "type": "playSound",
            "name": "049-Explosion02.ogg"
        },
        {
            "type": "playBgm",
            "name": "holy3.mp3",
            "keep": true
        },
        "\t[君无天,N1064]\b[this,6,8]！！！",
        "\t[圣羽洛斯,N736]\b[this,6,11]不要以这种惊骇的表情看着我，\n我的城府比你想象的还要深厚！",
        "\t[君无天,N1064]\b[this,6,8]那............阁主大人为什么打算让我担任阁主之位，\n这对于阁主您来说有什么好处吗？",
        "\t[圣羽洛斯,N736]\b[this,6,11]哈哈哈！你觉得呢！",
        "\t[君无天,N1064]\b[this,6,8]属下不知。",
        "\t[圣羽洛斯,N736]\b[this,6,11]呵呵呵....算了，现在告诉你还为时过早了！",
        "\t[圣羽洛斯,N736]\b[this,6,11]总有一天我会告诉你这一切的真相的！",
        "\t[圣羽洛斯,N736]\b[this,6,11]不过你还是得好好努力呀！\n去担任我三圣之巅的第三位阁主！！",
        "\t[圣羽洛斯,N736]\b[this,6,11]我可是非常期待你担任阁主的那一刻呢！",
        "\t[圣羽洛斯,N736]\b[this,6,11]哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！",
        {
            "type": "move",
            "loc": [
                6,
                11
            ],
            "time": 500,
            "steps": [
                "down",
                "down"
            ]
        },
        "\t[君无天,N1064]\b[this,6,8].................。",
        "\t[君无天,N1064]\b[this,6,8]..........................。",
        "\t[君无天,N1064]\b[this,6,8]..........................圣羽洛斯。",
        "\t[君无天,N1064]\b[this,6,8]你究竟想干什么？你究竟知道多少秘密！",
        "\t[君无天,N1064]\b[this,6,8]......我必须抓紧时间了，\n我隐隐感觉最近会发生一些非常不好的事情！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "几天后，在光明圣堂处。",
        {
            "type": "pauseBgm"
        },
        {
            "type": "changeFloor",
            "floorId": "MT318",
            "loc": [
                6123,
                11
            ],
            "direction": "down",
            "time": 500
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80033,80033,80033,80033,80033,80033,80033,80027],
    [80026,80048,80049,80049,80049,80049,80049,80049,80049,80049,80049,80049,80024],
    [80026,80057,80057,80057,80057,80057,80057,80057,80057,80057,80057,80057,80024],
    [80026,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80024],
    [80026,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80024],
    [80026,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80024],
    [80026,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80024],
    [80026,  0,  0,  0,  0,1067,  0,  0,  0,  0,  0,  0,80024],
    [80026,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80024],
    [80026,  0,  0,  0,70132,70133,  0,70134,70135,  0,  0,  0,80024],
    [80026,  0,  0,  0,70140,70141,  0,70142,70143,  0,  0,  0,80024],
    [80020,80017,80017,80017,80017,80018,  0,80016,80017,80017,80017,80017,80019],
    [80025,80025,80025,80025,80025,80026,  0,80024,80025,80025,80025,80025,80025]
],
    "bgmap": [
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000],
    [80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000,80000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,180720,180721,  0,180720,180721,  0,180720,180721,  0,180720,180721,  0],
    [  0,180728,180729,  0,180728,180729,  0,180728,180729,  0,180728,180729,  0],
    [  0,180720,180721,  0,180720,180721,  0,180720,180721,  0,180720,180721,  0],
    [  0,180728,180729,  0,180728,180729,  0,180728,180729,  0,180728,180729,  0],
    [  0,180720,180721,  0,180720,180721,  0,180720,180721,  0,180720,180721,  0],
    [  0,180728,180729,  0,180728,  0,  0,180728,180729,  0,180728,180729,  0],
    [  0,180736,180737,  0,180736,  0,  0,180736,180737,  0,180736,180737,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,180705,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,180713,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}