main.floors.MT313=
{
    "floorId": "MT313",
    "title": "生命之森",
    "name": "生命之森",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "ground",
    "color": null,
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "choices",
            "text": "是否查看怪物属性？",
            "choices": [
                {
                    "text": "是",
                    "action": [
                        {
                            "type": "callBook"
                        },
                        {
                            "type": "waitAsync"
                        }
                    ]
                },
                {
                    "text": "不",
                    "action": []
                }
            ]
        },
        "\t[仙月,E597]\b[this,5,5]有什么事吗，君阁主?",
        "\t[君无天,E512]\b[this,5,8]前辈真是折煞我也，您还是直接叫我真名吧，这阁主称号不当也罢！",
        "\t[仙月,E597]\b[this,5,5]呵呵呵......这样吗？",
        "\t[仙月,E597]\b[this,5,5]那你这次邀我前来有什么事吗？",
        "\t[君无天,E512]\b[this,5,8]是这样的：前辈有没有听说过\r[red]造神计划呢？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                5
            ]
        },
        "\t[仙月,E597]\b[this,5,5]造神计划！",
        "\t[君无天,E512]\b[this,5,8]看来前辈是知道这个造神计划了呢。",
        "\t[仙月,E597]\b[this,5,5]..................",
        "\t[君无天,E512]\b[this,5,8]那晚辈就直言了：希望前辈你能够帮助我们阻止魔王完成造神计划！",
        "\t[君无天,E512]\b[this,5,8]不知道前辈是否愿意跟我们一起去阻止魔王呢。",
        "\t[仙月,E597]\b[this,5,5]..................",
        "\t[仙月,E597]\b[this,5,5]...........................",
        "\t[仙月,E597]\b[this,5,5]....................................",
        "\t[仙月,E597]\b[this,5,5]对不起，我不能帮你们！",
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                5,
                8
            ]
        },
        "\t[君无天,E512]\b[this,5,8]为什么？",
        {
            "type": "setBlock",
            "number": "E600",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "time": 0
        },
        "\t[仙月,E600]\b[this,5,5]你们另找高人吧！我帮不了你们！！",
        "\t[君无天,E512]\b[this,5,8]....................前辈是打算逃避吗？！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                5
            ]
        },
        {
            "type": "setBlock",
            "number": "E597",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "time": 0
        },
        "\t[仙月,E597]\b[this,5,5].........................",
        "\t[君无天,E512]\b[this,5,8]前辈应该知道：一旦造神计划完成！\n这个世界就将进入什么大创世时代当中去！！",
        "\t[君无天,E512]\b[this,5,8]而我有预感！这个大创世时代，\n一定会带来一场非常浩大的\r[red]腥风血雨！！！",
        "\t[君无天,E512]\b[this,5,8]所以前辈你还是打算做刚才的选择吗？！",
        {
            "type": "vibrate",
            "time": 500
        },
        "\t[仙月,E597]\b[this,5,5].........................",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                5,
                5
            ]
        },
        "\t[仙月,E597]\b[this,5,5]对不起！我还是不能这样做！！",
        "\t[仙月,E597]\b[this,5,5]以后如果有机会再见吧！",
        {
            "type": "setBlock",
            "number": "E600",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    5
                ]
            ],
            "remove": true,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[君无天,E512]\b[this,5,8]...........................前辈........",
        "\t[君无天,E512]\b[this,5,8]哎........前辈你这是何苦呀.......",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "insert",
            "loc": [
                0,
                0
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,0": [
            "\t[仙月](..................对不起.....有些事情.....是无法帮你的....）",
            "\t[仙月]（那是因为..............）",
            "八年前..............",
            {
                "type": "changeFloor",
                "floorId": "MT314",
                "loc": [
                    111,
                    8
                ],
                "direction": "up",
                "time": 500
            }
        ],
        "12,0": [
            {
                "type": "pauseBgm"
            },
            {
                "type": "changeFloor",
                "floorId": "MT313",
                "loc": [
                    111,
                    10
                ],
                "time": 0
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[君无天,E512]\b[this,5,8]..............................",
            "\t[君无天,E512]\b[this,5,8]为什么会这样呢。\n.....前辈你究竟是有什么苦衷吗？",
            {
                "type": "playBgm",
                "name": "disorder5.mp3",
                "keep": true
            },
            "\t[君无天,E512]\b[this,5,8]..............................",
            {
                "type": "setBlock",
                "number": "E602",
                "loc": [
                    [
                        5,
                        8
                    ]
                ],
                "time": 0
            },
            "\t[君无天,E602]\b[this,5,8]..............................出来吧，小粽。",
            {
                "type": "playSound",
                "name": "Wind01.ogg"
            },
            {
                "type": "animate",
                "name": "fast",
                "loc": "hero",
                "async": true
            },
            {
                "type": "changePos",
                "loc": [
                    7,
                    8
                ],
                "direction": "left"
            },
            "\t[小粽,hero]\b[hero]............................",
            "\t[君无天,E602]\b[this,5,8]不错....没想到你的实力居然有所提升了呢！",
            "\t[小粽,hero]\b[hero]......................我应该叫你星天前辈，\n还是叫你\r[red]君阁主呢！",
            {
                "type": "vibrate",
                "time": 500
            },
            "\t[君无天,E602]\b[this,5,8]星天也好，君阁主也罢，\n都是些过去时了.....",
            "\t[君无天,E602]\b[this,5,8]让这些名字被时间长河所流逝吧！\n现在的我——\r[red]是君无天！",
            "\t[小粽,hero]\b[hero]...........告诉我！你真正的目的究竟是什么！！",
            "\t[君无天,E602]\b[this,5,8]目的..........吗？",
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    5,
                    8
                ]
            },
            "\t[君无天,E602]\b[this,5,8]哎..................",
            "\t[小粽,hero]\b[hero]你最好如实回答！不然我就算是死也会拖你陪葬！！",
            "\t[君无天,E602]\b[this,5,8]你先放轻松..................\n我来慢慢告诉你这一切的真相吧！",
            "\t[小粽,hero]\b[hero]希望你不会再骗我！",
            "\t[君无天,E602]\b[this,5,8]这个故事....绝对会让你信服的！",
            "\t[君无天,E602]\b[this,5,8]故事的开端发生在数十年前..............",
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "changeFloor",
                "floorId": "MT315",
                "loc": [
                    1111,
                    9
                ],
                "time": 500
            },
            {
                "type": "waitAsync"
            }
        ],
        "12,12": [
            {
                "type": "playBgm",
                "name": "slience1.mp3",
                "keep": true
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "showHero",
                "time": 0
            },
            {
                "type": "changeFloor",
                "floorId": "MT313",
                "loc": [
                    7,
                    8
                ],
                "direction": "left",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[君无天,N591]\b[this,5,8]在那之后，我就一直在我管辖的领域研制可以击破圣羽洛斯的药剂。",
            "\t[君无天,N591]\b[this,5,8]而在这十几年间，\n差不多每隔一年我都会悄悄的探望星钰，\n直到她担任了造物星尊....",
            "\t[小粽,hero]\b[hero].............................",
            "\t[小粽,hero]\b[hero].............................没想到前辈你居然有这样的过去呀...",
            "\t[君无天,N591]\b[this,5,8]嗯，也正是因为我经历过如此悲痛的过去，\n才能使我的实力能够远超黯夜殇与圣羽洛斯！",
            "\t[小粽,hero]\b[hero]........前辈...那你打不打算让星钰她知道——这一切的真相呢.......",
            "\t[君无天,N591]\b[this,5,8]..........................。",
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    5,
                    8
                ]
            },
            "\t[君无天,N591]\b[this,5,8]我不知道....。",
            "\t[君无天,N591]\b[this,5,8]因为...我不知道这孩子当她得知这一切的真相会是怎么样的反应....。",
            "\t[君无天,N591]\b[this,5,8]可能会把我当做杀父仇人，毁灭一族的凶手等诸多恶名。",
            "\t[君无天,N591]\b[this,5,8]或许她会杀了我，也或许她会独自一人杀上魔塔之巅........。",
            "\t[君无天,N591]\b[this,5,8]总之....我不知道....。",
            "\t[小粽,hero]\b[hero].......................。",
            {
                "type": "pauseBgm"
            },
            {
                "type": "playBgm",
                "name": "disorder5.mp3",
                "keep": true
            },
            "\t[？？？]那就让我来说吧！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    8
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            {
                "type": "changePos",
                "loc": [
                    7,
                    8
                ],
                "direction": "down"
            },
            {
                "type": "setBlock",
                "number": "N1133",
                "loc": [
                    [
                        5,
                        8
                    ]
                ],
                "time": 0
            },
            "\t[小粽,hero]\b[hero]这个声音是......星钰吗？",
            "\t[君无天,N1133]\b[this,5,8]..............................。",
            {
                "type": "setBlock",
                "number": "N826",
                "loc": [
                    [
                        9,
                        12
                    ]
                ],
                "time": 0
            },
            {
                "type": "sleep",
                "time": 50
            },
            {
                "type": "move",
                "loc": [
                    9,
                    12
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "up",
                    "up",
                    "left",
                    "left",
                    "left"
                ]
            },
            "\t[星钰,N826]\b[this,6,10]不好意思，打扰你们的谈话了，小粽，以及.........。",
            "\t[君无天,N1133]\b[this,5,8]..............................。",
            "\t[星钰,N826]\b[this,6,10]\r[red]父亲大人！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    8
                ],
                "async": true
            },
            "\t[君无天,N1133]\b[this,5,8]\r[red]....我不是你父亲！你的父亲是被我亲手杀死的！是你的杀父仇人！！",
            "\t[君无天,N1133]\b[this,5,8]\r[red]是灭你星家的罪魁祸首！！！",
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            {
                "type": "vibrate",
                "time": 500
            },
            "\t[君无天,N1133]\b[this,5,8]\r[red]所以！如果你想要报仇的吧！就杀了我吧！！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[小粽,hero]\b[hero]等等！！前辈你还不能...........！",
            "\t[君无天,N1133]\b[this,5,8]\r[red]小粽！不必劝我！！其实早在十几年前我就应该死去了！",
            "\t[君无天,N1133]\b[this,5,8]\r[red]在星家武斗场的那个坟墓应该是我躺在那里的！而不是应该是我那好兄弟！！",
            "\t[小粽,hero]\b[hero]................前辈....你真的打算..........。",
            "\t[君无天,N1133]\b[this,5,8]\r[red]没错！我意已决！！",
            "\t[小粽,hero]\b[hero]这..................哎................。",
            "\t[星钰,N826]\b[this,6,10]你们.........在干什么？在演绎一场生死离别戏吗？",
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unknown",
                "loc": [
                    5,
                    8
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unknown",
                "loc": "hero"
            },
            "\t[小粽,hero]\b[hero]？？？？星钰你在说些什么！快劝君前辈不要轻生！！",
            "\t[君无天,N1133]\b[this,5,8]\r[red]对呀！星钰你还在犹豫什么！！",
            "\t[星钰,N826]\b[this,6,10]嗯......这样呀....。",
            {
                "type": "move",
                "loc": [
                    6,
                    10
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "up",
                    "left"
                ]
            },
            "星钰拿起了君无天手上的利剑。",
            {
                "type": "changePos",
                "loc": [
                    7,
                    8
                ],
                "direction": "left"
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[小粽,hero]\b[hero]等等！！星钰！！你真要杀了君前辈吗？！！",
            "\t[君无天,N1133]\b[this,5,8]\r[red]来吧,用这利剑刺破我的心脏吧,然后我就...........。",
            "\t[星钰,N826]\b[this,5,9].................。",
            {
                "type": "pauseBgm"
            },
            {
                "type": "playBgm",
                "name": "memory1.mp3",
                "keep": true
            },
            "然而星钰转手丢下了利剑，用她那纤细的双臂抱住了君无天。",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    8
                ]
            },
            "\t[君无天,N1133]\b[this,5,8]星钰！你怎么............。",
            "\t[星钰,N826]\b[this,5,9].......我从刚才您与小粽的交谈中得知了这一切的真相，\n也得知了我的亲生父亲是被您杀的。",
            "\t[君无天,N1133]\b[this,5,8]那你为什么还...........。",
            "\t[星钰,N826]\b[this,5,9]虽然....在我得知....，\n您就是我杀父仇人的那一刻，\n我的内心可谓是百感交集...但是！",
            "\t[星钰,N826]\b[this,5,9]如果不是您....冒着生命危险救助了还是婴儿时期的我，\n或许我早已被他们所杀害了呢.....。",
            "\t[君无天,N1133]\b[this,5,8]........................。",
            "\t[星钰,N826]\b[this,5,9]所以！我并不恨你.....相反...，\n您还像亲生父亲一样照护我...呵护我...。",
            "\t[星钰,N826]\b[this,5,9]嘛..虽然大部分时间是仙月奶奶照护我....。",
            "\t[星钰,N826]\b[this,5,9]但.....即使您来看望我的时间非常短暂，...\n但是在你陪伴在我的那一刻.....，\n却还是让我感受到了真正的亲情！",
            "\t[君无天,N1133]\b[this,5,8]..................................",
            "\t[小粽,hero]\b[hero]..................................",
            "\t[星钰,N826]\b[this,5,9]所以最终....我还是愿意叫你一声\n——\\d父亲大人！",
            {
                "type": "vibrate",
                "time": 500
            },
            "\t[君无天,N1133]\b[this,5,8].....是吗..........",
            "\t[君无天,N1133]\b[this,5,8]对不起，之前是我太冲动了。",
            "\t[星钰,N826]\b[this,5,9]没有关系，只要父亲大人能够平安即可。",
            "\t[小粽,hero]\b[hero]....咳咳,看来你们的问题完美解决了呢。",
            {
                "type": "setBlock",
                "number": "N825",
                "loc": [
                    [
                        5,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N1136",
                "loc": [
                    [
                        5,
                        8
                    ]
                ],
                "time": 0
            },
            "\t[星钰,N825]\b[this,5,9]不过小粽你也重新振作过来了呢，\n之前的戾气完全消散了呢！",
            "\t[小粽,hero]\b[hero]嗯,毕竟我与君前辈已经化干戈为玉帛了呢。",
            "\t[星钰,N825]\b[this,5,9]那就好，那就好，\n我之前还担心你会与父亲大人打一架呢...。",
            "\t[君无天,N1136]\b[this,5,8]哈哈哈...如果硬要算的话，\n之前在永生之巅就已经打了一场呢。",
            "\t[小粽,hero]\b[hero]呵呵...是呀。",
            "\t[小粽,hero]\b[hero]对了，君前辈，我们现在该怎么办，\n去魔塔的最终区域吗？",
            "\t[君无天,N1136]\b[this,5,8]你还是叫我星天前辈吧，\n就当是我一个小小的愿望吧。",
            "\t[小粽,hero]\b[hero]这....好吧，星天前辈。",
            "\t[君无天,N1136]\b[this,5,8]........我们得先休息一段时间，恢复些元气。",
            "\t[君无天,N1136]\b[this,5,8]毕竟我们现在离魔王已经不远了！\n得做好万全准备！！",
            "\t[星钰,N825]\b[this,5,9]是呀，虽然父亲大人可以说是三圣之巅的最强者。\n但是在更上层还有比父亲大人强大的存在呢！",
            "\t[小粽,hero]\b[hero]那星天前辈，你知道魔塔最后一个领域的具体信息吗？",
            "\t[君无天,N1136]\b[this,5,8]具体信息吗......。",
            "\t[君无天,N1136]\b[this,5,8]最后一个大区域的第一个区域叫做：终焉之城。",
            "\t[小粽,hero]\b[hero]终焉之城？",
            "\t[君无天,N1136]\b[this,5,8]嗯，我之前就是在那里进行的考验，得到护法身份的。",
            "\t[小粽,hero]\b[hero]这样呀.....",
            "\t[君无天,N1136]\b[this,5,8]最后一个大区域的第二个区域叫做：光明圣堂。",
            "\t[小粽,hero]\b[hero]光明圣堂？怎么感觉与之前的阴阳圣坛中的阳之坛大同小异呢......。",
            "\t[君无天,N1136]\b[this,5,8]这个地方是魔王邀请我们各阁主开会的地方，\n也可以说是魔王的老巢吧。",
            "\t[星钰,N825]\b[this,5,9]魔王的老巢！！",
            "\t[君无天,N1136]\b[this,5,8]也就是说我们最终目的就是到光明圣堂！",
            "\t[小粽,hero]\b[hero]！！！！",
            "\t[小粽,hero]\b[hero]看来马上就能结束了呢！",
            "\t[星钰,N825]\b[this,5,9]对了,父亲大人,既然光明圣坛是魔王的老巢，\n那最强者就是魔王了，\n那么终焉之城会是谁来驻守呢？",
            "\t[君无天,N1136]\b[this,5,8]...........应该是一直跟随在魔王身边的那个女人——梦。",
            "\t[星钰,N825]\b[this,5,9]梦？好奇怪的名字，就一个字吗？",
            "\t[君无天,N1136]\b[this,5,8]她的名字就叫梦，这个女人十分神秘...我看不透她。",
            "\t[君无天,N1136]\b[this,5,8]而且这个女人所展现出来的实力在我之上！",
            "\t[小粽,hero]\b[hero]什么！",
            "\t[君无天,N1136]\b[this,5,8]嗯，她是我见过的人中——除魔王以及仙月前辈以外的最强者！",
            "\t[星钰,N825]\b[this,5,9]这........",
            "\t[君无天,N1136]\b[this,5,8]不要担心，我们还有一个多月的时间，\n在与这个梦交手之前我们还能提升实力的！",
            "\t[小粽,hero]\b[hero]对，星天前辈说的没错，我们还有希望！",
            "\t[星钰,N825]\b[this,5,9]嗯，我相信会有奇迹发生的。",
            "\t[君无天,N1136]\b[this,5,8]那我们先回生命之森的核心处吧，,然后在这里修炼。",
            "\t[小粽,hero]\b[hero]好！",
            "\t[星钰,N825]\b[this,5,9]那我们走吧，父亲大人，小粽。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "pauseBgm"
            },
            "小粽与星钰，君无天一同回到了生命之森的核心处开始了修炼。",
            "让君无天失望的是,仙月并没有出现,而是派罗天前来照理他们。",
            "而小粽与星钰在罗天的带领下,见到了还在治疗中的堇。",
            "不过这个时候的堇还处于昏迷状态，罗天告诉他们堇需要静养，不能叫醒她。",
            "而小粽与星钰看到堇没事之后，就安心修炼了.....。",
            "\r[red]为了阻止魔王完成造神计划！！",
            {
                "type": "waitAsync"
            },
            {
                "type": "insert",
                "loc": [
                    6,
                    12
                ],
                "floorId": "MT309"
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [200065,200066,200067,  0,200064,200065,  0,  0,  0,  0,  0,  0,  0],
    [200073,200074,200075,  0,200072,200073,200074,  0,  0,  0,  0,  0,  0],
    [200056,200082,200083,  0,200080,200081,200082,200081,  0,  0,  0,  0,  0],
    [200066,200067,  0,  0,  0,  0,200081,200049,200050,  0,  0,  0,  0],
    [200074,200075,200050,  0,  0,  0,200056,200057,200058,200059,  0,  0,  0],
    [200056,200057,200058,200059,  0,597,200064,200065,200066,200067,  0,  0,  0],
    [200064,200065,200066,200067,  0,  0,200072,200073,200074,200075,200066,200067,  0],
    [200072,200073,200074,200075,  0,  0,200080,200081,200082,200073,200074,200073,200074],
    [200056,200057,200058,200059,  0,512,  0,  0,200080,200081,200082,200081,200082],
    [  0,200065,200058,200067,200050,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,200057,200058,200059,  0,  0,  0,  0,  0,200049,200050],
    [  0,  0,  0,  0,  0,200067,  0,  0,  0,  0,200056,200057,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200064,200065,  0]
],
    "bgmap": [
    [301,301,146,146,146,301,301,301,301,301,301,301,301],
    [301,301,146,146,146,301,301,301,301,301,301,301,301],
    [200000,301,146,146,146,301,301,301,301,301,301,301,301],
    [301,301,146,146,146,301,301,301,301,301,301,301,301],
    [301,301,146,146,146,146,301,301,301,301,301,301,301],
    [301,301,146,146,146,146,146,301,301,301,301,301,301],
    [301,301,301,146,146,146,146,301,301,301,301,301,301],
    [301,301,301,301,146,146,146,146,301,301,301,301,301],
    [301,301,301,301,146,146,146,146,146,301,301,301,301],
    [301,301,301,301,301,146,146,146,146,146,146,301,301],
    [301,301,301,301,301,301,146,146,146,146,146,146,301],
    [301,301,301,301,301,301,301,301,146,146,146,146,301],
    [301,301,301,301,301,301,301,301,301,146,146,146,301]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [200058,200059,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,200049,  0,  0,  0,  0,  0,  0,  0,200049,200050,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,200056,200057,200058,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,200064,200065,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,200072,200073,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,200056,200057,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,200064,200065,200066,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,200072,200073,200074,200075,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,200082,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [200059,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,200049,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200056,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200064,200065,200066,200059,200049,200050,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,200066,200067,200057,200058,200059,  0,  0,  0,  0]
],
    "fg2map": [
    [145,145,  0,  0,  0,145,145,145,145,145,145,145,145],
    [145,145,  0,  0,  0,  0,145,145,145,145,145,145,145],
    [145,  0,  0,  0,  0,  0,  0,145,145,145,145,145,145],
    [145,  0,  0,  0,  0,  0,  0,  0,145,145,145,145,145],
    [145,  0,  0,  0,  0,  0,  0,  0,  0,145,145,145,145],
    [145,145,  0,  0,  0,  0,  0,  0,  0,  0,145,145,145],
    [145,145,  0,  0,  0,  0,  0,  0,  0,  0,145,145,145],
    [145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,145,145],
    [145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,  0,145],
    [145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,  0,145],
    [145,145,145,145,  0,  0,  0,  0,  0,  0,  0,  0,145],
    [145,145,145,145,145,  0,  0,  0,  0,  0,  0,145,145],
    [145,145,145,145,145,145,145,  0,  0,  0,145,145,145]
]
}