main.floors.MT316=
{
    "floorId": "MT316",
    "title": "魔殿入口（回忆）",
    "name": "魔殿入口（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "disableShop",
            "id": "296Fshop"
        },
        {
            "type": "playBgm",
            "name": "battle17.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[君无天,N1067]\b[this,6,12]呼......终于找到了！",
        "\t[君无天,N1067]\b[this,6,12]最终区域的中转站——魔殿！",
        "\t[君无天,N1067]\b[this,6,12]传闻这里就是：魔王给予众魔物身份的地方！",
        "\t[君无天,N1067]\b[this,6,12]不知道我这种散修会被给予什么身份呢......。",
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up"
            ]
        },
        "\t[魔殿卫士X2,N1076]站住！来者何人？！",
        "\t[君无天,N1067]\b[this,6,10]（这两个守门的水准.....不弱于阴阳圣坛寻常的圣护之手！）",
        "\t[君无天,N1067]\b[this,6,10]在下君无天,是从低等领域来的一位散修，\n来此希望能通过一些测试来取得一定的身份。",
        "\t[魔殿卫士X2,N1076]低等领域来的散修？ ",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[魔殿卫士X2,N1076]哼！一个低等领域来的散修也想妄图参加魔王大人所设下的考验？\n而且还想得到高位身份？！简直是滑天下之大稽！ ",
        "\t[君无天,N1067]\b[this,6,10]达者为尊，这应该就是评判的标准吧，\n而不因他人出身来对其妄自菲薄才对！",
        "\t[魔殿卫士X2,N1076]哼！从哪来的滚到哪里去吧！\n我们这里拒绝收你这种出身低贱的家伙！",
        "\t[君无天,N1067]\b[this,6,10]（...看来不得不动用些狠手段了，\n虽然这会使我的处境比较尴尬，\n但是不这样做连第一步都完成不了了！）",
        "\t[魔殿卫士X2,N1076]喂！你特么听不懂话吗？！\n叫你滚！你就滚呀！！",
        {
            "type": "playBgm",
            "name": "spendid1.mp3",
            "keep": true
        },
        "\t[？？？]住口！休得无礼！！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                5
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                5
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ]
        },
        "\t[君无天,N1067]\b[this,6,10]（！！好强大的气息！！）",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "setBlock",
            "number": "N685",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "time": 0
        },
        "\t[魔殿卫士X2,N1076]！！！你是！！",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                5,
                5
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                7,
                5
            ],
            "async": true
        },
        {
            "type": "move",
            "loc": [
                5,
                5
            ],
            "time": 1,
            "async": true,
            "steps": [
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward"
            ]
        },
        {
            "type": "move",
            "loc": [
                7,
                5
            ],
            "time": 1,
            "async": true,
            "steps": [
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward",
                "backward"
            ]
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ],
            "async": true
        },
        "\t[魔殿卫士X2,N1076]呃啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！",
        "\t[梦,N685]\b[this,6,6]口出污秽之词，\n让你们两个好好清醒清醒！",
        "\t[君无天,N1067]\b[this,6,10]（好强！居然随手一击就打飞了那两个家伙...）",
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    6
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ],
            "async": true
        },
        "\t[君无天,N1067]\b[this,6,10]（她的眼神.....好迷离...怎么回事？）",
        "\t[君无天,N1067]\b[this,6,10]（而且我感觉.....她不像是纯粹的魔物....。）",
        "\t[梦,E514]\b[this,6,6]是你要来接受考验吗？",
        "\t[君无天,N1067]\b[this,6,10]....是",
        "\t[梦,E514]\b[this,6,6]....跟我来吧！",
        "\t[君无天,N1067]\b[this,6,10]好！",
        "\t[君无天,N1067]\b[this,6,10]（第一步完成了，但还是要小心行事！）",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "pauseBgm"
        },
        "\t[君无天（现实）]于是我就跟着她进行了考验，\n....考验的结果很顺利,我担任了这个区域的护法人物，\n...也就是顶尖的圣护之手那个级别的.....。",
        "\t[小粽]那....然后怎么样了.....。",
        "\t[君无天（现实）]然后吗................我遇到了圣羽洛斯那个家伙！\n导致星家灭亡的元凶！！",
        "\t[君无天（现实）]而我....也在那个时候.......。",
        "时间回到之前回忆的一个月之后。",
        {
            "type": "changeFloor",
            "floorId": "MT317",
            "loc": [
                511,
                9
            ],
            "time": 500
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240121,240121,240121,240122,240467,240468,240469,240470,240471,240120,240121,240121,240121],
    [240121,240121,240115,240130,240475,240476,240477,240478,240479,240128,240131,240121,240121],
    [240121,240115,240130,240475,240483,240484,240485,240486,240487,240479,240128,240131,240121],
    [240115,240130,240475,240483,240491,240492,240493,240494,240495,240487,240479,240128,240131],
    [240130,240475,240483,240491,  0,  0,  0,  0,  0,240495,240487,240479,240128],
    [240475,240483,240491,  0,  0,1076,  0,1076,  0,  0,240495,240487,240479],
    [240483,240491,  0,  0,  0,  0,  0,  0,  0,  0,  0,240495,240487],
    [240491,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240495],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [240442,240443,240444,240445,240446,240440,  0,240441,240442,240443,240444,240445,240446],
    [240450,240451,240452,240453,240454,240448,1067,240449,240450,240451,240452,240453,240454]
],
    "bgmap": [
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}