main.floors.MT315=
{
    "floorId": "MT315",
    "title": "星家武斗场（回忆）",
    "name": "星家武斗场（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "006-Mountains01.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "addValue",
            "name": "item:book",
            "value": "-1"
        },
        {
            "type": "playBgm",
            "name": "battle5.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "animate",
            "name": "buff1",
            "loc": [
                2,
                5
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "buff1",
            "loc": [
                10,
                5
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "jump",
            "from": [
                10,
                5
            ],
            "to": [
                2,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "jump",
            "from": [
                2,
                5
            ],
            "to": [
                10,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "animate",
            "name": "attack8",
            "loc": [
                6,
                3
            ]
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    10,
                    5
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    2,
                    5
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "jump",
            "from": [
                10,
                5
            ],
            "to": [
                2,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "jump",
            "from": [
                2,
                5
            ],
            "to": [
                10,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "animate",
            "name": "attack8",
            "loc": [
                6,
                3
            ]
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    10,
                    5
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    2,
                    5
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "jump",
            "from": [
                10,
                5
            ],
            "to": [
                2,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "jump",
            "from": [
                2,
                5
            ],
            "to": [
                10,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "animate",
            "name": "attack8",
            "loc": [
                6,
                3
            ]
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    10,
                    5
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    2,
                    5
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "jump",
            "from": [
                10,
                5
            ],
            "to": [
                2,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "jump",
            "from": [
                2,
                5
            ],
            "to": [
                10,
                5
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "animate",
            "name": "attack8",
            "loc": [
                6,
                3
            ]
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    10,
                    5
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    2,
                    5
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[豪迈的男子,N1070]\b[this,2,5]哈哈哈哈哈哈哈哈！痛快！！痛快！！！",
        "\t[豪迈的男子,N1070]\b[this,2,5]几个月不见，没想到兄弟你的实力又强悍了一步呢！",
        "\t[君无天,N1065]\b[this,10,5]哈哈哈！星天你才让我感到吃惊呀！\n不愧是一族之长呢！",
        "\t[星天,N1070]\b[this,2,5]哈哈哈哈！兄弟缪赞了！\n毕竟兄弟你是凭自己的底蕴才达到这个水平的！",
        "\t[女子的声音]原来你们在这里呀。",
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                2,
                5
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                10,
                5
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    10,
                    5
                ]
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    2,
                    5
                ]
            ]
        },
        {
            "type": "setBlock",
            "number": "N1075",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 500
        },
        "\t[星天,N1068]\b[this,2,5]云，你来了。",
        "\t[星云,N1075]\b[this,6,12]哼！怎么，难道我不能来吗？",
        "\t[星天,N1068]\b[this,2,5]额，这倒不是....只是你现在需要静养\n.....不然会对身体造成一些影响。",
        "\t[君无天,N1064]\b[this,10,5].....嗯？看来兄弟你...要有孩子了呢。",
        "\t[星云,N1075]\b[this,6,12]......嗯！",
        "\t[君无天,N1064]\b[this,10,5]那在下先恭喜你们了。",
        "\t[星天,N1068]\b[this,2,5]哈，多谢了！",
        "\t[君无天,N1064]\b[this,10,5]那兄弟你是希望是男孩还是女孩呢？",
        "\t[星天,N1068]\b[this,2,5]那当然是男...............。",
        "\t[星云,N1075]\b[this,6,12]嗯？！",
        {
            "type": "playSound",
            "name": "Raise1.ogg"
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": [
                2,
                5
            ]
        },
        "\t[星天,N1068]\b[this,2,5]咳咳！当我没说...。",
        "\t[君无天,N1064]\b[this,10,5]哈哈哈，这样呀......。",
        "\t[星天,N1068]\b[this,2,5]..............",
        {
            "type": "playSound",
            "name": "Raise1.ogg"
        },
        {
            "type": "animate",
            "name": "wuyu",
            "loc": [
                2,
                5
            ]
        },
        "\t[君无天,N1064]\b[this,10,5]呵呵....不继续对你开玩笑了。",
        "\t[君无天,N1064]\b[this,10,5]嗯.....不过我最近听说你们星家最近有点不安宁呀\n.....是怎么一回事？",
        "\t[星天,N1068]\b[this,2,5]..............最近魔塔高层有人找我们谈判\n..是关于我们星家的核心科技。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                10,
                5
            ]
        },
        "\t[君无天,N1064]\b[this,10,5]核心科技！他们居然已经嚣张到这个份上了？！",
        "\t[星天,N1068]\b[this,2,5]嗯,而且最近之前在领域的边缘地带起了几次的小冲突\n.....我怀疑就是他们干的！",
        "\t[君无天,N1064]\b[this,10,5]嗯........不如这样吧，我去魔塔高层那里看看能不能担当一个职位\n..以我现在的实力应该可以担当一定等级的职位。",
        "\t[君无天,N1064]\b[this,10,5]这样的话会有机会查阅一些关键信息！",
        "\t[星云,N1075]\b[this,6,12]会不会太危险了？",
        "\t[星天,N1068]\b[this,2,5]对呀,虽然兄弟你的实力的确不错\n......但是.....我还是觉得风险性有点大。",
        "\t[君无天,N1064]\b[this,10,5]嗯，不用兄弟你说我也知道此行的风险性，但是....。",
        "\t[君无天,N1064]\b[this,10,5]这毕竟关系到你们整个星家呀！",
        "\t[星天,N1068]\b[this,2,5]..........................",
        "\t[星天,N1068]\b[this,2,5]哎.....的确，我没有什么阻止你的理由....。",
        "\t[星天,N1068]\b[this,2,5]\r[red]毕竟你我之前可是生死之交呀！",
        "\t[君无天,N1064]\b[this,10,5]有兄弟这句话就足够了！",
        "\t[君无天,N1064]\b[this,10,5]好了，话不多说了，我要启程了！",
        "\t[星天,N1068]\b[this,2,5]等等，你把这个东西带在身上。",
        "\t[君无天,N1064]\b[this,10,5]这是什么？",
        "\t[星天,N1068]\b[this,2,5]这是我们研发的一种可以跨空间留言机，\n只要你用意念灌输到这个小机械，\n它就可以把你想要传递的消息得知我这里。",
        "\t[君无天,N1064]\b[this,10,5]哦？这么好用？！",
        "\t[君无天,N1064]\b[this,10,5]有这个东西帮忙的话,那我对这次旅途就更有把握了!",
        "\t[星天,N1068]\b[this,2,5]嗯，不过兄弟，还是要小心行事！",
        "\t[君无天,N1064]\b[this,10,5]嗯！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    10,
                    5
                ]
            ],
            "remove": true,
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[星云,N1075]\b[this,6,12]天，你觉得君无天他会不会失败呀......。",
        "\t[星天,N1068]\b[this,2,5]放心吧，兄弟他隐藏的实力远比你想象得强！\n所以我相信他一定会成功的！",
        "\t[星云,N1075]\b[this,6,12]这样呀......",
        "\t[星天,N1068]\b[this,2,5]我曾经夜观星象，发现我们星家会即将面临一场浩劫..。",
        "\t[星云,N1075]\b[this,6,12]什么！竟是如此？",
        "\t[星天,N1068]\b[this,2,5]不过在浩劫之中尚有一线生机！\n我觉得兄弟他就是解决这次浩劫的关键！",
        "\t[星云,N1075]\b[this,6,12]希望如此....",
        "\t[星天,N1068]\b[this,2,5]嗯,我们不能只是靠其他人来度日子，\n最重要的还是我们自己！",
        "\t[星天,N1068]\b[this,2,5]时候不早了，我们也得加快准备了！",
        "\t[星云,N1075]\b[this,6,12]好！",
        {
            "type": "pauseBgm"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[君无天（现实）]在我暂时离开星家以后，\n我机缘巧合的去到了连接到了最后一个区域的中转战——魔殿。",
        "\t[君无天（现实）]而也是在这里我得知了一些不可告人的阴谋！",
        "\t[君无天（现实）]同时我也在那里被迫做出了一个—:\n我一生都无法原谅的选择！",
        "时间回到了君无天到达魔殿门口处.....。",
        {
            "type": "changeFloor",
            "floorId": "MT316",
            "loc": [
                61,
                12
            ],
            "time": 500
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,1070,  0,  0,  0,  0,  0,  0,  0,1065,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110057,110058,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,110069,110040,110041,110041,110041,110041,110041,110041,110041,110042,110071,  0],
    [  0,110077,110048,  0,  0,  0,  0,  0,  0,  0,110050,110079,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200000,  0,  0,  0,  0,  0,  0,  0,200000,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,110040,110041,110042,  0,  0,  0,  0,  0,110040,110041,110042,  0],
    [  0,110048,200000,110050,  0,  0,  0,  0,  0,110048,200000,110050,  0],
    [  0,110056,110057,110058,  0,  0,  0,  0,  0,110056,110057,110058,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110069,110070,110071,  0,  0,  0,  0,  0,110069,110070,110071,  0],
    [  0,110077,110078,146,146,146,146,146,146,146,110078,110079,  0]
],
    "fg2map": [

]
}