main.floors.MT319=
{
    "floorId": "MT319",
    "title": "星家武斗场（回忆）",
    "name": "星家武斗场（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "006-Mountains01.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "battle5.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                12
            ]
        },
        "\t[星天,N1071]\b[this,6,12]兄弟，你现在处境如何呀，\n.....怎么最近都没有回应呀。",
        "\t[星天,N1071]\b[this,6,12]最近云她即将到妊娠期了，\n再过几天孩子就出生了呢.........。",
        "\t[星天,N1071]\b[this,6,12]不过在那个时候我们星家的防守会处于最为薄弱的时刻.....。",
        "\t[星天,N1071]\b[this,6,12]希望不要在那个时候出什么岔子吧....。",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                12
            ]
        },
        "\t[星天,N1071]\b[this,6,12]留言机有反应了！看来兄弟他取得情报了！！",
        {
            "type": "pauseBgm"
        },
        "星天打开留言机看到了君无天的留言——上面写的是：",
        "一星期之后，魔塔将会派出所有阁主前来灭杀星家！切记！切记！！",
        "而且我也被一个阁主所逼被迫参加这次灭杀！\n无法逃离三圣之巅！！所以请兄弟你做好最坏的打算！！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                12
            ]
        },
        "\t[星天,N1071]\b[this,6,12]这！怎么会这样！！\n魔王他居然派了所有阁主来灭杀我星家！！\n而且还挑在这个时间点上！！",
        "\t[星天,N1071]\b[this,6,12]而且兄弟你也被迫.................。",
        "\t[星天,N1071]\b[this,6,12]该死！！",
        "\t[星天,N1071]\b[this,6,12]兄弟！我会让他们明白！！\n我星家可不是软柿子，可以随意被人蹂躏的！！！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "一个星期之后.......。",
        {
            "type": "playBgm",
            "name": "god1.mp3",
            "keep": true
        },
        "\t[魔王]是时候了！",
        "\t[魔王]是时候到清算的时刻了！\n此次行动一旦完成，\n我们即可开始准备魔塔最高计划了！！！",
        "\t[魔王]黯夜殇！圣羽洛斯！",
        "\t[黯夜殇/圣羽洛斯]属下在！",
        "\t[魔王]听我号令！前去灭杀星家！！",
        "\t[黯夜殇/圣羽洛斯]得令！！",
        "\t[黯夜殇]来吧！就让我看看星家有没有什么能打的！！",
        "\t[黯夜殇]黯夜军团！随我出战！！",
        "\t[黯夜军团]杀！！！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[圣护之手·天]圣羽洛斯大人，我们也行动吧！",
        "\t[圣羽洛斯]嗯......那你们就先去吧！我在后面督战！",
        "\t[圣护之手·天]是！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[君无天].................",
        "\t[圣羽洛斯]走吧，君无天，可别忘了这既是一场灭杀，更是一场选拔呢！",
        "\t[圣羽洛斯]这次行动可能会让你成为第三位阁主哟。",
        "\t[圣羽洛斯]而且这次行动是这样的：我去破除他们的星家大阵。",
        "\t[圣羽洛斯]而你就与那星家的族长决一死战！并且斩杀他！！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[君无天]（！！！什么！）",
        "\t[圣羽洛斯]怎么,觉得有点困难吗？",
        "\t[圣羽洛斯]你要对自己有信心呀，毕竟未来我也有一个计划",
        "\t[圣羽洛斯]未来等你成为阁主以后，说不定未来我也需要你的帮助呢。",
        "\t[君无天]（...................。）",
        "\t[圣羽洛斯]加油吧！哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！！",
        "\t[君无天]（...................。）",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[君无天]（...................兄弟,难道我真的要与你........。）",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[君无天]（这究竟是命运的安排,还是.......。）",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "changeFloor",
            "floorId": "MT320",
            "loc": [
                16,
                6
            ],
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110057,110058,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110062,110063,  0],
    [  0,110069,110040,110041,110041,110041,110041,110041,110041,110041,110042,110071,  0],
    [  0,110077,110048,  0,  0,  0,1071,  0,  0,  0,110050,110079,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,200000,  0,  0,  0,  0,  0,  0,  0,200000,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,110040,110041,110042,  0,  0,  0,  0,  0,110040,110041,110042,  0],
    [  0,110048,200000,110050,  0,  0,  0,  0,  0,110048,200000,110050,  0],
    [  0,110056,110057,110058,  0,  0,  0,  0,  0,110056,110057,110058,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110061,110062,110063,  0,  0,  0,  0,  0,110061,110062,110063,  0],
    [  0,110069,110070,110071,  0,  0,  0,  0,  0,110069,110070,110071,  0],
    [  0,110077,110078,146,146,146,146,146,146,146,110078,110079,  0]
],
    "fg2map": [

]
}