main.floors.MT320=
{
    "floorId": "MT320",
    "title": "星家大殿（回忆）",
    "name": "星家大殿（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "battle8.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[星天,N1068]\b[this,6,3]...大家应该已经得知：我星家现在正处于最艰难的时刻了....。",
        "\t[星天,N1068]\b[this,6,3]根据前线所传来的情报得知,这次不仅仅是两位阁主亲临，\n而且还派出了其麾下的精锐实力前来灭杀！！",
        "\t[星天,N1068]\b[this,6,3]目的就是为了我星家的核心科技！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                2,
                6
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                2,
                8
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                2,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                2,
                11
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                10,
                6
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                10,
                8
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                10,
                9
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                10,
                11
            ]
        },
        "\t[星家大长老,N1109]\b[this,10,6]哼！他们早就想染指我星家的科技了！！\n不过他们太低估我星家了！",
        "\t[星家大长老,N1109]\b[this,10,6]如果他们硬要来的话，我不介意先让他们让他们伤筋动骨！",
        "\t[星家二长老,N1090]\b[this,2,6]的确如大长老所言:他们既然想夺得我星家的科技，就得做好被反扑的准备！",
        "\t[星家二长老,N1090]\b[this,2,6]虽然族长大人的爱妻刚生育完，身体比较虚弱，\n不能一同作战，但还有我们这些长老呢！",
        "\t[星家大长老,N1109]\b[this,10,6]对！虽然他们实力的确很强悍，\n但我们还有星家的大阵，\n一旦操纵大阵就连阁主级别的人物都得避其锋芒！",
        "\t[星天,N1068]\b[this,6,3]嗯，虽然我们可以凭借科技能够取得很大优势，但是还是要小心！",
        "\t[星天,N1068]\b[this,6,3]因为我听说两位阁主:一位肉身极其强悍，一位与我们一样精通科技力量！",
        "\t[星天,N1068]\b[this,6,3]所以请各位长老一定要小心行事！\n切记不能擅自行动！！",
        "\t[星天,N1068]\b[this,6,3]那各位长老！随我去迎敌吧！",
        "\t[星家众长老]遵命！",
        "\t[星天,N1068]\b[this,6,3]（........这次我星家是存是亡，就看今朝了！）",
        "\t[星天,N1068]\b[this,6,3]（不过兄弟....你现在究竟在哪呢....）",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": "MT321",
            "loc": [
                121,
                7
            ],
            "time": 500
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [149,149,149,149,149,149,149,149,149,149,149,149,149],
    [149,149,149,149,180245,  0,180245,  0,180245,149,149,149,149],
    [149,149,149,149,  0,90602,90603,90604,  0,149,149,149,149],
    [149,180244,180245,180246,  0,90610,1068,90612,  0,180244,180245,180246,149],
    [149,180252,180253,180254,181822,181823,  0,181822,181823,180252,180253,180254,149],
    [149,  0,  0,  0,181830,181831,  0,181830,181831,  0,  0,  0,149],
    [149,  0,1090,181066,181067,  0,  0,  0,181066,181067,1109,  0,149],
    [149,  0,  0,181074,181075,  0,  0,  0,181074,181075,  0,  0,149],
    [149,  0,1114,181082,181083,  0,  0,  0,181082,181083,1101,  0,149],
    [149,  0,1098,181066,181067,  0,  0,  0,181066,181067,1105,  0,149],
    [149,  0,  0,181074,181075,  0,  0,  0,181074,181075,  0,  0,149],
    [149,  0,1094,181082,181083,  0,  0,  0,181082,181083,1085,  0,149],
    [149,149,149,149,149,149,  0,149,149,149,149,149,149]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,180245,  0,180245,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,180245,  0,180245,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,143,143,143,143,143,  0,  0,  0,  0],
    [  0,  0,  0,  0,143,143,143,143,143,  0,  0,  0,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,143,143,143,143,143,143,143,143,143,143,143,  0],
    [  0,  0,  0,  0,  0,  0,143,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,90569,  0,  0,  0,90569,  0,  0,  0,  0],
    [  0,  0,  0,  0,90577,  0,  0,  0,90577,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,90570,  0,90571,90569,  0,  0,  0,  0],
    [  0,  0,  0,  0,180253,90578,180253,90579,90577,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90611,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,70068,  0,  0,  0,  0,  0,  0,  0,  0,  0,70068,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,70068,  0,  0,  0,  0,  0,  0,  0,  0,  0,70068,  0],
    [  0,70068,  0,  0,  0,  0,  0,  0,  0,  0,  0,70068,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,70068,  0,  0,  0,  0,  0,  0,  0,  0,  0,70068,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}