main.floors.MT332=
{
    "floorId": "MT332",
    "title": "终焉之城·魔殿第一层",
    "name": "终焉之城·魔殿第一层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "bgm": "battle23.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "battle23.mp3"
        },
        {
            "type": "changePos",
            "loc": [
                6,
                11
            ],
            "direction": "up"
        },
        "\t[小粽,hero]\b[hero]......................。",
        "\t[星钰,N1196]\b[hero,2]好可怕的能量波动！这里究竟是怎么一回事？！",
        "\t[君无天,N1195]\b[hero,3]不对劲......魔殿作为终焉之城的第一个区域，其充其量应该如同三圣之巅的黯夜塔那个程度........",
        "\t[小粽,hero]\b[hero]星天前辈，但为什么我感觉遍地都是不逊色于三圣阁主的魔物？",
        "\t[君无天,N1195]\b[hero,3].......这个问题的确令人深思。",
        "\t[？？？]那是因为这是吾主的成就！",
        "\t[小粽,hero]\b[hero]什么人？！",
        "\t[君无天,N1195]\b[hero,3]另一种无法辨别身份的合成音......你究竟是谁？",
        "\t[？？？]吾之身份，不足挂齿。吾只是吾主座下的一名小将罢了。",
        "\t[？？？]你们只用知道汝等所面临的敌人皆是吾主的成就即可，并且......",
        "\t[？？？]心满意足的死去吧！",
        "\t[君无天,N1195]\b[hero,3]虚张声势！如果你真的能做到的话，你又何必与我们浪费口舌之言。",
        "\t[？？？]......不愧是三圣之巅最强者，即使是吾主也对汝有所忌惮......。",
        "\t[？？？].......不过呢，吾很好奇汝是否真的拥有与吾主相匹敌的实力呢！",
        "\t[君无天,N1195]\b[hero,3]哼，有没有其对应的实力吗？你可以试一试！",
        "\t[？？？]哈哈哈哈哈哈哈哈！很好！非常好！吾在第十层等你！！请！！",
        "\t[小粽,hero]\b[hero]......星天前辈，那个人究竟是......",
        "\t[君无天,N1195]\b[hero,3]......某个闭死关的老不死所揉捏的玩物罢了，不足挂齿。",
        "\t[星钰,N1196]\b[hero,2]闭死关的老不死？父亲大人，这是何意？难道那个人所说的吾主不是“梦”吗。",
        "\t[君无天,N1195]\b[hero,3]并不是，据我所知，“梦”这个女人向来独来独往。平时大部分时间都是服侍在魔王身边，几乎从来没有看到她与其他人独自交流。",
        "\t[君无天,N1195]\b[hero,3]而至于我说的那些老不死，就是上一任的三圣阁主！",
        "\t[小粽,hero]\b[hero]上一任的三圣阁主？？！！",
        "\t[君无天,N1195]\b[hero,3]嗯，三圣阁这个势力其实在魔塔诞生之初就已经存在，这在魔塔世界里面的历史书上即可查证。",
        "\t[君无天,N1195]\b[hero,3]并且上一任三位阁主的名号是：黯祖,谶祖,剑祖。",
        "\t[君无天,N1195]\b[hero,3]黯祖是所有黯夜魔物的始祖。谶祖则是一个喜欢操纵傀儡的家伙。至于剑祖是......",
        "\t[君无天,N1195]\b[hero,3]\\d我和星天兄弟共同的师父！",
        "\t[小粽,hero]什么！！！",
        "\t[星钰,N1196]\b[hero,2]父亲大人？你.....你说他是你与我亲生父亲的师父？！",
        "\t[君无天,N1195]\b[hero,3]......嗯。",
        "\t[小粽,hero]\b[hero]那....星天前辈，为什么........",
        "\t[君无天,N1195]\b[hero,3]小粽，我知道你想说什么。",
        "\t[君无天,N1195]\b[hero,3]在当初我与星天认识剑祖师父时，师父他的身体非常不稳定。",
        "\t[君无天,N1195]\b[hero,3]如果不是我和星天的话，或许师父他早就......",
        "\t[小粽,hero]\b[hero].....我明白了。",
        "\t[星钰,N1196]\b[hero,2]这样吗......。",
        "\t[罗天,N1197]\b[hero,1]...............。",
        "\t[君无天,N1195]\b[hero,3]嗯......等解决掉刚才谶祖制造的玩意之后就去找师父，看看师父他是否健在。",
        "\t[小粽,hero]\b[hero]........好。",
        "\t[君无天,N1195]\b[hero,3]多年不见，不知师父还记得我君某人。"
    ],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 2000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 4000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 10000
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092],
    [240092,339,354,240092, 21,240092, 87, 83, 31, 31, 31, 31,240092],
    [240092,370,1157, 83, 32,240092,1156,240092,335, 23,1150,335,240092],
    [240092,410,355,240092, 81, 81, 28,240092,240092,240092, 81,240092,240092],
    [240092,370,338,240092,382,1154,  0,1154, 32,1155,  0,383,240092],
    [240092,240092,240092,240092,240092, 29,1153, 81,  0,240092, 21,1150,240092],
    [240092, 50,1152,  0, 31,  0,382,240092, 28,  0, 82, 23,240092],
    [240092, 81,240092,1154,240092,1155,  0, 82,1153, 21,  0,240092,240092],
    [240092, 81,  0, 32, 81, 27,240092,240092,240092, 81,1156,351,240092],
    [240092, 21,383,1154,240092,  0, 29,1152,  0, 81,335, 34,240092],
    [240092,240092, 82,240092,240092,240092,1153,240092, 29,240092,240092, 81,240092],
    [240092, 22,1153, 21, 31, 81, 88,240092, 82, 34,386,1151,240092],
    [240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,154,154,154,154,154,154,154,154,154,154,154,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}