main.floors.MT330=
{
    "floorId": "MT330",
    "title": "终焉之城·魔殿（外围）",
    "name": "终焉之城·魔殿（外围）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "defaultGround": "T1254",
    "bgm": null,
    "firstArrive": [
        {
            "type": "setVolume",
            "value": 90,
            "time": 500
        },
        {
            "type": "function",
            "function": "function(){\ncore.removeMaps(\"MT0\", \"MT329\")\n}"
        },
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "1000000000000000"
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "value": "100000000000000"
        },
        {
            "type": "setValue",
            "name": "status:def",
            "value": "100000000000000"
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "value": "100000000000000"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:yellowKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:blueKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:redKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "addValue",
            "name": "item:I507",
            "value": "-114514"
        },
        {
            "type": "addValue",
            "name": "item:centerFly",
            "value": "-114514"
        },
        {
            "type": "addValue",
            "name": "item:pickaxe",
            "value": "-114514"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showStatusBar"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,10": [
            "\t[君无天,N1252]\b[this,6,8]终于到了......没想到我竟然会以这样的方式重新踏入这里呢！",
            "\t[小粽,hero]\b[this,6,10]星天前辈，这里就是您当初选拔身份的地方呀.....",
            "\t[小粽,hero]\b[this,6,10]怎么感觉气氛有一点不对劲.....",
            "\t[星钰,N1250]\b[this,7,9]我也感觉很不安呢.......怎么回事。",
            "\t[罗天,N1251]\b[this,5,9]............",
            "\t[？？？]滋滋滋……数据库开始计算..........",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    8
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    7,
                    9
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            {
                "type": "setBlock",
                "number": "N1195",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N1196",
                "loc": [
                    [
                        7,
                        9
                    ]
                ],
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N1197",
                "loc": [
                    [
                        5,
                        9
                    ]
                ],
                "time": 0
            },
            "\t[小粽,hero]\b[this,6,10]嗯？！什么声音？",
            "\t[？？？]滋滋滋……数据库开始计算..........",
            "\t[星钰,N1196]\b[this,7,9]怎么会？居然是高等科技的产物！",
            "\t[小粽,hero]\b[this,6,10]高等科技？",
            "\t[君无天,N1195]\b[this,6,8]高等科技……至少是三圣之巅的那个级别的科技。",
            "\t[？？？]滋滋滋……数据库开始计算..........",
            "\t[小粽,hero]\b[this,6,10]什么？！！！难道圣羽洛斯那个畜生还没死吗？！！！",
            "\t[君无天,N1195]\b[this,6,8]不可能！那个家伙死的渣都不剩了，不可能会是他在操作这个系统。",
            "\t[？？？]数值计算完毕！",
            "\t[小粽,hero]\b[this,6,10]计算完毕？那........",
            "\t[机器里播放的声音]你们好：\n神之勇者——小粽\n音律星尊——罗天\n造物星尊——星钰\n以及……",
            "\t[机器里播放的声音]三圣阁主——君无天！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    9
                ],
                "async": true
            },
            "\t[罗天,N1197]\b[this,6,8]等等……这个声音是！",
            "\t[君无天,N1195]\b[this,6,8]看来你们已经知道我叛变了呢。我说是吗？",
            "\t[机器里播放的声音]背叛魔王大人的家伙，应当杀无赦！",
            "\t[君无天,N1195]\b[this,6,8]但是你现在不是本尊亲临，而是以这样的方式来与我们交流，这说明……",
            "\t[君无天,N1195]\b[this,6,8]你一定没工夫插手！",
            "\t[机器里播放的声音]不愧是君阁主，洞察力的确比寻常人超出许多。不过……",
            "\t[机器里播放的声音]你们很快就会含恨这里的！",
            {
                "type": "playBgm",
                "name": "battle21.mp3",
                "keep": true
            },
            "\t[小粽,hero]\b[this,6,10]嗯，怎么会有音乐？",
            "\t[罗天,N1197]\b[this,5,9]这是！！",
            "\t[小粽,hero]\b[this,6,10]怎么了，罗天？",
            "\t[君无天,N1195]\b[this,6,8]不要听她施展的音律！快守住本心！！",
            "\t[小粽,hero]\b[this,6,10]居然是心灵控制！！",
            {
                "type": "playSound",
                "name": "aid1.ogg"
            },
            {
                "type": "animate",
                "name": "aid1",
                "loc": [
                    5,
                    9
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "VXMagic.ogg"
            },
            {
                "type": "sleep",
                "time": 264
            },
            {
                "type": "playSound",
                "name": "VXDown.ogg"
            },
            {
                "type": "sleep",
                "time": 240
            },
            {
                "type": "animate",
                "name": "deep1",
                "loc": [
                    5,
                    9
                ]
            },
            {
                "type": "setVolume",
                "value": 50,
                "time": 0
            },
            "\t[小粽,hero]\b[this,6,10]嗯？那种眩晕感怎么突然削弱了许多。",
            "\t[星钰,N1196]\b[this,7,9]诶？罗天你干了什么。",
            "\t[罗天,N1197]\b[this,5,9]以音律来抵消她的心灵控制。",
            "\t[罗天,N1197]\b[this,5,9]不过因为实力上的差距，我不能完全抵消。",
            "\t[君无天,N1195]\b[this,6,8]嗯……看来仙月前辈让你跟我们一起前进是非常必要的啊，不然我们麻烦就大了。",
            "\t[罗天,N1197]\b[this,5,9]多谢夸奖，不过我得专心抵消这种音律，在前方战斗的事就麻烦你们了。",
            "\t[小粽,hero]\b[this,6,10]没事，有你的帮助我们才能专心战斗呢！",
            "\t[星钰,N1196]\b[this,7,9]是呀。",
            "罗天，星钰，君无天加入队伍，全属性提升一百兆！！！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "remove": true,
                "time": 0,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        9
                    ]
                ],
                "remove": true,
                "time": 0,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        9
                    ]
                ],
                "remove": true,
                "time": 0
            },
            {
                "type": "addValue",
                "name": "status:atk",
                "value": "100000000000000"
            },
            {
                "type": "addValue",
                "name": "status:def",
                "value": "100000000000000"
            },
            {
                "type": "addValue",
                "name": "status:mdef",
                "value": "100000000000000"
            },
            {
                "type": "follow",
                "name": "lt.png"
            },
            {
                "type": "follow",
                "name": "xy.png"
            },
            {
                "type": "follow",
                "name": "jwt.png"
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "hide",
                "remove": true,
                "time": 0
            }
        ]
    },
    "changeFloor": {
        "6,3": {
            "floorId": "MT331",
            "loc": [
                6,
                0
            ],
            "direction": "down",
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240121,240121,240121,240122,240467,240468,240469,240470,240471,240120,240121,240121,240121],
    [240121,240121,240115,240130,240475,240476,240477,240478,240479,240128,240131,240121,240121],
    [240121,240115,240130,240475,240483,240484,240485,240486,240487,240479,240128,240131,240121],
    [240115,240130,240475,240483,240491,240492, 87,240494,240495,240487,240479,240128,240131],
    [240130,240475,240483,240491,  0,  0,  0,  0,  0,240495,240487,240479,240128],
    [240475,240483,240491,  0,  0,  0,  0,  0,  0,  0,240495,240487,240479],
    [240483,240491,  0,  0,  0,  0,  0,  0,  0,  0,  0,240495,240487],
    [240491,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240495],
    [  0,  0,  0,  0,  0,  0,1252,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,1251,  0,1250,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [240442,240443,240444,240445,240446,240440,  0,240441,240442,240443,240444,240445,240446],
    [240450,240451,240452,240453,240454,240448,  0,240449,240450,240451,240452,240453,240454]
],
    "bgmap": [
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028],
    [240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028,240028]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,240493,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}