main.floors.MT341=
{
    "floorId": "MT341",
    "title": "终焉之城·魔殿第十层",
    "name": "终焉之城·魔殿第十层",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "bgm": "battle23.mp3",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 2000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 4000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 10000
        }
    ],
    "parallelDo": "",
    "events": {
        "6,9": [
            {
                "type": "playBgm",
                "name": "boss1.mp3"
            },
            "\t[？？？,E1167]\b[this,6,7]很好，非常好，不愧是君阁主。值得吾主将你评为最高危险等级！",
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            "\t[小粽,hero]\b[hero]你是！安兹乌洛斯？？！！",
            "\t[小粽,hero]\b[hero]不！不可能！你明明已经死了！",
            "\t[星钰,N1196]\b[hero,2]你是第一区域的头目——安兹乌洛斯？！！",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]安兹乌洛斯？嗯......我以前的确叫这个名字。不过现在的我是吾主最忠实的战将！",
            "\t[星钰,N1196]\b[hero,2]死者复生.......这....怎么可能！",
            "\t[星钰,N1196]\b[hero,2]而且你的实力......",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]没错，正如你们所见，吾在吾主的帮助下已经成为了远超阁主级别的存在！",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]比起这个......君无天，请你一个人去与吾主会谈。",
            "\t[君无天,N1195]\b[hero,3]如果我说不呢！",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]那么......你就准备好接受吾主的怒火吧！",
            "\t[君无天,N1195]\b[hero,3]你是说那个只会偷袭我师父的谶祖吗？",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]你敢侮蔑吾主？！你找死！！",
            "\t[小粽,hero]\b[hero]星天前辈，小心！",
            "\t[君无天,N1195]\b[hero,3]我知道！",
            {
                "type": "battle",
                "id": "E1167"
            },
            {
                "type": "playBgm",
                "name": "battle23.mp3"
            },
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]噗！！！不可能！！你们这些家伙！怎么可能击败我！",
            "\t[小粽,hero]\b[hero]因为你太过依赖你的主人所给予那所谓的力量了。",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]你....！你这家伙！我怎么可能再一次被你击败！！",
            "\t[小粽,hero]\b[hero]早被时代所抛弃的人，不应该继续像小丑一样涂脂抹粉！",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]吾！吾主是不会放过你们的！！",
            "\t[小粽,hero]\b[hero]结束了！安兹乌洛斯！",
            "\t[安兹乌洛斯？,E1167]\b[this,6,7]不！！！！！！",
            {
                "type": "animate",
                "name": "attack9",
                "loc": [
                    6,
                    7
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "Attack09.wav"
            },
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            {
                "type": "sleep",
                "time": 200
            },
            {
                "type": "playSound",
                "name": "Blow4.ogg"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "remove": true,
                "time": 500
            },
            {
                "type": "insert",
                "loc": [
                    6,
                    5
                ]
            }
        ],
        "6,0": [
            {
                "type": "changeFloor",
                "floorId": "MT352",
                "loc": [
                    6,
                    0
                ],
                "direction": "down",
                "time": 500
            },
            {
                "type": "playBgm",
                "name": "battle25.mp3"
            }
        ],
        "6,5": [
            "\t[罗天,N1197]\b[hero,1]结束了吗............？",
            "\t[星钰,N1196]\b[hero,2]父亲大人，究竟是怎么一回事，为什么安兹乌洛斯能够被人复活？",
            "\t[君无天,N1195]\b[hero,3]他并不是真正的安兹乌洛斯。",
            "\t[小粽,hero]\b[hero]这是何意？",
            "\t[君无天,N1195]\b[hero,3]准确来说他是名为安兹乌洛斯的傀儡。",
            "\t[君无天,N1195]\b[hero,3]是谶祖这个老不死将真正死去的安兹乌洛斯的尸体变成这个模样，并且将其相应的记忆灌输到这个傀儡之中。",
            "\t[君无天,N1195]\b[hero,3]最后展现出于原来无异的傀儡。",
            "\t[小粽,hero]\b[hero]嘶......我很好奇他究竟是怎么做到的。",
            "\t[君无天,N1195]\b[hero,3]嗯...........",
            "\t[君无天,N1195]\b[hero,3]...............",
            "\t[君无天,N1195]\b[hero,3]算了，我们再怎么干想也想不出来，趁现在我们带你们去见我师父吧。",
            "\t[小粽,hero]\b[hero]好。",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "remove": true,
                "time": 500
            },
            "提示：现在可以去魔殿第五层里的传送门了。",
            {
                "type": "openDoor",
                "loc": [
                    3,
                    4
                ],
                "async": true
            },
            {
                "type": "openDoor",
                "loc": [
                    9,
                    4
                ],
                "async": true
            },
            {
                "type": "openDoor",
                "loc": [
                    11,
                    6
                ],
                "floorId": "MT336",
                "async": true
            },
            {
                "type": "openDoor",
                "loc": [
                    12,
                    5
                ],
                "floorId": "MT336",
                "async": true
            },
            {
                "type": "openDoor",
                "loc": [
                    12,
                    7
                ],
                "floorId": "MT336"
            },
            {
                "type": "waitAsync"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240037,240100,240100,240100,240100,240092, 85,240092,240100,240100,240100,240100,240100],
    [240108,240108,240108,240108,240108,240100, 85,240100,240108,240108,240108,240108,240108],
    [240116,240116,240116,240116,240116,240108, 85,240108,240116,240116,240116,240116,240116],
    [ 32, 24,397,397,397,240116, 85,240116, 22, 33, 22,240092, 32],
    [ 32,240092,240092, 85,240092,240092, 85,240092,240092, 85,240092,240092, 32],
    [ 34,240092,  0,  0,  0,  0,  0,  0,  0,  0,  0,240092, 33],
    [ 81,240092,  0,  0,  0,  0,  0,  0,  0,  0,  0,240092, 33],
    [ 31,240092,  0,  0,  0,  0,1167,  0,  0,  0,  0,240092, 82],
    [ 32,240092,  0,  0,  0,  0,  0,  0,  0,  0,  0,240092, 31],
    [ 34,240092,  0,  0,  0,  0,  0,  0,  0,  0,  0,240092, 33],
    [ 81,240092,240092,240092,240092,240092, 83,240092,240092,240092,240092,240092, 33],
    [ 32, 34, 81, 31, 34, 81,  0, 82, 33, 34, 32, 31, 82],
    [240092,240092,240092,240092,240092,240092, 88,240092,240092,240092,240092,240092,240092]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0, 17, 17,  0, 17,  0,  0,  0, 17,  0, 17, 17,  0],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [  0, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}