main.floors.MT351=
{
    "floorId": "MT351",
    "title": "剑祖之坛（九重天）",
    "name": "剑祖之坛（九重天）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1181",
    "bgm": "battle24.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "slience2.mp3"
        },
        "\t[剑祖,E1179]\b[this,6,3]...............",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        "\t[剑祖,E1179]\b[this,6,3]你们前来是为何意？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                12
            ]
        },
        "\t[君无天,N1195]\b[hero,3]剑祖师父！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                3
            ]
        },
        "\t[剑祖,E1179]\b[this,6,3]这声音！是小君吗？！",
        {
            "type": "setBlock",
            "number": "E1180",
            "loc": [
                [
                    6,
                    3
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                3
            ]
        },
        "\t[剑祖,E1180]\b[this,6,3]真......真的是你！小君。",
        "\t[君无天,N1195]\b[hero,3]是我，师父，没想到十多年不见师父依旧健在。",
        "\t[剑祖,E1180]\b[this,6,3]臭小子！说什么傻话呢，老夫现在就算再战十年还有余呢！",
        "\t[君无天,N1195]\b[hero,3]哈哈哈哈！不愧是师父，徒弟受教了。",
        "\t[君无天,N1195]\b[hero,3]对了，剑祖师父，谶祖呢，我在路上遇到不少谶祖制造的傀儡。",
        "\t[剑祖,E1180]\b[this,6,3]谶祖？那个老家伙不是早就闭死关了吗，你突然说这个干什么。",
        "\t[君无天,N1195]\b[hero,3]可是.......。",
        "\t[剑祖,E1180]\b[this,6,3]对了，小君啊，小星他去哪里了，为什么他没有跟你一起来呢？",
        "\t[君无天,N1195]\b[hero,3]..........是这样的.......",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "君无天把星天的死告诉了剑祖。",
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[剑祖,E1180]\b[this,6,3]...........是吗，小星他已经走了啊。",
        "\t[君无天,N1195]\b[hero,3]嗯，要不是因为我，星天也不会死在我手中。",
        "\t[剑祖,E1180]\b[this,6,3]不，这并不是你的错，你只是一个无辜的受害者。",
        "\t[剑祖,E1180]\b[this,6,3]记住，小君，欲想成就剑之巅，最重要的就是修心。",
        "\t[剑祖,E1180]\b[this,6,3]一个人最强大的并非是他本身固有的力量，而是内心。",
        "\t[剑祖,E1180]\b[this,6,3]一个内心强大的人，无论在未来面临怎样的困难，怎样的悲伤，都能够重新振作起来，奔向光明！",
        "\t[剑祖,E1180]\b[this,6,3]道心强大，方得始终！",
        "\t[剑祖,E1180]\b[this,6,3]小君，无论何时，希望你都能记住为师所说的话。",
        "\t[君无天,N1195]\b[hero,3]放心吧师父，我一定会成为那真正的剑之巅的！",
        "\t[剑祖,E1180]\b[this,6,3]嗯......那就好，这些话也是对你带来这些小家伙们说的。",
        "\t[小粽,hero]\b[hero]..............",
        "\t[君无天,N1195]\b[hero,3]那师父，你.......",
        "\t[剑祖,E1180]\b[this,6,3]小君，你也知道，为师的身体已经快不行了，不能再像你们这些年轻人一样了......",
        "\t[君无天,N1195]\b[hero,3]不！师父，你一定会没事的。我这就去找仙月前辈。",
        "\t[剑祖,E1180]\b[this,6,3]没用的，就算是她也无法治疗我的伤势，我的身体我自己再清楚不过了......。",
        "\t[君无天,N1195]\b[hero,3]师父...............，是徒儿不孝，没有招护好你。",
        "\t[剑祖,E1180]\b[this,6,3]呵呵呵.....傻孩子，人生来就是要落叶归根的，对于生死老夫早已看淡了。不要为我即将离去而痛苦。",
        "\t[剑祖,E1180]\b[this,6,3]这是我当年征战的武器，就留给你们去使用吧！",
        "获得剑祖当年征战的武器，全属性提升三百兆！！！！",
        {
            "type": "addValue",
            "name": "status:atk",
            "value": "300000000000000"
        },
        {
            "type": "addValue",
            "name": "status:def",
            "value": "300000000000000"
        },
        {
            "type": "addValue",
            "name": "status:mdef",
            "value": "300000000000000"
        },
        "\t[众人]谢剑祖爷爷！",
        "\t[君无天,N1195]\b[hero,3]谢师父！.........",
        "\t[剑祖,E1180]\b[this,6,3]走吧，去完成你们的使命吧，不要为我这个早已行将就木的老头子所驻留。",
        "\t[君无天,N1195]\b[hero,3]师父....等我阻止魔王以后，就为你寻得治疗您伤势的药草。",
        "\t[剑祖,E1180]\b[this,6,3]哈，我相信你一定能做到的。",
        {
            "type": "pauseBgm"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changePos",
            "loc": [
                142412,
                142124
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[剑祖,E1180]\b[this,6,3]...............",
        {
            "type": "playBgm",
            "name": "holy2.mp3",
            "keep": true
        },
        "\t[？？？]为什么不告诉他们真相呢？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                3
            ]
        },
        "\t[剑祖,E1180]\b[this,6,3]！！！",
        {
            "type": "playSound",
            "name": "139-Darkness02.ogg"
        },
        {
            "type": "animate",
            "name": "attack18",
            "loc": [
                6,
                7
            ],
            "async": true
        },
        {
            "type": "setBlock",
            "number": "E1182",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[剑祖,E1180]\b[this,6,3]是你！谶祖！！",
        "\t[谶祖,E1182]\b[this,6,7]对于他们来说告诉真相是对他们最好的解脱！你说是吗？",
        "\t[剑祖,E1180]\b[this,6,3]................",
        "\t[谶祖,E1182]\b[this,6,7]你应该很清楚你现在的处境！",
        "\t[剑祖,E1180]\b[this,6,3].....................",
        "\t[谶祖,E1182]\b[this,6,7]既然你清楚自己现在的处境，那为什么不告诉他们真相呢？",
        "\t[剑祖,E1180]\b[this,6,3]初生的树苗现在还不足以成为一颗参天大树，我不能允许你去摧毁这些还未茁长成长的树苗！",
        "\t[谶祖,E1182]\b[this,6,7]哼哼哼......剑老头啊，在当年一战算是你赢了，在我那半个徒弟圣羽洛斯与你的徒弟之间的战斗，也是你赢了。",
        "\t[谶祖,E1182]\b[this,6,7]而这一次，是我赢了！",
        "\t[谶祖,E1182]\b[this,6,7]而且问题不在于谁会允许我，而是谁能阻止我！",
        "\t[谶祖,E1182]\b[this,6,7]你我二人虽然都是上一任的三圣阁主，但由于你与我当年的那一战身受重伤，导致你修为停滞不前，现在的你对于我来说——",
        {
            "type": "callBook"
        },
        "\t[谶祖,E1182]\b[this,6,7]\r[red]——如同蝼蚁！",
        "\t[剑祖,E1180]\b[this,6,3]咳咳咳......虽然老夫已经没有前进的动力，但是！",
        "\t[剑祖,E1180]\b[this,6,3]\r[red]小君他们一定会粉碎你！",
        "\t[谶祖,E1182]\b[this,6,7]哦？是吗。",
        "\t[谶祖,E1182]\b[this,6,7]就凭那些小鬼吗？哼！就算是魔王也没有资格粉碎我！！",
        "\t[剑祖,E1180]\b[this,6,3]哈.....哈...虚张声势，恐怕你见到魔王本尊不得吓得屁滚尿流！",
        "\t[谶祖,E1182]\b[this,6,7]魔王？一个僭越者罢了，在吾主面前不足为提！",
        "\t[剑祖,E1180]\b[this,6,3]吾主？你说的主人究竟是谁？！",
        "\t[谶祖,E1182]\b[this,6,7]低等生灵没有资格直呼吾主之名！如果不是为了完成吾主的计划，吾早就将你给解决了！",
        "\t[剑祖,E1180]\b[this,6,3].........你这家伙。究竟是什么人！有何目的！！",
        "\t[谶祖,E1182]\b[this,6,7]你没有资格知晓我是何人！我有何目的！",
        "\t[谶祖,E1182]\b[this,6,7]现在，为吾主计划而献出自己的生命吧！",
        "\t[剑祖,E1180]\b[this,6,3]（......小君，你们所面对的.....比你们想象中的还要.....绝...望...。）",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playSound",
            "name": "Attack09.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "Blow4.ogg"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[谶祖]剑祖之躯吗，不错，不错。",
        "\t[谶祖]剑老头啊，剑老头，不知道你那可爱的徒弟......看到被我操纵你尸体的时候会流露出怎样的表情呢！哈哈哈哈哈哈哈哈！！！",
        {
            "type": "setVolume",
            "value": 0,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "floorId": "MT350",
            "remove": true,
            "time": 0
        },
        {
            "type": "changeFloor",
            "floorId": "MT342",
            "loc": [
                6,
                1
            ],
            "direction": "down",
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "insert",
            "loc": [
                0,
                12
            ],
            "floorId": "MT342"
        },
        {
            "type": "playBgm",
            "name": "battle24.mp3"
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,1179,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,70132,70133,  0,  0,  0,70134,70135,  0,  0,  0],
    [  0,  0,  0,70140,70141,  0,  0,  0,70142,70143,  0,  0,  0],
    [  0,  0,  0,70148,70149,  0,  0,  0,70150,70151,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20070,20071,  0,  0,  0,20068,20069,  0,  0,  0],
    [  0,  0,  0,20078,20079,  0,  0,  0,20076,20077,  0,  0,  0],
    [  0,  0,  0,20086,20087,  0,  0,  0,20084,20085,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20070,20071,  0,  0,  0,20068,20069,  0,  0,  0],
    [  0,  0,  0,20078,20079,  0,  0,  0,20076,20077,  0,  0,  0],
    [  0,  0,  0,20086,20087,  0,  0,  0,20084,20085,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [70184,70185,70185,70185,70185,70185,70185,70185,70185,70185,70185,70185,70186],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70192,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70193,70194],
    [70200,70201,70201,70201,70201,70201,70201,70201,70201,70201,70201,70201,70202]
],
    "fg2map": [

]
}