main.floors.MT372=
{
    "floorId": "MT372",
    "title": "终焉之城·魔殿第三十层",
    "name": "终焉之城·魔殿第三十层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": true,
    "images": [
        {
            "name": "Sky4.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "blockWall",
    "bgm": null,
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    0
                ]
            ],
            "time": 0
        },
        {
            "type": "pauseBgm"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,8": [
            {
                "type": "pauseBgm"
            },
            {
                "type": "playBgm",
                "name": "disorder7.mp3",
                "keep": true
            },
            "\t[谶祖,E1182]\b[down,6,2]你们很不错，能够击败被我创造的黑暗引路人所加持下的黯夜生物，看来你们的确有资格得知更多的真相！",
            "\t[谶祖,E1182]\b[down,6,2]作为奖励，我可以免费告诉你们一个真相，不过这个问题得是你们提。",
            "\t[谶祖,E1182]\b[down,6,2]尽管提问吧，不过我可不希望等太久。",
            "\t[小粽,hero]\b[hero].............星天前辈。",
            "\t[君无天,N1195]\b[hero,3].......啊，我知道。就让我来说吧！",
            "\t[谶祖,E1182]\b[down,6,2]嗯.......的确如我预想的那般是你提问，毕竟你的资质相对于他们来说高出不少。",
            "\t[谶祖,E1182]\b[down,6,2]说出的你所要我解答的问题吧。",
            "\t[君无天,N1195]\b[hero,3]..........你所做的一切其真实目的是什么？",
            "\t[谶祖,E1182]\b[down,6,2]不错的问题.......容我思考一会。",
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    2
                ]
            },
            "\t[谶祖,E1182]\b[down,6,2]我的目的是将你们带到这里，让你们与我在此闲聊。",
            "\t[君无天,N1195]\b[hero,3]............你是认为我们只是一些乳臭未干的小鬼才这么敷衍的回答我们的吗？",
            "\t[谶祖,E1182]\b[down,6,2]非也，非也，这的确是我所要的目的：将你们带到这里。",
            "\t[君无天,N1195]\b[hero,3]然后将我们解决于此？如果真是这样的话早在二十层的时候你就可以那么去做了。",
            "\t[谶祖,E1182]\b[down,6,2]嗯，的确如你所言，早在二十层的时候我就可以那么去做了，但是为什么我不在那个时刻杀死你们呢？",
            "\t[君无天,N1195]\b[hero,3]..................",
            "\t[小粽,hero]\b[hero]..................",
            "\t[谶祖,E1182]\b[down,6,2]提线木偶，会遵循操作者的意志做出相应操作者所要求的动作，操作者的手法越娴熟，越清晰，提线木偶就能做出更加灵活与流畅的动作。",
            "\t[谶祖,E1182]\b[down,6,2]但是呢，如果操作者所需的要求对于提线木偶来说太过苛刻的话，则会物极则反，会取得不好的表演效果，甚至会导致整个木偶随之散架。",
            "\t[谶祖,E1182]\b[down,6,2]我将你们带到这个被我用独特领域所控制的空间，让你们感受周围环境的不安与压抑，是我之前你们所对我提问题的回答。",
            "\t[谶祖,E1182]\b[down,6,2]而我现在的目的——",
            {
                "type": "setVolume",
                "value": 0,
                "time": 500
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setVolume",
                "value": 90,
                "time": 500
            },
            {
                "type": "playBgm",
                "name": "disorder8.mp3",
                "keep": true
            },
            "\t[谶祖,E1182]\b[down,6,2]\r[red]就是要测试一下你们这些“提线木偶”究竟有多少潜力！",
            {
                "type": "playSound",
                "name": "Zombie02.wav"
            },
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            "\t[谶祖,E1182]\b[down,6,2]任何生灵都会拥有“情感”这个因素，无论是弱小，还是伟大，都会有七情六欲。",
            "\t[谶祖,E1182]\b[down,6,2]正是因为拥有“情感”，这世间才会拥有各种可歌可泣的故事。也正是因为拥有“情感”，才会导致各种悲剧的出现！",
            "\t[谶祖,E1182]\b[down,6,2]\r[red]而今天要给给你们灌输的情感是“愤怒”与“绝望”！",
            "\t[君无天,N1195]\b[hero,3]看来我们一开始就没有什么可谈的！",
            "\t[君无天,N1195]\b[hero,3]小粽，星钰，罗天！做好战斗准备！！",
            "\t[谶祖,E1182]\b[down,6,2]我之前说过，遵循我的人我会给予奖赏，而违犯我的人则赐予——\r[red]绝望！",
            "\t[君无天,N1195]\b[hero,3]多说无益！！",
            "\t[谶祖,E1182]\b[down,6,2]很好，希望君无天你不要后悔！！",
            "【警告】接下来进入特殊boss战模式，谶祖必须连续击败八次才能战胜。请做好准备！",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ],
        "0,0": [
            "\t[谶祖,E1182]\b[down,6,2]八个傀儡！这是我最强的形态！！在这种形态下！莫说是仙月！就算是魔王也要让我三分！！",
            "\t[谶祖,E1182]\b[down,6,2]感受绝望吧！蝼蚁们！！",
            {
                "type": "setVolume",
                "value": 0,
                "time": 500
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setVolume",
                "value": 90,
                "time": 0
            },
            {
                "type": "playBgm",
                "name": "hope1.mp3",
                "keep": true
            },
            "\t[小粽,hero]\b[hero]\\d...........希望孕育绝望，并使其生根发芽。",
            "\t[谶祖,E1182]\b[down,6,2]你在说什么呢！去死吧！！",
            "\t[小粽,hero]\b[hero]\\d但绝望也能够孕育希望！从失落绝望之中！寻找那终结一切绝望的希望！！",
            "\t[小粽,hero]\b[hero]\\d这一次！将会终结这一切的一切！",
            "\t[小粽,hero]\b[hero]\\d大家！将所有的力量汇集于我吧！",
            "\t[小粽,hero]\b[hero]\\d天道！永辉！",
            "\t[谶祖,E1182]\b[down,6,2]这！这是什么？！",
            {
                "type": "setCurtain",
                "color": [
                    255,
                    255,
                    255,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "playSound",
                "name": "051-Explosion04.ogg"
            },
            {
                "type": "battle",
                "id": "E1182"
            },
            "\t[谶祖,E1182]\b[down,6,2]啊！！！",
            {
                "type": "setVolume",
                "value": 0,
                "time": 500
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setVolume",
                "value": 90,
                "time": 0
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[小粽,hero]\b[hero]..............",
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            "\t[小粽,hero]\b[hero]呃！",
            "\t[小粽,hero]\b[hero]（我刚才.....怎么了.....而且....）",
            "\t[小粽,hero]\b[hero]（.....大家...怎么虚弱到连话都说不出了。）",
            "\t[谶祖,E1182]\b[down,6,2]........................",
            "\t[谶祖,E1182]\b[down,6,2]........................咳咳咳！！",
            "\t[小粽,hero]\b[hero]你....居然...还没有死！",
            "\t[谶祖,E1182]\b[down,6,2]............了不起，居然能够打败八个傀儡加持的我。",
            "\t[小粽,hero]\b[hero]你与傀儡之间的联系已经被我切断了！你已经输了！！",
            "\t[谶祖,E1182]\b[down,6,2]哦？是吗！",
            {
                "type": "playBgm",
                "name": "disorder9.mp3",
                "keep": true
            },
            "随着谶祖话语的下落，那八个傀儡居然重新开始活动起来！！",
            "\t[小粽,hero]\b[hero]这！怎么会这样！！！",
            "\t[谶祖,E1182]\b[down,6,2]我说过！作为魔塔世界最古老的生物，本座的纵横捭阖岂是你们这些小鬼所能领悟的呢！！",
            "\t[谶祖,E1182]\b[down,6,2]好了，傀儡的控制权已经被我取回了，那你们做好绝望的准备了吗！",
            "\t[小粽,hero]\b[hero]..........这如同鬼神一般的人物.....我们该如何是好.....。",
            "\t[小粽,hero]\b[hero]但即使是这样！我也必须保护好他们！因为——",
            "\t[小粽,hero]\b[hero]这是我与生俱来的使命！！",
            "\t[谶祖,E1182]\b[down,6,2]洛兰，星天，剑祖，母亲阁下，就请你们解决掉他们吧！",
            "\t[洛兰/星天/剑祖]是！",
            "\t[小粽,hero]\b[hero]该死！",
            "\t[星钰,N1196]\b[hero,2]父亲大人！我们....该怎么办.....",
            "\t[君无天,N1195]\b[hero,3].................",
            "\t[罗天,N1197]\b[hero,1].................洛兰，我们之间....还是如此吗....。",
            "\t[谶祖,E1182]\b[down,6,2]没错！就是这种表情，就让我看看你们有多绝——",
            {
                "type": "playBgm",
                "name": "GG3.mp3",
                "keep": true
            },
            "\t[？？？]逆反者，必诛之！",
            "\t[谶祖,E1182]\b[down,6,2]谁！是谁？！",
            {
                "type": "animate",
                "name": "attack9",
                "loc": [
                    6,
                    2
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "Attack09.wav"
            },
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            {
                "type": "sleep",
                "time": 200
            },
            {
                "type": "playSound",
                "name": "Blow4.ogg"
            },
            {
                "type": "sleep",
                "time": 200
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    2
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    4
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    5
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[谶祖,E1182]\b[down,6,2]噗！！！",
            {
                "type": "playSound",
                "name": "115-Raise01.ogg"
            },
            {
                "type": "animate",
                "name": "attack20",
                "loc": [
                    7,
                    2
                ]
            },
            {
                "type": "setBlock",
                "number": "E1217",
                "loc": [
                    [
                        7,
                        2
                    ]
                ],
                "time": 0
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    2
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    4
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    5
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[谶祖,E1182]\b[down,6,2]是你！“梦”？！",
            "\t[谶祖,E1182]\b[down,6,2]不可能！就凭你怎么可能伤害的了我！！",
            "\t[梦,E1217]\b[down,7,2]是吗？",
            {
                "type": "callBook"
            },
            "\t[谶祖,E1182]\b[down,6,2]什么！这怎么可能！！",
            "\t[谶祖,E1182]\b[down,6,2]你的实力怎么可能在怎么短时间内提升如此迅速！！",
            "\t[梦,E1217]\b[down,7,2]我没有回答你的义务，我只知道你是对于魔王大人来说必须要消灭的存在。",
            "\t[谶祖,E1182]\b[down,6,2]笑话！我怎么可能会败给你这个小娃儿手中！！全部给我拦住她！！！",
            "\t[梦,E1217]\b[down,7,2]这些早已逝去之人，不应该被你继续玩弄！",
            "\t[梦,E1217]\b[down,7,2]就让我让他们的灵魂得以安息吧！",
            "梦向天空挥出自己的玉手，所有傀儡的身躯逐渐消融了......。",
            {
                "type": "hide",
                "loc": [
                    [
                        10,
                        6
                    ]
                ],
                "remove": true,
                "time": 500,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        2,
                        6
                    ]
                ],
                "remove": true,
                "time": 500,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        12,
                        4
                    ]
                ],
                "remove": true,
                "time": 500,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        0,
                        4
                    ]
                ],
                "remove": true,
                "time": 500,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        11,
                        2
                    ]
                ],
                "remove": true,
                "time": 500,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        2
                    ]
                ],
                "remove": true,
                "time": 500,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        9,
                        1
                    ]
                ],
                "remove": true,
                "time": 500,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        3,
                        1
                    ]
                ],
                "remove": true,
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    2
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    4
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    5
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    6
                ]
            },
            "\t[谶祖,E1182]\b[down,6,2]什么！！！开什么玩笑！！这怎么可能！！",
            "\t[谶祖,E1182]\b[down,6,2]\r[red]怎么可能！！",
            "\t[梦,E1217]\b[down,7,2]....他们的灵魂已经得到安息了，至于你......。",
            "\t[谶祖,E1182]\b[down,6,2]......难道说！你就是吾主所说的神——",
            "\t[梦,E1217]\b[down,7,2]永别了！",
            "梦的玉手点触了谶祖的身躯，并随之带来的是谶祖身体上的消亡！",
            "\t[谶祖,E1182]\b[down,6,2]不！！！！！！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        2
                    ]
                ],
                "remove": true,
                "time": 500
            },
            "三圣之巅上一任阁主谶祖，魔塔世界最古老的存在，所有悲剧发生的源头，而今天他为他之前的所作所为付出了死亡的代价！",
            "曾经的纵横捭阖，唯我独尊，却在今天棋差一着....结束了他罪恶的一生。",
            "\r[red]三圣之巅上一任阁主谶祖——陨！",
            "\t[梦,E1217]\b[down,7,2]结束了。",
            {
                "type": "setBlock",
                "number": "E1216",
                "loc": [
                    [
                        7,
                        2
                    ]
                ],
                "time": 0
            },
            "\t[梦,E1216]\b[down,7,2]...................",
            "\t[小粽,hero]\b[hero]...................",
            "\t[星钰,N1196]\b[hero,2]...................",
            "\t[君无天,N1195]\b[hero,3]...................",
            "\t[罗天,N1197]\b[hero,1]...................梦。",
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unexpected2",
                "loc": [
                    7,
                    2
                ]
            },
            "\t[梦,E1216]\b[down,7,2]是你呀，罗天。",
            "\t[梦,E1216]\b[down,7,2]................你不应该来这里的。",
            "\t[罗天,N1197]\b[hero,3]我不得不来。",
            "\t[梦,E1216]\b[down,7,2]值得吗？",
            "\t[罗天,N1197]\b[hero,3]...................至少，我还能再看她最后一眼，虽然这种方式很令人痛苦。",
            "\t[梦,E1216]\b[down,7,2]...............她很美，并且我能从你眼神中看出你对她思念。",
            "\t[罗天,N1197]\b[hero,3]谢谢你，能够让她的灵魂得以安息。",
            "\t[梦,E1216]\b[down,7,2]我之前说过，不要对我说谢谢，把我当做你的好朋友就好了。",
            "\t[罗天,N1197]\b[hero,3]..................你这次前来不仅是要对付谶祖，更是要对付我们吧。",
            "\t[梦,E1216]\b[down,7,2]..................嗯。",
            "\t[罗天,N1197]\b[hero,3]他们也是我的朋友，我是不会允许你伤害他们的。",
            "\t[梦,E1216]\b[down,7,2]你要知道，你是阻止不了我的。",
            "\t[罗天,N1197]\b[hero,3]那就用我这条命来阻止你！！",
            "\t[梦,E1216]\b[down,7,2]................",
            "\t[梦,E1216]\b[down,7,2]................看着你的面子上，我可以给他们一次机会。",
            "\t[梦,E1216]\b[down,7,2]你们可以选择离去，也可以继续前进。",
            "\t[梦,E1216]\b[down,7,2]不过如果是后者，我会在魔殿的尽头结束这一切，到时就算是你也不行！",
            "\t[罗天,N1197]\b[hero,3]................",
            "\t[梦,E1216]\b[down,7,2]好好思考吧！",
            {
                "type": "playSound",
                "name": "115-Raise01.ogg"
            },
            {
                "type": "animate",
                "name": "attack20",
                "loc": [
                    7,
                    2
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        2
                    ]
                ],
                "remove": true
            },
            "\t[罗天,N1197]\b[hero,3]................",
            "\t[罗天,N1197]\b[hero,3]......................",
            "\t[罗天,N1197]\b[hero,3]......................对不起，我们必须前进。",
            "\t[小粽,hero]\b[hero]......................罗天。",
            "\t[罗天,N1197]\b[hero,3]啊...我没事。",
            "\t[君无天,N1195]\b[hero,3]那个“梦”不知道是什么原因，居然比谶祖还要强大，有可能就是与造神计划有关。",
            "\t[罗天,N1197]\b[hero,1].....嗯，我们...毕竟...没有其他的选择了，就算离去魔王会放过我们吗？",
            "\t[君无天,N1195]\b[hero,3]................",
            "\t[罗天,N1197]\b[hero,1]小粽，星钰，星天前辈，让我们继续前进吧。",
            "\t[小粽,hero]\b[hero]........嗯。",
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        0
                    ]
                ],
                "time": 500
            },
            {
                "type": "waitAsync"
            }
        ],
        "6,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                {
                    "type": "if",
                    "condition": "(flag:boss371F===8)",
                    "true": [
                        {
                            "type": "sleep",
                            "time": 500
                        },
                        {
                            "type": "playSound",
                            "name": "cgefc01.wav"
                        },
                        {
                            "type": "animate",
                            "name": "unexpected1",
                            "loc": "hero"
                        },
                        "\t[小粽,hero]\b[hero]\r[red]母亲？！！！！！！！！！",
                        "\t[小粽,hero]\b[hero]\r[red]这！不！可！能！！",
                        "\t[谶祖,E1182]\b[down,6,2]小粽，是母亲的养子，而母亲身份是神之祭品，在八年前被圣羽洛斯所杀，不过由于神之祭品的力量太过强大，导致圣羽洛斯只采取了部分灵魂带给了魔王。",
                        "\t[谶祖,E1182]\b[down,6,2]所以这最后提线木偶并不会像刚才那三个一样会对你们说话。因为在她这个身躯的灵魂早已离去！",
                        "\t[谶祖,E1182]\b[down,6,2]如何？小粽，作为这个世界的主角，我想....这份大礼你应该满意吧！",
                        "\t[小粽,hero]\b[hero]\r[red]不！可！能！！这！不可能！！",
                        "\t[小粽,hero]\b[hero]\r[red]这座高塔的传送魔法阵是由魔王所搭建的！明明只有魔王才能离开魔塔！前往人类世界！你是怎么做到的！！",
                        "\t[小粽,hero]\b[hero]\r[red]而你又是怎么知道我把母亲埋葬在花园里的！！",
                        "\t[谶祖,E1182]\b[down,6,2]呵，当年剑祖都可以将自己的女儿送往人类世界，那我又为什么不行呢！",
                        "\t[谶祖,E1182]\b[down,6,2]即使在这数年间魔王加固了传送门，而我又怎么会没有办法偷渡呢！！",
                        "\t[谶祖,E1182]\b[down,6,2]至于你问我为什么会知道你母亲的埋葬地，那是因为——",
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]从你进入这座高塔开始！我就得知你是神之勇者，并且随着你旅途的深入，让我更加坚定了我的看法！！",
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]你们的每一次的战斗我都看在眼里，你们每一次对他人所流露出的“情感”我都看在眼里！",
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]正是因为洛兰与罗天之间的爱，才会有在生死离别之刻双方对伊人之爱表现的是那么淋漓尽致！",
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]正是因为星钰即使对自己的杀父仇人君无天时，却还愿意喊出“父亲大人”的时候，才会有那种对君无天那近乎盲目般的自信与听从！",
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]正是因为君无天与星天那莫逆之交的兄弟情义，才会有在星天家族存亡之际双方二人那演绎最后剑之巅的不朽传说！",
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]正是因为母亲对小粽那无微不至的关爱与呵护，才会让你拥有探寻这一切真相的勇气！！",
                        {
                            "type": "vibrate",
                            "time": 500
                        },
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]而我要做的就是——",
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]给你们灌输所有的“情感”，并且将其归为一体！！成为我那最成功的提线木偶！！",
                        {
                            "type": "playSound",
                            "name": "049-Explosion02.ogg"
                        },
                        "\t[谶祖,E1182]\b[down,6,2]\r[red]来吧.....迈动你们的双腿，看看你们究竟能做到哪里！！",
                        {
                            "type": "insert",
                            "loc": [
                                0,
                                0
                            ]
                        }
                    ],
                    "false": [
                        {
                            "type": "if",
                            "condition": "(flag:boss371F===7)",
                            "true": [
                                "\t[剑祖,E1208]\b[this,9,1]小君，这一招，可不是你这样使的！",
                                "\t[君无天,N1195]\b[hero,3]师！师父！！！",
                                "\t[谶祖,E1182]\b[down,6,2]剑祖，星天与君无天的师父。几十年前魔塔四大绝世天才之一，生命之使仙月的丈夫，不过当初因为我导致他摔入悬崖，并给予了一生都难以修复的伤势。",
                                "\t[谶祖,E1182]\b[down,6,2]至于为什么剑祖是星天和君无天的师父呢，那是因为当初他们二人在悬崖底探险的时候发现了奄奄一息的剑祖，出于好心他们救助剑祖。",
                                "\t[谶祖,E1182]\b[down,6,2]等到剑祖苏醒过来，不仅一边治疗伤势，一边教他们剑法。",
                                "\t[谶祖,E1182]\b[down,6,2]就是这么简单的故事。",
                                "\t[君无天,N1195]\b[hero,3]...........你究竟是谁！为什么会知道这种消息！而且师父又怎么会！！",
                                "\t[谶祖,E1182]\b[down,6,2]我之前说过，我为谶祖，谶语之主，你们所有的秘密在本座看来都不是秘密。至于你的师父么......。",
                                "\t[谶祖,E1182]\b[down,6,2]其实，你师父之所以一直居住在剑坛而不离开，是因为——",
                                "\t[谶祖,E1182]\b[down,6,2]\r[red]他要阻止我当初给他控制的思想啊！",
                                "\t[君无天,N1195]\b[hero,3]什么？",
                                "\t[谶祖,E1182]\b[down,6,2]你还记得你最后与你师父见面的那一刻吗？",
                                {
                                    "type": "playSound",
                                    "name": "cgefc01.wav"
                                },
                                {
                                    "type": "animate",
                                    "name": "unexpected1",
                                    "loc": [
                                        6,
                                        6
                                    ]
                                },
                                "\t[君无天,N1195]\b[hero,3]你难道说！！",
                                "\t[谶祖,E1182]\b[down,6,2]没错，就是因为我已经悄无声息的控制了他的部分思想，他才没有对你说有关谶祖的事情。",
                                "\t[谶祖,E1182]\b[down,6,2]可怜的剑祖啊，他本以为他可以凭他一己之力就可以阻止我。殊不知他这样做只是慢性死亡而已！",
                                "\t[谶祖,E1182]\b[down,6,2]身体隐藏旧伤而不去找仙月治疗，反而是想阻止我控制思想避免去伤害仙月，从而导致自己实力越来越弱，最后如同蝼蚁一般脆弱！",
                                "\t[谶祖,E1182]\b[down,6,2]\r[red]而我，也正是在那一刻，杀了他！",
                                {
                                    "type": "playSound",
                                    "name": "049-Explosion02.ogg"
                                },
                                "\t[谶祖,E1182]\b[down,6,2]怎么样，这个真相你得知的满意不？",
                                "\t[君无天,N1195]\b[hero,3].................",
                                "\t[君无天,N1195]\b[hero,3].......................",
                                "\t[君无天,N1195]\b[hero,3]...........................师父....。",
                                "\t[君无天,N1195]\b[hero,3]你的意志，我会继续为你传递下去的！",
                                "\t[君无天,N1195]\b[hero,3]\r[red]小粽！星钰！罗天！打起精神来！！让我们施展全身尽数杀死这个畜生！！",
                                "\t[谶祖,E1182]\b[down,6,2]哦？君无天，你又一次让我给惊艳到了啊，居然不像其他人一样愤怒甚至是绝望，反而是将他们从负面情感中拉了出来，真是......。",
                                "\t[谶祖,E1182]\b[down,6,2]\r[red]太有意思了！",
                                "\t[谶祖,E1182]\b[down,6,2]\r[red]来吧！既然你可以将绝望变成希望，那本座也可以将你们的希望变成绝望！",
                                {
                                    "type": "battle",
                                    "id": "E1182"
                                },
                                {
                                    "type": "setValue",
                                    "name": "flag:boss371F",
                                    "value": "8"
                                },
                                "\t[众人]\r[red]噗！！",
                                "\t[谶祖,E1182]\b[down,6,2]哦？没想到拥有七个傀儡加持的我都无法击败你们，看到你们这些提线木偶的潜力比我想象中的还要大！",
                                "\t[谶祖,E1182]\b[down,6,2]不过！也就止步于此了！！",
                                "\t[小粽,hero]\b[hero]我们....绝对不会！向你屈服的！！",
                                "\t[谶祖,E1182]\b[down,6,2]小粽，你作为神之勇者，这个世界最重要的人物，我怎么可能会忘记给你得知真相呢！",
                                "\t[小粽,hero]\b[hero]你...........！",
                                "\t[谶祖,E1182]\b[down,6,2]\r[red]那么！出来吧！最后一位！！",
                                {
                                    "type": "playSound",
                                    "name": "139-Darkness02.ogg"
                                },
                                {
                                    "type": "animate",
                                    "name": "attack18",
                                    "loc": [
                                        3,
                                        1
                                    ],
                                    "async": true
                                },
                                {
                                    "type": "setBlock",
                                    "number": "E1209",
                                    "loc": [
                                        [
                                            3,
                                            1
                                        ]
                                    ],
                                    "time": 0
                                },
                                "谶祖召唤出与母亲无异的傀儡，并且在傀儡的加持下，谶祖获得净化技能,并且属性得以提升！！！",
                                {
                                    "type": "setEnemy",
                                    "id": "E1182",
                                    "name": "special",
                                    "value": "[39,2,7,8,9]"
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "E1182",
                                    "name": "hp",
                                    "value": "85000000000000000"
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "E1182",
                                    "name": "atk",
                                    "value": "24000000000000000"
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "E1182",
                                    "name": "def",
                                    "value": "3000000000000000"
                                },
                                {
                                    "type": "update"
                                }
                            ],
                            "false": [
                                {
                                    "type": "if",
                                    "condition": "(flag:boss371F===6)",
                                    "true": [
                                        "\t[谶祖,E1182]\b[down,6,2]很好！非常好！！就是这样！！让我看看你究竟能够走到哪一步！！",
                                        "\t[君无天,N1195]\b[hero,3].......星钰，你退下。让我来解决这一切！",
                                        "\t[星钰,N1196]\b[hero,2]...............是......。",
                                        "\t[君无天,N1195]\b[hero,3]小粽，罗天，掩护我！",
                                        "\t[小粽/罗天]嗯！",
                                        "\t[谶祖,E1182]\b[down,6,2]哦？君阁主，你还有底牌吗？",
                                        "\t[君无天,N1195]\b[hero,3].....星天兄弟，我将再一次用这一招...结束这一切！！",
                                        "\t[谶祖,E1182]\b[down,6,2]哦？来吧，让我看看你究竟有什么底牌。",
                                        "\t[君无天,N1195]\b[hero,3]\r[red]...........浪血！千仞斩！!",
                                        "\t[？？？]策天泛海！",
                                        {
                                            "type": "playSound",
                                            "name": "cgefc01.wav"
                                        },
                                        {
                                            "type": "animate",
                                            "name": "unexpected1",
                                            "loc": [
                                                6,
                                                6
                                            ]
                                        },
                                        "\t[君无天,N1195]\b[hero,3]什么！这招是！！",
                                        {
                                            "type": "playSound",
                                            "name": "cgefc01.wav"
                                        },
                                        {
                                            "type": "animate",
                                            "name": "attack11",
                                            "loc": [
                                                6,
                                                6
                                            ],
                                            "async": true
                                        },
                                        {
                                            "type": "playSound",
                                            "name": "cgefc01.wav"
                                        },
                                        {
                                            "type": "animate",
                                            "name": "unexpected1",
                                            "loc": "hero",
                                            "async": true
                                        },
                                        {
                                            "type": "playSound",
                                            "name": "cgefc01.wav"
                                        },
                                        {
                                            "type": "animate",
                                            "name": "unexpected1",
                                            "loc": [
                                                6,
                                                4
                                            ],
                                            "async": true
                                        },
                                        {
                                            "type": "playSound",
                                            "name": "cgefc01.wav"
                                        },
                                        {
                                            "type": "animate",
                                            "name": "unexpected1",
                                            "loc": [
                                                6,
                                                5
                                            ]
                                        },
                                        "\t[君无天,N1195]\b[hero,3]\r[red]噗！！",
                                        "\t[小粽/罗天]星天前辈！！",
                                        "\t[星钰,N1196]\b[hero,2]父亲大人！！",
                                        "\t[君无天,N1195]\b[hero,3]能够用这一招完美破除浪血千仞斩！难道说！！....不！这不可能！！",
                                        "\t[谶祖,E1182]\b[down,6,2]君无天，有什么不可能的。只是第七位等不及了而已，何必如此大惊小怪。",
                                        "\t[谶祖,E1182]\b[down,6,2]\r[red]那么出来吧！",
                                        "\t[谶祖,E1182]\b[down,6,2]\r[red]第七位！剑祖！！",
                                        {
                                            "type": "playSound",
                                            "name": "139-Darkness02.ogg"
                                        },
                                        {
                                            "type": "animate",
                                            "name": "attack18",
                                            "loc": [
                                                9,
                                                1
                                            ],
                                            "async": true
                                        },
                                        {
                                            "type": "setBlock",
                                            "number": "E1208",
                                            "loc": [
                                                [
                                                    9,
                                                    1
                                                ]
                                            ],
                                            "time": 0
                                        },
                                        "谶祖召唤出与剑祖无异的傀儡，并且在傀儡的加持下，,谶祖的属性大幅度提升！！！！！",
                                        {
                                            "type": "setEnemy",
                                            "id": "E1182",
                                            "name": "special",
                                            "value": "[39,2,7,8]"
                                        },
                                        {
                                            "type": "setEnemy",
                                            "id": "E1182",
                                            "name": "hp",
                                            "value": "80000000000000000"
                                        },
                                        {
                                            "type": "setEnemy",
                                            "id": "E1182",
                                            "name": "atk",
                                            "value": "22000000000000000"
                                        },
                                        {
                                            "type": "setEnemy",
                                            "id": "E1182",
                                            "name": "def",
                                            "value": "3000000000000000"
                                        },
                                        {
                                            "type": "update"
                                        },
                                        {
                                            "type": "setValue",
                                            "name": "flag:boss371F",
                                            "value": "7"
                                        },
                                        {
                                            "type": "waitAsync"
                                        }
                                    ],
                                    "false": [
                                        {
                                            "type": "if",
                                            "condition": "(flag:boss371F===5)",
                                            "true": [
                                                "\t[君无天,N1195]\b[hero,3]果然.....星天兄弟，你也被这个畜生给玩弄了身体与灵魂了。",
                                                "\t[君无天,N1195]\b[hero,3].......星钰，这个人，就是你的亲生父亲。",
                                                "\t[星钰,N1196]\b[hero,2].............亲生父亲........。",
                                                "\t[谶祖,E1182]\b[down,6,2]星天，剑祖之徒，十几年前魔塔世界第一家族族长，其家族主修科技力量。",
                                                "\t[谶祖,E1182]\b[down,6,2]但是其族长却是个既修炼科学，又修炼武修的绝世天才！",
                                                "\t[谶祖,E1182]\b[down,6,2]这种绝世天才的资质，哪怕是我们也远远不及，只可惜在十几年前死于君无天之手。从而导致了整个星家的灭亡。",
                                                "\t[谶祖,E1182]\b[down,6,2]为了得知这个情报，我可是花了不少功夫。",
                                                "\t[君无天,N1195]\b[hero,3]................",
                                                "\t[谶祖,E1182]\b[down,6,2]星天，跟你的好兄弟和女儿问候几句吧。",
                                                "\t[星天,E1207]\b[down,1,2]兄弟，没想到你已经走的这么远了呢，看来你已经领悟到当初师父对我们说的真正剑之巅了！",
                                                "\t[星天,E1207]\b[down,1,2]还有星钰，没想到你已经长这么大了呢，真是太好了。",
                                                "然而星钰听到父亲的夸奖之后并不是流露出高兴的表情，而是如同珍珠般晶莹的泪水从眼角划过。",
                                                "\t[星钰,N1196]\b[hero,2]......爸.....爸.....。",
                                                "\t[君无天,N1195]\b[hero,3]................星天兄弟，我想过我们会有一天再见的.....",
                                                "\t[君无天,N1195]\b[hero,3]\r[red]但！不是现在！！",
                                                "\t[君无天,N1195]\b[hero,3]\r[red]受死吧！谶祖！！龙啸九天决！！",
                                                "\t[谶祖,E1182]\b[down,6,2]来的好！就让我看看愤怒形态下的你会给我带来怎样的惊喜！！",
                                                {
                                                    "type": "battle",
                                                    "id": "E1182"
                                                },
                                                {
                                                    "type": "setValue",
                                                    "name": "flag:boss371F",
                                                    "value": "6"
                                                }
                                            ],
                                            "false": [
                                                {
                                                    "type": "if",
                                                    "condition": "(flag:boss371F===4)",
                                                    "true": [
                                                        {
                                                            "type": "playSound",
                                                            "name": "cgefc01.wav"
                                                        },
                                                        {
                                                            "type": "animate",
                                                            "name": "unexpected1",
                                                            "loc": [
                                                                6,
                                                                4
                                                            ]
                                                        },
                                                        "\t[罗天,N1197]\b[hero,1]洛！洛兰？！！！",
                                                        "\t[谶祖,E1182]\b[down,6,2]洛兰，四星尊天音律星尊未婚妻，精通火元素魔法，并且其实力并不逊色于圣护之手·闇。",
                                                        "\t[谶祖,E1182]\b[down,6,2]在八年前被圣羽洛斯带走操纵了意志，并在六年前被圣羽洛斯安排去杀死罗天，不过由于“情感”的因素，导致洗脑术暂时失效，最后死于自杀。",
                                                        "\t[谶祖,E1182]\b[down,6,2]在那之后苏醒的罗天将洛兰安葬在音律塔顶层，每天用委婉的音律来追念爱妻。",
                                                        "\t[罗天,N1197]\b[hero,1]你！你怎么可能会知道这些！！而洛兰！！",
                                                        "\t[谶祖,E1182]\b[down,6,2]身为魔塔世界最古老的生物，我的阅历是你们无法想象的，你们的每一个秘密在本座面前都不算是秘密。",
                                                        "\t[谶祖,E1182]\b[down,6,2]就算是魔王，他的阅历也远远不及于我！",
                                                        "\t[谶祖,E1182]\b[down,6,2]好了，洛兰，你是不是应该对你丈夫问候几句呢？",
                                                        {
                                                            "type": "sleep",
                                                            "time": 500
                                                        },
                                                        "\t[洛兰,E1206]\b[down,11,2]好久不见，罗天，没想到我们竟然能以这种方式再一次见面呢。",
                                                        {
                                                            "type": "playSound",
                                                            "name": "049-Explosion02.ogg"
                                                        },
                                                        {
                                                            "type": "playSound",
                                                            "name": "cgefc01.wav"
                                                        },
                                                        {
                                                            "type": "animate",
                                                            "name": "unexpected1",
                                                            "loc": [
                                                                6,
                                                                4
                                                            ]
                                                        },
                                                        "眼前的少女虽然外貌并没有什么变化，但是她对罗天说的话语却没有蕴含任何情感，就像提线木偶那般。",
                                                        "\t[罗天,N1197]\b[hero,1]哈.....哈......这.......这.......不......。",
                                                        "\t[谶祖,E1182]\b[down,6,2]罗天，你这是什么表情，你的妻子都回来了，你难道不感到高兴吗？",
                                                        "\t[罗天,N1197]\b[hero,1]高兴......高兴.....你...这个...玩弄.....洛兰身体与灵魂的人......",
                                                        "\t[罗天,N1197]\b[hero,1]\r[red]我要将你千刀万剐！！！！",
                                                        "\t[小粽,hero]\b[hero]罗天！不要冲动！！",
                                                        "\t[谶祖,E1182]\b[down,6,2]没错，愤怒吧！就是这样！快杀死你眼前这个玩弄洛兰的畜生吧！！",
                                                        {
                                                            "type": "battle",
                                                            "id": "E1182"
                                                        },
                                                        {
                                                            "type": "setValue",
                                                            "name": "flag:boss371F",
                                                            "value": "5"
                                                        },
                                                        "\t[罗天,N1197]\b[hero,1]\r[red]噗！！",
                                                        "\t[众人]罗天！！",
                                                        "\t[谶祖,E1182]\b[down,6,2]可惜，即使你全部施展你的能力，你也无法杀死我。",
                                                        "\t[罗天,N1197]\b[hero,1]\r[red]闭！嘴！",
                                                        "\t[星钰,N1196]\b[hero,2]罗天！冷静下来！不要中了谶祖的圈套，他是故意这样激怒你的！！",
                                                        "\t[罗天,N1197]\b[hero,1]\r[red]................我.....。",
                                                        "\t[君无天,N1195]\b[hero,3]罗天，记住，你不是一个人在战斗，让我们一起杀死这个畜生，让洛兰灵魂得以安息。",
                                                        "\t[罗天,N1197]\b[hero,1].................",
                                                        "\t[谶祖,E1182]\b[down,6,2]哦？为什么要冷静呢，这可不是我对你们这些提线木偶所要求的指令啊！",
                                                        "\t[谶祖,E1182]\b[down,6,2]君无天，星钰，接下来要登场的人物可是个绝世天才啊！",
                                                        "\t[星钰,N1196]\b[hero,2].................。",
                                                        "\t[君无天,N1195]\b[hero,3]................来吧！",
                                                        "\t[谶祖,E1182]\b[down,6,2]好！不愧是君阁主，即使处于这种环境下你还能保持自若，不过....不知道你的这份理智能保持多久呢！",
                                                        "\t[谶祖,E1182]\b[down,6,2]\r[red]第六位！星天！！",
                                                        {
                                                            "type": "playSound",
                                                            "name": "139-Darkness02.ogg"
                                                        },
                                                        {
                                                            "type": "animate",
                                                            "name": "attack18",
                                                            "loc": [
                                                                1,
                                                                2
                                                            ],
                                                            "async": true
                                                        },
                                                        {
                                                            "type": "setBlock",
                                                            "number": "E1207",
                                                            "loc": [
                                                                [
                                                                    1,
                                                                    2
                                                                ]
                                                            ],
                                                            "time": 0
                                                        },
                                                        "谶祖召唤出与星天无异的傀儡，并且在傀儡的加持下，谶祖获得反击，破甲技能,并且属性得以提升！！！",
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1182",
                                                            "name": "special",
                                                            "value": "[39,2,7,8]"
                                                        },
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1182",
                                                            "name": "hp",
                                                            "value": "80000000000000000"
                                                        },
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1182",
                                                            "name": "atk",
                                                            "value": "10000000000000000"
                                                        },
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1182",
                                                            "name": "def",
                                                            "value": "3000000000000000"
                                                        },
                                                        {
                                                            "type": "update"
                                                        }
                                                    ],
                                                    "false": [
                                                        {
                                                            "type": "if",
                                                            "condition": "(flag:boss371F===3)",
                                                            "true": [
                                                                "\t[谶祖,E1182]\b[down,6,2]圣护之手·闇，十多年前在阴阳圣坛与圣护之手·天齐名的天才，圣羽洛斯忠实的手下，不过因为十多年前逆反魔王大人的意志被“梦”打伤，从此一蹶不振。",
                                                                "\t[谶祖,E1182]\b[down,6,2]并且他被圣羽洛斯派往荒芜的阴之坛作为头目，最后在圣羽洛斯的分部实验室死于剑神星尊——堇之手。",
                                                                "\t[谶祖,E1182]\b[down,6,2]本来本座是想要让圣护之手·天与你们见面的，可惜几个月阳之坛一战，由于他服用了劣质的药剂，导致身体炸裂，死的渣都不剩了，因此我才选用次一级的傀儡。",
                                                                "\t[谶祖,E1182]\b[down,6,2]也就是说必须要有尸体我才能制作傀儡，而像仙琳，黯夜殇，圣羽洛斯这些连灵魂都不存在的人我是无法制作成傀儡的。",
                                                                "\t[小粽,hero]\b[hero]...................。",
                                                                "\t[谶祖,E1182]\b[down,6,2]来吧！拥有四个傀儡加持的我，已经不逊色于当初的剑祖了！",
                                                                {
                                                                    "type": "battle",
                                                                    "id": "E1182"
                                                                },
                                                                {
                                                                    "type": "setValue",
                                                                    "name": "flag:boss371F",
                                                                    "value": "4",
                                                                    "norefresh": true
                                                                },
                                                                "\t[罗天,N1197]\b[hero,1]咳咳咳！！",
                                                                "\t[星钰,N1196]\b[hero,2]罗天！没事吧！",
                                                                "\t[罗天,N1197]\b[hero,1]我还撑得住！",
                                                                {
                                                                    "type": "setVolume",
                                                                    "value": 0,
                                                                    "time": 500
                                                                },
                                                                {
                                                                    "type": "pauseBgm"
                                                                },
                                                                "\t[谶祖,E1182]\b[down,6,2]别这么早就想退场啊，真正的好戏还没上演呢！",
                                                                "\t[谶祖,E1182]\b[down,6,2]罗天啊，罗天啊，接下来要登场的人物可是对你来说至关重要的人物呢，别太让我失望啊！",
                                                                {
                                                                    "type": "playSound",
                                                                    "name": "cgefc01.wav"
                                                                },
                                                                {
                                                                    "type": "animate",
                                                                    "name": "unexpected1",
                                                                    "loc": [
                                                                        6,
                                                                        4
                                                                    ]
                                                                },
                                                                "\t[罗天,N1197]\b[hero,1]......你难道说！！",
                                                                "\t[谶祖,E1182]\b[down,6,2]没错！就是这个表情，就让我现在更加激化这个表情吧！！",
                                                                {
                                                                    "type": "setVolume",
                                                                    "value": 90,
                                                                    "time": 0
                                                                },
                                                                {
                                                                    "type": "playBgm",
                                                                    "name": "disorder9.mp3",
                                                                    "keep": true
                                                                },
                                                                "\t[谶祖,E1182]\b[down,6,2]\r[red]第五位！洛兰！！",
                                                                {
                                                                    "type": "playSound",
                                                                    "name": "139-Darkness02.ogg"
                                                                },
                                                                {
                                                                    "type": "animate",
                                                                    "name": "attack18",
                                                                    "loc": [
                                                                        11,
                                                                        2
                                                                    ],
                                                                    "async": true
                                                                },
                                                                {
                                                                    "type": "setBlock",
                                                                    "number": "E1206",
                                                                    "loc": [
                                                                        [
                                                                            11,
                                                                            2
                                                                        ]
                                                                    ],
                                                                    "time": 0
                                                                },
                                                                "谶祖召唤出与洛兰无异的傀儡，并且在傀儡的加持下，谶祖获得魔攻技能！！！",
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1182",
                                                                    "name": "special",
                                                                    "value": "[39,2]"
                                                                },
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1182",
                                                                    "name": "hp",
                                                                    "value": "80000000000000000"
                                                                },
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1182",
                                                                    "name": "atk",
                                                                    "value": "9000000000000000"
                                                                },
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1182",
                                                                    "name": "def",
                                                                    "value": "2800000000000000"
                                                                },
                                                                {
                                                                    "type": "update"
                                                                }
                                                            ],
                                                            "false": [
                                                                {
                                                                    "type": "if",
                                                                    "condition": "(flag:boss371F===2)",
                                                                    "true": [
                                                                        "\t[罗天/星钰]这是！体魄星尊泰帝？！",
                                                                        "\t[谶祖,E1182]\b[down,6,2]道傀使，剑神星尊派去管辖登天潭径的头目，跟我一样喜欢制造傀儡，不过他的技术在本座看来只是小孩子过家家罢了。",
                                                                        "\t[谶祖,E1182]\b[down,6,2]并且在登天潭径被神之勇者小粽斩杀。",
                                                                        "\t[谶祖,E1182]\b[down,6,2]体魄星尊泰帝，四星尊天四大星尊之一，与剑神，音律，造物星尊同级。拥有极其强大的肉体力量，不过在体之巅也是被小粽斩杀。",
                                                                        "\t[谶祖,E1182]\b[down,6,2]罗天，星钰，你们二人曾经分别是音律星尊与造物星尊，不知道你们看到你们的同事会做何感想呢？",
                                                                        "\t[罗天,N1197]\b[hero,1]泰帝此人虽然十分桀骜不驯，但他其实也只是为了力量才变成这样的，本身并无恶意。",
                                                                        "\t[星钰,N1196]\b[hero,2]对！而你现在不仅挖出了他的尸体，还将他做成了傀儡！",
                                                                        "\t[星钰,N1196]\b[hero,2]就算他曾经要加害于小粽，但他现在早已逝去，你不应该连让他的灵魂都无法安息！",
                                                                        "\t[谶祖,E1182]\b[down,6,2]哦？是吗，如果你想要他的灵魂安息的话就想办法阻止我吧！不过你们是做不到的！",
                                                                        {
                                                                            "type": "battle",
                                                                            "id": "E1182"
                                                                        },
                                                                        {
                                                                            "type": "setValue",
                                                                            "name": "flag:boss371F",
                                                                            "value": "3"
                                                                        },
                                                                        "\t[谶祖,E1182]\b[down,6,2]第四位！圣护之手·闇！",
                                                                        {
                                                                            "type": "setBlock",
                                                                            "number": "E1205",
                                                                            "loc": [
                                                                                [
                                                                                    0,
                                                                                    4
                                                                                ]
                                                                            ],
                                                                            "time": 0,
                                                                            "async": true
                                                                        },
                                                                        {
                                                                            "type": "playSound",
                                                                            "name": "139-Darkness02.ogg"
                                                                        },
                                                                        {
                                                                            "type": "animate",
                                                                            "name": "attack18",
                                                                            "loc": [
                                                                                0,
                                                                                4
                                                                            ],
                                                                            "async": true
                                                                        },
                                                                        "谶祖召唤出与圣护之手·闇无异的傀儡，并且在傀儡的加持下，谶祖的属性得以提升！",
                                                                        {
                                                                            "type": "setEnemy",
                                                                            "id": "E1182",
                                                                            "name": "hp",
                                                                            "value": "80000000000000000"
                                                                        },
                                                                        {
                                                                            "type": "setEnemy",
                                                                            "id": "E1182",
                                                                            "name": "atk",
                                                                            "value": "9000000000000000"
                                                                        },
                                                                        {
                                                                            "type": "setEnemy",
                                                                            "id": "E1182",
                                                                            "name": "def",
                                                                            "value": "2800000000000000"
                                                                        },
                                                                        {
                                                                            "type": "update"
                                                                        }
                                                                    ],
                                                                    "false": [
                                                                        {
                                                                            "type": "if",
                                                                            "condition": "(flag:boss371F===1)",
                                                                            "true": [
                                                                                "\t[谶祖,E1182]\b[down,6,2]若影卡萨，魔塔世界初始魔塔领域中最后一位头目，其性格怪异，难以理解，在魔塔第二十层败与神之勇者小粽之手。",
                                                                                "\t[谶祖,E1182]\b[down,6,2]如何，小粽，看到眼前的老敌人是不是感到异常亲切呢？",
                                                                                "\t[小粽,hero]\b[hero]就算是现在，我看到这家伙只会感到作呕，而当你操纵这家伙尸体摆在我面前时，我只想现在就杀了你！",
                                                                                "\t[谶祖,E1182]\b[down,6,2]哦？那就来吧。",
                                                                                {
                                                                                    "type": "battle",
                                                                                    "id": "E1182"
                                                                                },
                                                                                {
                                                                                    "type": "setValue",
                                                                                    "name": "flag:boss371F",
                                                                                    "value": "2"
                                                                                },
                                                                                "\t[谶祖,E1182]\b[down,6,2]第二位！道傀使。",
                                                                                "\t[谶祖,E1182]\b[down,6,2]第三位！体魄星尊——泰帝。",
                                                                                "\t[谶祖,E1182]\b[down,6,2]都出来吧！！",
                                                                                {
                                                                                    "type": "playSound",
                                                                                    "name": "139-Darkness02.ogg"
                                                                                },
                                                                                {
                                                                                    "type": "animate",
                                                                                    "name": "attack18",
                                                                                    "loc": [
                                                                                        2,
                                                                                        6
                                                                                    ],
                                                                                    "async": true
                                                                                },
                                                                                {
                                                                                    "type": "animate",
                                                                                    "name": "attack18",
                                                                                    "loc": [
                                                                                        12,
                                                                                        4
                                                                                    ],
                                                                                    "async": true
                                                                                },
                                                                                {
                                                                                    "type": "setBlock",
                                                                                    "number": "E1202",
                                                                                    "loc": [
                                                                                        [
                                                                                            2,
                                                                                            6
                                                                                        ]
                                                                                    ],
                                                                                    "time": 0,
                                                                                    "async": true
                                                                                },
                                                                                {
                                                                                    "type": "setBlock",
                                                                                    "number": "E1204",
                                                                                    "loc": [
                                                                                        [
                                                                                            12,
                                                                                            4
                                                                                        ]
                                                                                    ],
                                                                                    "time": 0
                                                                                },
                                                                                "谶祖召唤出与道傀使，泰帝无异的傀儡，并且在傀儡的加持下，谶祖的属性得以提升！",
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1182",
                                                                                    "name": "hp",
                                                                                    "value": "72500000000000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1182",
                                                                                    "name": "atk",
                                                                                    "value": "9000000000000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1182",
                                                                                    "name": "def",
                                                                                    "value": "2600000000000000"
                                                                                },
                                                                                {
                                                                                    "type": "update"
                                                                                },
                                                                                {
                                                                                    "type": "waitAsync"
                                                                                }
                                                                            ],
                                                                            "false": [
                                                                                {
                                                                                    "type": "battle",
                                                                                    "id": "E1182"
                                                                                },
                                                                                {
                                                                                    "type": "setValue",
                                                                                    "name": "flag:boss371F",
                                                                                    "value": "1"
                                                                                },
                                                                                "\t[君无天,N1195]\b[hero,3]谶祖，你就施展这点实力就想让我们感受到绝望吗，那你真是太看不起我们了！",
                                                                                "\t[谶祖,E1182]\b[down,6,2]呵呵呵......别急，这只是热身运动而已。",
                                                                                "\t[谶祖,E1182]\b[down,6,2]吾最喜欢的就是击碎你们那虚无缥缈的希望与自信！",
                                                                                "\t[君无天,N1195]\b[hero,3]是吗！那你就试一试！",
                                                                                "\t[谶祖,E1182]\b[down,6,2]呵呵呵....那我可要开始了！",
                                                                                "\t[君无天,N1195]\b[hero,3]废话！！",
                                                                                "\t[谶祖,E1182]\b[down,6,2]啧，真是不领情，跟剑老头一个样。",
                                                                                "\t[谶祖,E1182]\b[down,6,2]出来吧，若影卡萨！",
                                                                                {
                                                                                    "type": "playSound",
                                                                                    "name": "139-Darkness02.ogg"
                                                                                },
                                                                                {
                                                                                    "type": "animate",
                                                                                    "name": "attack18",
                                                                                    "loc": [
                                                                                        10,
                                                                                        6
                                                                                    ],
                                                                                    "async": true
                                                                                },
                                                                                {
                                                                                    "type": "setBlock",
                                                                                    "number": "E1201",
                                                                                    "loc": [
                                                                                        [
                                                                                            10,
                                                                                            6
                                                                                        ]
                                                                                    ],
                                                                                    "time": 0
                                                                                },
                                                                                "谶祖召唤出与若影卡萨无异的傀儡，并且在傀儡的加持下，谶祖的属性得以提升！",
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1182",
                                                                                    "name": "hp",
                                                                                    "value": "65000000000000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1182",
                                                                                    "name": "atk",
                                                                                    "value": "8250000000000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1182",
                                                                                    "name": "def",
                                                                                    "value": "2250000000000000"
                                                                                },
                                                                                {
                                                                                    "type": "update"
                                                                                },
                                                                                {
                                                                                    "type": "waitAsync"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,2": {
            "0": null,
            "1": null,
            "2": null
        }
    },
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0, 17, 87, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,1182, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140504,  0,140506,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,140514,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,60146,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,140514,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,140514,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,140514,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,60146,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,60146,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512,  0,140514,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140512, 88,140514,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,60033,  0,140384,140385,140386,  0,60033,  0,  0,  0],
    [  0,60033,  0,60041,  0,140392,140393,140394,  0,60041,  0,60033,  0],
    [  0,60041,  0,  0,  0,140400,140401,140402,  0,  0,  0,60041,  0],
    [60033,  0,  0,  0,  0,140408,140513,140410,  0,  0,  0,  0,60033],
    [60041,  0,  0,  0,  0,  0,140513,  0,  0,  0,  0,  0,60041],
    [  0,  0,60033,  0,  0,  0,140513,  0,  0,  0,60033,  0,  0],
    [  0,  0,60041,  0,  0,  0,140513,  0,  0,  0,60041,  0,  0],
    [  0,  0,  0,  0,  0,  0,140513,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,140513,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,140513,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,140513,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,140513,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}