main.floors.MT381=
{
    "floorId": "MT381",
    "title": "终焉之城·魔殿第三十九层",
    "name": "终焉之城·魔殿第三十九层",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "holy3.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "bgm": "battle22.mp3",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 2000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 4000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 10000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 10000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 50000
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "2,5": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240092,240092,240092,240092,240092,240092, 87,  0, 21,  0,  0, 21,  0],
    [240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,370],
    [240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,  0],
    [240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,370],
    [240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,  0],
    [ 83,  0, 88,  0,370,  0,370,  0,370,  0,370,  0,370],
    [668,240092, 81,240092, 81,240092, 81,240092, 82,240092, 82,240092, 82],
    [401,240092,401,240092,401,240092,401,240092,402,240092,402,240092,402],
    [401,240092, 81,240092, 81,240092, 81,240092,666,240092,666,240092,666],
    [ 83,240092,401,240092,401,240092,401,240092, 82,240092, 82,240092, 82],
    [668,240092, 81,240092, 81,240092, 81,240092,402,240092,402,240092,402],
    [401,240092,401,240092,401,240092,401,240092,666,240092,666,240092,666],
    [401,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092,240092]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}