main.floors.MT400=
{
    "floorId": "MT400",
    "title": "光明圣堂（下院一层）",
    "name": "光明圣堂（下院一层）",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 500000000,
    "defaultGround": "T1272",
    "bgm": "battle29.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,12": [
            {
                "type": "changeFloor",
                "floorId": "MT399",
                "loc": [
                    19,
                    19
                ],
                "time": 0
            }
        ],
        "8,11": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[神秘商人,womanMagician]我可以提升你的商店等级，让商店里相同金钱出售的能力*2.5，购买价格到7500时来找我吧。",
                {
                    "type": "choices",
                    "text": "\t[神秘商人,womanMagician]是否加倍？",
                    "choices": [
                        {
                            "text": "加倍！",
                            "action": [
                                {
                                    "type": "if",
                                    "condition": "(flag:shop_times7>=371)",
                                    "true": [
                                        {
                                            "type": "disableShop",
                                            "id": "382Fshop"
                                        },
                                        "\t[神秘商人,womanMagician]搞定，顺便为了方便你购买，基础价格和购买效果也翻了一倍。",
                                        {
                                            "type": "hide",
                                            "time": 500
                                        },
                                        {
                                            "type": "openShop",
                                            "id": "399Fshop"
                                        }
                                    ],
                                    "false": [
                                        "\t[神秘商人,womanMagician]不够不够。",
                                        {
                                            "type": "exit"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "text": "暂时不用",
                            "action": [
                                "\t[神秘商人,womanMagician]那好吧。"
                            ]
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80033,80033,80033,80033,80033,80033,80033,80027],
    [80026,1278, 23,159,401,159, 87,159,  0,159,370,354,80024],
    [80026, 81,159,  0, 27, 81,1290, 81,351,  0,159,338,80024],
    [80026, 21,1284, 29,159,1286,  0,1286,159,335,1294,668,80024],
    [80026,159, 81,159,159,334,1291, 29, 21,1293,159,338,80024],
    [80026,159, 27,1288,350,  0,159,1287, 27,159,370,354,80024],
    [80026,351,159, 81,159,159,159,334,159,  0,159,159,80024],
    [80026,401,1293,666,336,159, 29,1284,350,  0,1285,351,80024],
    [80026,335,159,352,1289, 27,1280, 28,159,1281,159,401,80024],
    [80026,159,350,159,  0,1279,  0,1279,159, 21,159,1293,80024],
    [80026,401,1287,334,1285,159, 81,159,159,430,159, 21,80024],
    [80026,159,350,159,159, 22,1288, 22,126,159,159, 21,80024],
    [80020,80017,80017,80017,80017,80018, 88,80016,80017,80017,80017,80017,80019]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80009,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80009,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80009,80009,80009,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}