main.floors.MT415=
{
    "floorId": "MT415",
    "title": "未有之地",
    "name": "未有之地",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "showStatusBar"
        },
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 2000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 4000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 1000000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 1000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 5000000
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "Eternity.mp3",
            "keep": true
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero",
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                12
            ]
        },
        "\t[小粽,hero]\b[hero]这里是…………什么地方？",
        "\t[君无天,N1195]\b[hero,2]这里应该是类似于幻境的存在。",
        "\t[小粽,hero]\b[hero]幻境？我们已经踏入幻境了吗？那我们该怎么摆脱这里呢。",
        "\t[星钰,N1196]\b[hero,1]等等，小粽，父亲大人，你们看前方的元素体内部似乎蕴含着一些情感。",
        "\t[君无天,N1195]\b[hero,2]嗯？不仔细感知还真无法察觉出来。",
        "\t[君无天,N1195]\b[hero,2]不过这些情感可能会对我们产生精神污染，小心行事！",
        "\t[小粽,hero]\b[hero]嗯。",
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "【系统】这个区域所有宝石提升的能力为500兆倍！",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "MT418",
            "loc": [
                6,
                8
            ]
        }
    },
    "afterBattle": {
        "6,1": [
            "\t[君无天,N1195]\b[hero,2]小心！似乎有什么记忆涌现出来了！！",
            {
                "type": "hideStatusBar"
            },
            {
                "type": "setCurtain",
                "color": [
                    255,
                    255,
                    255,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "……………………",
            "时间回到三十年前…………。",
            {
                "type": "changeFloor",
                "floorId": "MT416",
                "loc": [
                    6,
                    14
                ],
                "time": 500
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0, 17, 91, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,240007,1315,240007,  0,  0,  0,  0,  0],
    [  0,  0,240007,240007,240007,240007,  0,240007,240007,240007,240007,  0,  0],
    [  0,  0,240007,1273,1274, 82,669, 82,1274,1273,240007,  0,  0],
    [  0,  0,240007,240007,240007,240007, 21,240007,240007,240007,240007,  0,  0],
    [  0,  0,  0,240007,1273, 81,367, 81,1273,240007,  0,  0,  0],
    [240007,240007,240007,240007,240007,240007, 21,240007,240007,240007,240007,240007,240007],
    [1275,1273,1275,1273,1275, 24,367, 24,1274,1274, 23,1274,1274],
    [240007,240007,240007,240007,240007,240007, 21,240007,240007,240007,240007,240007,240007],
    [ 21,1274, 21,1274, 21, 24,  0, 24, 22,1273, 22,1273, 22],
    [240007,240007,240007,240007,240007,240007,  0,240007,240007,240007,240007,240007,240007],
    [669,368,384,367,383, 24,  0, 24,383,367,384,368,669],
    [240007,240007,240007,240007,240007,240007,  0,240007,240007,240007,240007,240007,240007]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17, 17, 17, 17, 17, 17,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17]
],
    "bg2map": [

],
    "fg2map": [

],
    "ratio": 500000000
}