main.floors.MT429=
{
    "floorId": "MT429",
    "title": "未有之地",
    "name": "未有之地",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "showStatusBar"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "up",
                "up"
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]刚才那个人.......是谶祖吗？！！",
        "\t[君无天,N1195]\b[hero,2]..........谶祖吗......这个畜生究竟曾经干了些什么？",
        "\t[星钰,N1196]\b[hero,1]........",
        "\t[小粽,hero]\b[hero]星天前辈，我感觉之前的那种危机感愈发强烈了！",
        "\t[君无天,N1195]\b[hero,2]......谶祖，这个已经被“梦”消灭掉的家伙....他的背后......究竟隐藏着什么秘密....。",
        "\t[君无天,N1195]\b[hero,2]小粽，星钰，让我们抓紧脚步，继续前进吧！",
        "\t[小粽,hero]\b[hero]嗯！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT429\", ]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==1)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "remove": true
                    }
                ]
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {
        "6,0": [
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "时间回到十七年前",
            {
                "type": "hideStatusBar"
            },
            {
                "type": "setHeroIcon",
                "name": "hero2.png"
            },
            {
                "type": "unfollow",
                "name": "xy.png"
            },
            {
                "type": "unfollow",
                "name": "jwt.png"
            },
            {
                "type": "changeFloor",
                "floorId": "MT430",
                "loc": [
                    6,
                    12
                ],
                "direction": "up",
                "time": 500
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 17, 17, 17, 17, 17, 17,1377, 17, 17, 17, 17, 17, 17],
    [ 17,240007,240007,240007,240007,240007,670,240007,240007,240007,240007,240007, 17],
    [ 17,240007,1273,1376,366,240007,382,240007,366,1376,1273,240007, 17],
    [ 17,240007, 21,240007,334,1374,1274,1374,334,240007, 21,240007, 17],
    [ 17,240007,240007,240007,240007,350,240007,350,240007,240007,240007,240007, 17],
    [ 17,240007,350,240007,1273,  0,240007,  0,1273,240007,350,240007, 17],
    [ 17,240007,1274,240007,1374,240007,1275,240007,1374,240007,1274,240007, 17],
    [ 17,240007,350,1376,350,  0,1376,  0,350,1376,350,240007, 17],
    [ 17,240007,240007,240007,1273,334,240007,334,1273,240007,240007,240007, 17],
    [ 17,240007,350,367,240007,1374,240007,1374,240007,367,350,240007, 17],
    [ 17,240007,367,334,1374,1275,  0,1275,1374,334,367,240007, 17],
    [ 17,240007,240007,240007,240007,240007,  0,240007,240007,240007,240007,240007, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}