main.floors.MT421=
{
    "floorId": "MT421",
    "title": "未有之地",
    "name": "未有之地",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "up",
                "up"
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showStatusBar"
        },
        "\t[君无天,N1195]\b[hero,2]刚才的那段记忆里的小男孩和小女孩与第一次见面相比长大了一些。",
        "\t[君无天,N1195]\b[hero,2]按照人类年龄来算的话，那一段应该是他们十二岁时候的记忆。",
        "\t[星钰,N1196]\b[hero,1]不过这两个记忆片段我感觉有一些问题。",
        "\t[星钰,N1196]\b[hero,1]一.那个小男孩的名字不知道为什么没有显示出来，明明在自我介绍的时候就应该显示的，可是却像被什么东西给屏蔽了一番。",
        "\t[星钰,N1196]\b[hero,1]二.关于这个叫梦儿的小女孩……这让我联想到了一个人——",
        "\t[星钰,N1196]\b[hero,1]那个杀死罗天的家伙！",
        "\t[小粽,hero]\b[hero]那个叫做“梦”的女人吗？",
        "\t[星钰,N1196]\b[hero,1]嗯，我感觉这个小女孩是那个“梦”的幼女时期。",
        "\t[小粽,hero]\b[hero]不过那个叫梦的女人不是魔王所创造的实验体吗？",
        "\t[小粽,hero]\b[hero]而且我记得魔王开始制造实验体是在十多年前才开始的，而这个记忆片段所传递的消息是二十多年前的事情，这时间点应该不对。",
        "\t[星钰,N1196]\b[hero,1]嗯，堇姐姐当初的确说魔王是在十多年前创造出来“梦”的，而现在这个小女孩的名字既与她一字之差，又是在魔塔顶层的区域才出现的记忆片段……",
        "\t[星钰,N1196]\b[hero,1]这件事情的起因经过的确非常诡异……",
        "\t[君无天,N1195]\b[hero,2]嗯？小心，这些元素体所蕴含的情感与之前相比更加强烈了！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT421\", ]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==1)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "remove": true
                    },
                    {
                        "type": "insert",
                        "loc": [
                            0,
                            0
                        ]
                    }
                ]
            }
        ],
        "0,0": [
            "\t[小粽,hero]\b[hero]呼……这些元素没想到这么难缠。",
            "\t[星钰,N1196]\b[hero,1]如果罗天还在的话…………或许我们就不用担心这些精神污染了吧。",
            "\t[小粽,hero]\b[hero]………………",
            "\t[星钰,N1196]\b[hero,1]啊，对不起，我不应该说这些的…………。",
            "\t[小粽,hero]\b[hero]不，没有关系，过往的悲剧终将会被时间长河所掩埋。",
            "\t[小粽,hero]\b[hero]我们现在只有阻止魔王，才能阻止悲剧继续发生。",
            "\t[君无天,N1195]\b[hero,2]小粽说的没错，只有阻止魔王完成造神计划，我们才能不辜负过去之人所给予我们的希望。",
            "\t[星钰,N1196]\b[hero,1]……嗯！",
            "\t[小粽,hero]\b[hero]来吧，就让我们看看这里究竟埋藏了什么秘密！"
        ]
    },
    "changeFloor": {},
    "afterBattle": {
        "6,1": [
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "时间回到二十一年前.........。",
            {
                "type": "hideStatusBar"
            },
            {
                "type": "setHeroIcon",
                "name": "hero2.png"
            },
            {
                "type": "unfollow",
                "name": "xy.png"
            },
            {
                "type": "unfollow",
                "name": "jwt.png"
            },
            {
                "type": "changeFloor",
                "floorId": "MT422",
                "loc": [
                    6,
                    7
                ],
                "time": 500
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,240007,240007,240007,240007,240007,1350,240007,240007,240007,240007,240007, 17],
    [ 17,240007,1273,1347,669,240007,670,240007,669,1347,1273,240007, 17],
    [ 17,240007,1273,240007,382,1347,1274,1347,382,240007,1273,240007, 17],
    [ 17,240007,240007,240007,240007,350,240007,350,240007,240007,240007,240007, 17],
    [ 17,240007, 27,240007,367,1315,240007,1315,367,240007, 28,240007, 17],
    [ 17,240007,669,1347,  0, 28,669, 27,  0,1347,669,240007, 17],
    [ 17,240007, 28,240007,1315,240007,1315,240007,1315,240007, 27,240007, 17],
    [ 17,240007,240007,669,  0,367,  0,367,  0,669,240007,240007, 17],
    [ 17,240007,240007,1347,240007,240007,1315,240007,240007,1347,240007,240007, 17],
    [ 17,240007, 28,669, 28,240007,1275,240007, 27,669, 27,240007, 17],
    [ 17,240007,240007,240007,240007,240007,  0,240007,240007,240007,240007,240007, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}