main.floors.MT428=
{
    "floorId": "MT428",
    "title": "未知地带",
    "name": "未知地带",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "139-Darkness02.ogg"
        },
        {
            "type": "animate",
            "name": "attack18",
            "loc": [
                6,
                4
            ],
            "async": true
        },
        {
            "type": "setBlock",
            "number": "N1375",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]嗯？是魔物吗！",
        "\t[？？？,N1375]\b[this,6,4]……………………原来如此。",
        "\t[青年,hero]\b[hero]高等灵智魔物？.....你想要干什么！",
        "\t[？？？,N1375]\b[this,6,4]原来如此，原来如此，原来你拥有如此稀罕的资质呢！",
        "\t[青年,hero]\b[hero]我问你话呢！",
        "\t[？？？,N1375]\b[this,6,4]呵呵呵……不要着急。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "remove": true
        },
        {
            "type": "playSound",
            "name": "139-Darkness02.ogg"
        },
        {
            "type": "animate",
            "name": "attack18",
            "loc": [
                6,
                6
            ],
            "async": true
        },
        {
            "type": "setBlock",
            "number": "N1375",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 100,
            "steps": [
                "backward"
            ]
        },
        "\t[青年,hero]\b[hero]这家伙…………居然能够神不知鬼不觉的瞬移……",
        "\t[？？？,N1375]\b[this,6,6]你不用感到吃惊与惊悚，你只用知道本座并不会加害于你便足够了。",
        "\t[青年,hero]\b[hero]…………………………",
        "\t[？？？,N1375]\b[this,6,6]你知道吗？虽然你拥有非常难得一见的资质，但是…………",
        "\t[？？？,N1375]\b[this,6,6]我看到了…………未来你必将会失去你生命中最珍视的事物！",
        "\t[？？？,N1375]\b[this,6,6]而在此之后…………你必将会仇视这一切，仇视这个世界！",
        "\t[？？？,N1375]\b[this,6,6]而你…………也将会堕入那无尽的黑暗！",
        "\t[青年,hero]\b[hero]妖言惑众！我绝对不会相信你那所谓的谶语！！",
        "\t[？？？,N1375]\b[this,6,6]谶语吗？哈哈哈哈哈！！那就让时间来见证这一切吧！！",
        "\t[？？？,N1375]\b[this,6,6]终有一天……你会走上这早已既定道路的！哈哈哈哈哈哈哈哈哈哈哈哈！！",
        {
            "type": "playSound",
            "name": "139-Darkness02.ogg"
        },
        {
            "type": "animate",
            "name": "attack18",
            "loc": [
                6,
                6
            ],
            "async": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true
        },
        "\t[青年,hero]\b[hero]…………………………",
        "\t[青年,hero]\b[hero]…………………………这家伙究竟有什么目的…………",
        "\t[青年,hero]\b[hero]…………………………梦儿。",
        "\t[青年,hero]\b[hero]有朝一日……你真的会离我而去吗？",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "follow",
            "name": "xy.png"
        },
        {
            "type": "follow",
            "name": "jwt.png"
        },
        {
            "type": "changeFloor",
            "floorId": "MT429",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}