main.floors.MT424=
{
    "floorId": "MT424",
    "title": "不知道是谁的家",
    "name": "不知道是谁的家",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "T1357",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[青年,hero]\b[hero]咳咳咳！",
        "\t[梦儿,N1351]\b[this,3,3]哥哥！！你没事吧！！",
        "\t[青年,hero]\b[hero]该死！怎么会…………怎么会这样…………",
        "\t[青年,hero]\b[hero]都是因为我…………都是因为我……",
        "\t[青年,hero]\b[hero]如果不是因为我的话…………四弟他也不会…………",
        "\t[梦儿,N1351]\b[this,3,3]哥哥…………",
        "\t[？？？]没错，都是因为你一直都自以为是才导致四弟的死亡！",
        {
            "type": "setBlock",
            "number": "N1256",
            "loc": [
                [
                    3,
                    3
                ]
            ],
            "time": 0
        },
        {
            "type": "setBlock",
            "number": "N1369",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 500
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up",
                "left",
                "left",
                "left",
                "left",
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1353",
            "loc": [
                [
                    2,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "setBlock",
            "number": "N1365",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 500
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up",
                "left",
                "left",
                "left",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1354",
            "loc": [
                [
                    3,
                    6
                ]
            ],
            "time": 0
        },
        "\t[青年,hero]\b[hero]我…………",
        "\t[二哥,N1353]\b[this,2,5]你？你什么你！你知不知道每次都是因为你才让我们无法自主选择自己所需的！",
        "\t[青年,hero]\b[hero]没有规矩……不成方圆，如果我不对你们加以管理的话，战争时代我们这些孤儿早就被战火给吞噬了！",
        "\t[二哥,N1353]\b[this,2,5]哼！你的规矩？我看是你自己个人的私欲吧！",
        "\t[二哥,N1353]\b[this,2,5]你将我们加以管束目的就是为了成为你的傀儡吧！！",
        "\t[三哥,N1354]\b[this,3,6]二哥…………这话说太重了……",
        "\t[梦儿,N1371]\b[this,3,3]你住口！你知不知道哥哥他为了我们付出了多少吗？",
        "\t[二哥,N1353]\b[this,2,5]他对我们付出多少我不清楚，我看他对你付出倒是不少。",
        "\t[梦儿,N1371]\b[this,3,3]你！",
        "\t[二哥,N1353]\b[this,2,5]哼！跟着你只会成为你的傀儡，最终落得四弟一样的下场！",
        {
            "type": "setBlock",
            "number": "N1366",
            "loc": [
                [
                    2,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "move",
            "loc": [
                2,
                5
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down",
                "down",
                "down",
                "down"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1370",
            "loc": [
                [
                    3,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]等等，你要去哪里？！",
        {
            "type": "setBlock",
            "number": "N1353",
            "loc": [
                [
                    2,
                    9
                ]
            ],
            "time": 0
        },
        "\t[二哥,N1353]\b[this,2,9]我要去哪里需要你知道吗？三弟，我们走！",
        "\t[三哥,N1370]\b[this,3,6]啊？我…………这……",
        "\t[二哥,N1353]\b[this,2,9]你听不懂我在说什么吗？给我过来！！",
        {
            "type": "setBlock",
            "number": "N1354",
            "loc": [
                [
                    3,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "setBlock",
            "number": "N1370",
            "loc": [
                [
                    3,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "setBlock",
            "number": "N1354",
            "loc": [
                [
                    3,
                    6
                ]
            ],
            "time": 0
        },
        "\t[三哥,N1354]\b[this,3,6]这…………唉，老大，保重！",
        {
            "type": "setBlock",
            "number": "N1362",
            "loc": [
                [
                    3,
                    6
                ]
            ],
            "time": 0
        },
        {
            "type": "move",
            "loc": [
                3,
                6
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down",
                "down",
                "down",
                "down"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1354",
            "loc": [
                [
                    3,
                    10
                ]
            ],
            "time": 0
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]等等！你们两个疯了吗？竟然要自己行动！",
        "\t[二哥,N1353]\b[this,2,9]疯的人是你！我之前说过了，跟着你只会成为你的傀儡。",
        "\t[二哥,N1353]\b[this,2,9]下次见面，我会让你知道你的决策是有多么大的错误！请！",
        {
            "type": "setBlock",
            "number": "N1366",
            "loc": [
                [
                    2,
                    9
                ]
            ],
            "time": 0
        },
        {
            "type": "move",
            "loc": [
                2,
                9
            ],
            "time": 500,
            "steps": [
                "down",
                "down",
                "right",
                "right",
                "right",
                "right",
                "down"
            ]
        },
        "\t[三哥,N1354]\b[this,3,10]对不起，老大……",
        {
            "type": "setBlock",
            "number": "N1362",
            "loc": [
                [
                    3,
                    10
                ]
            ],
            "time": 0
        },
        {
            "type": "move",
            "loc": [
                3,
                10
            ],
            "time": 500,
            "steps": [
                "right",
                "right",
                "right",
                "down",
                "down"
            ]
        },
        "\t[青年,hero]\b[hero]\r[red]你们两个回来！回来啊！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[青年,hero]\b[hero]\r[red]咳咳咳咳咳咳！！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                3,
                3
            ]
        },
        {
            "type": "setBlock",
            "number": "N1351",
            "loc": [
                [
                    3,
                    3
                ]
            ],
            "time": 0
        },
        "\t[梦儿,N1351]\b[this,3,3]哥哥！你现在受伤了，不要再说话了。",
        "\t[青年,hero]\b[hero]\r[red]……………………都是我的错啊……都是我的错啊！",
        "\t[梦儿,N1351]\b[this,3,3]不是这样的…………不是这样的…………",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "follow",
            "name": "xy.png"
        },
        {
            "type": "follow",
            "name": "jwt.png"
        },
        {
            "type": "changeFloor",
            "floorId": "MT425",
            "loc": [
                6,
                13
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20,10016,10017,10017,10017,10017,10017,10017,10017,10017,10017,10018, 20],
    [ 20,181452,181453,10025,10025,10025,10025,10025,10025,10025,10025,10026, 20],
    [ 20,181461,  0,1351,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,181468,181469,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10080,10081,  0,  0,  0],
    [  0,  0,  0,  0,  0,10104,10105,10104,10088,10089,10092,10093,  0],
    [  0,181460,181461,  0,  0,10112,10113,10112,10096,10097,10100,10101,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,170048,170049,170050,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,70067,170056,170057,170058,70067,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,170064,170065,170066,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10095,  0,  0,  0,10094,  0,10094,  0,  0,  0,10095,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,170040,170041,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}