main.floors.MT434=
{
    "floorId": "MT434",
    "title": "未知空间",
    "name": "未知空间",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "GG5.mp3",
            "keep": true
        },
        "\t[青年,hero]\b[hero]这…………这里是…………",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "changePos",
            "loc": [
                6,
                6
            ],
            "direction": "up"
        },
        "\t[青年,hero]\b[hero]梦儿！梦儿你没事吧！！",
        "\t[梦儿,N1380]\b[this,6,5]哥哥……梦儿……梦儿没事。",
        "梦儿虽然嘴上是这么说，但是其身体却愈发虚幻......。",
        "\t[青年,hero]\b[hero]梦儿！你……你不要吓我，你的身体…………",
        "\t[梦儿,N1380]\b[this,6,5]…………哥哥，梦儿怎么感觉…………有点困呀……好想睡一觉……。",
        "\t[青年,hero]\b[hero]梦儿，不要睡，现在不能睡！",
        "\t[梦儿,N1380]\b[this,6,5]哥哥……梦儿回忆起了好多好多东西呢。与哥哥在一起的回忆…………还有属于我自己的。",
        "\t[青年,hero]\b[hero]梦儿……先不要回忆了，我先想办法带你离开这里，好吗？",
        "\t[梦儿,N1380]\b[this,6,5]不……哥哥，有些事情……必须告诉你……。",
        "\t[仙梦,N1380]\b[this,6,5]梦儿的真正名字名为：\r[gold]仙梦。\r[white]并且我……",
        "\t[仙梦,N1380]\b[this,6,5]\r[red]不是人类。",
        "\t[青年,hero]\b[hero]不……不是人类？",
        "\t[青年,hero]\b[hero]梦儿你在这个时候不要开这种玩笑了，好吗？",
        "\t[仙梦,N1380]\b[this,6,5]不……梦儿并没有开玩笑……",
        "\t[青年,hero]\b[hero]………………",
        "\t[仙梦,N1380]\b[this,6,5]在我离开你的这段时间……梦儿回忆起了自己过去的身份是魔物以外…………还学会了使用这股力量。",
        "\t[青年,hero]\b[hero]…………………………",
        "\t[仙梦,N1380]\b[this,6,5]我之前之所以离去是因为我已故的父亲大人给我设置的阵法。等我有自保能力的时候就会自动解开，并给予我全部记忆。",
        "\t[仙梦,N1380]\b[this,6,5].....而且其实……我是仙子一族的人，仙子一族人数稀少……而且还分为两种形态……\",",
        "\t[仙梦,N1380]\b[this,6,5]与人类无区别的人形态…………以及…………真正的仙子形态！",
        "\t[仙梦,N1380]\b[this,6,5]\r[red]咳咳咳！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]梦儿你不要再说了，这些都不重要！我现在只要你平安无事。",
        "\t[仙梦,N1380]\b[this,6,5]哥哥你能……这么体贴我…………梦儿知道…………我所爱的人……\r[red]是值得我付出生命的！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]\r[red]什么？！付出生命的代价！！梦儿！你……！",
        "\t[仙梦,N1380]\b[this,6,5]我们仙子一族…………拥有一个传说…………那就是…………",
        "\t[仙梦,N1380]\b[this,6,5]皇族血统——\r[gold]即可成神！",
        "\t[青年,hero]\b[hero]\r[gold]神？？！！",
        "\t[仙梦,N1380]\b[this,6,5]没错……成为神！",
        "\t[仙梦,N1380]\b[this,6,5]…………只有皇族的仙子一族…………才能在成年之后才有机会…………成为神！",
        "\t[仙梦,N1380]\b[this,6,5]不过……虽是这么说……但其实是几乎不可能的事…………",
        "\t[仙梦,N1380]\b[this,6,5]而在我们仙子一族的历史上……成为神的只有一位…………",
        "\t[仙梦,N1380]\b[this,6,5]\r[red]咳咳咳！",
        "\t[青年,hero]\b[hero]不要再说了…………这一切都不重要了……。",
        "\t[仙梦,N1380]\b[this,6,5]而其他皇族血统的…………例如我这样的…………只能暂时借助近似于神的力量…………\n而且一旦使用……面临的便是——\r[red]死亡！",
        "\t[仙梦,N1380]\b[this,6,5]\r[red]噗！咳咳咳咳咳咳！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]\r[red]为什么……为什么你要这么做…………你明明知道后果！为什么还要这么做！！",
        "\t[仙梦,N1380]\b[this,6,5]因为…………\r[red]我也想保护哥哥呀。",
        "\t[青年,hero]\b[hero]梦儿………………",
        "\t[仙梦,N1380]\b[this,6,5]其实……有件事……我一直都没有告诉你……那就是……",
        "\t[仙梦,N1380]\b[this,6,5]\r[red]我为你.......生了一个女儿....",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]女儿？…………我……我有孩子了？！",
        "\t[青年,hero]\b[hero]\r[red]不…………我不要孩子…………我只要你能活着啊…………！",
        "\t[仙梦,N1380]\b[this,6,5]哈……不要这么说呀…………孩子会伤心的呢。",
        "\t[仙梦,N1380]\b[this,6,5]对了……这个东西给你……",
        "\t[青年,hero]\b[hero]这是…………？",
        "\t[仙梦,N1380]\b[this,6,5]我们的定情信物哟………",
        "\t[仙梦,N1380]\b[this,6,5]啊……我差点忘了给我们的孩子取名了呢，我真是个不合格的母亲呢……",
        "\t[仙梦,N1380]\b[this,6,5]这个孩子…………就叫\r[gold]“仙琳”\r[white]吧！",
        "\t[仙梦,N1380]\b[this,6,5]我之前……已经把我们的孩子送回我母亲那里照护了……她一定会健康快乐的成长着呢。",
        "\t[青年,hero]\b[hero]梦儿！你现在告诉我这些又如何…………我……\r[red]我最珍视的只有你啊！",
        "\t[仙梦,N1380]\b[this,6,5]\r[red]哈………我这一生……能认识哥哥…………我……一生……无憾……，希…………望…………你…………幸…………福………………",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "remove": true,
            "time": 500
        },
        "在仙梦口中说完最后一个词的时候，仙梦的身体逐渐化为了尘埃，并且消散于这天地之间…………",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[青年,hero]\b[hero]\r[red]梦儿！！",
        "\t[青年,hero]\b[hero]\r[red]梦儿！！梦儿！！",
        "\t[青年,hero]\b[hero]\r[red]梦儿你不要走！快回来！！",
        "然而无论是何等大声的呼唤，也唤不回已逝之人……………",
        "\t[青年,hero]\b[hero]\r[red]梦儿！梦儿！！",
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "backward",
                "backward"
            ]
        },
        "\t[青年,hero]\b[hero]\r[red]为什么！！为什么会这样！！",
        "\t[青年,hero]\b[hero]\r[red]不要！不要这样！！梦儿！！！",
        "\t[青年,hero]\b[hero]\r[red]啊！！！！！！！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "playSound",
            "name": "051-Explosion04.ogg"
        },
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "follow",
            "name": "xy.png"
        },
        {
            "type": "follow",
            "name": "jwt.png"
        },
        {
            "type": "addValue",
            "name": "item:book",
            "value": "1"
        },
        {
            "type": "changeFloor",
            "floorId": "MT435",
            "loc": [
                6,
                14
            ],
            "direction": "up",
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,0": [
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[青年,hero]\b[hero]为什么………………为什么会这样…………",
            "\t[青年,hero]\b[hero]这就是人心吗…………人心居然会如此丑恶，相比之下魔物又算得了什么呢？",
            "\t[青年,hero]\b[hero]\r[red]无意义的情感，不需要存在！",
            "\t[？？？]孩子，孩子，听的到我说话吗？",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]谁？！",
            {
                "type": "setBlock",
                "number": "N1385",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]你是？",
            "\t[？？？,N1385]\b[this,6,5]孩子，放下你手中的利刃，我对你并没有恶意。",
            "\t[青年,hero]\b[hero]你....退后！不要靠过来！！",
            "\t[？？？,N1385]\b[this,6,5]..........",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        5
                    ]
                ],
                "remove": true,
                "time": 500
            },
            {
                "type": "setBlock",
                "number": "N1385",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "time": 500
            },
            "\t[？？？,N1385]\b[this,6,4]孩子，满意了吧，要是不满意我再退一步。",
            "\t[青年,hero]\b[hero].............你想对我做什么。",
            "\t[？？？,N1385]\b[this,6,4]..................",
            "\t[青年,hero]\b[hero]我问你话呢！",
            "\t[？？？,N1385]\b[this,6,4].........你知道人类世界的初代勇者吗？",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]初代勇者？！当然知道，那可是曾经拯救过我们人类的大英雄呢！不过你一个魔物怎么问我这种问题？",
            "\t[？？？,N1385]\b[this,6,4].......是吗...没想到人类世界还记得初代勇者这个人啊......。",
            "\t[青年,hero]\b[hero]你.....究竟在说些什么？",
            "\t[初代勇者,N1385]\b[this,6,4]因为....\r[gold]我就是曾经拯救人类世界的初代勇者啊！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]你在开什么玩笑？你明明只是一只魔物而已！有什么资格与初代勇者相提并论！！",
            "\t[初代勇者,N1385]\b[this,6,4]孩子，不要相信你的眼睛，眼睛会说谎。",
            "\t[初代勇者,N1385]\b[this,6,4]你之所以看到我以一个魔物的形态来到你面前是因为我被黑暗之力侵蚀的结果。",
            "\t[青年,hero]\b[hero].....黑暗之力？",
            "\t[初代勇者,N1385]\b[this,6,4]曾经，我也是以人类勇者的姿态闯入这座魔塔的，只是...等我进入这座魔塔的时候...我发现这座魔塔背后所隐藏的黑暗远远超出了我的预料....。",
            "\t[初代勇者,N1385]\b[this,6,4]......你有没有见过一位身披红色斗篷，戴着金属头盔的家伙？",
            {
                "type": "animate",
                "name": "emmslow",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]......好像见过...那个人说——\r[red]我看到了…………未来你必将会失去你生命中最珍视的事物！",
            "\t[青年,hero]\b[hero]\r[red]而在此之后…………你必将会仇视这一切，仇视这个世界！",
            "\t[青年,hero]\b[hero]\r[red]而你…………也将会堕入那无尽的黑暗！",
            "\t[青年,hero]\b[hero]而我现在.....正如同他所说的那番.....失去了我最爱的人。",
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    4
                ]
            },
            "\t[初代勇者,N1385]\b[this,6,4]是吗......你也验证了他所说的谶语了啊....。",
            "\t[初代勇者,N1385]\b[this,6,4]孩子......你看，这是什么。",
            "初代勇者伸出了他的右手",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            {
                "type": "moveHero",
                "time": 10,
                "steps": [
                    "up",
                    "up",
                    "up",
                    "up"
                ]
            },
            "\t[青年,hero]\b[hero]！！！！梦儿？！！！",
            "\t[初代勇者,N1385]\b[this,6,4]准确的说——\r[aqua]是她的一缕残魂。",
            "\t[青年,hero]\b[hero]那梦儿可以复活吗？！",
            "\t[初代勇者,N1385]\b[this,6,4]......难。",
            "\t[青年,hero]\b[hero]难？还是有机会的吧！要怎么做才能让梦儿复活！",
            "\t[初代勇者,N1385]\b[this,6,4]以我现在的状态是毫无可能的，而你却有机会让她复活。",
            "\t[青年,hero]\b[hero]我？我要怎么做？？",
            "\t[初代勇者,N1385]\b[this,6,4]咳咳咳......别急，我知道你非常思念她，但每件事情并不是能够如愿以偿的。",
            "\t[初代勇者,N1385]\b[this,6,4]让我继续刚才的话题吧，等我....将一切所要告知的....告诉你之后.....你就明白该怎么去做了。",
            "\t[青年,hero]\b[hero].........................好。",
            "\t[初代勇者,N1385]\b[this,6,4]很好。",
            "\t[初代勇者,N1385]\b[this,6,4]刚才我所说的那个人，是这个魔塔世界最高势力三圣阁的上一任阁主——\r[red]谶祖。",
            "\t[初代勇者,N1385]\b[this,6,4]当初也是这个家伙率领魔物大军来入侵我们的人类世界的！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]什么？！",
            "\t[初代勇者,N1385]\b[this,6,4]嗯，在我将他击退以后他就逃入了魔塔里。然后我为了斩草除根独自一人闯入了这座魔塔。",
            "\t[初代勇者,N1385]\b[this,6,4]我凭借我自己强悍的实力斩杀了诸多魔物，一直杀到了塔顶！",
            "\t[初代勇者,N1385]\b[this,6,4]......但是...等我登上塔顶的时候...在此等候我的不仅是谶祖.....还有.....\r[red]统领所有魔物的魔王！",
            "\t[青年,hero]\b[hero]魔王？",
            "\t[初代勇者,N1385]\b[this,6,4]对，魔塔世界真正巅峰的存在.....万魔之主——\r[red]魔王！",
            "\t[青年,hero]\b[hero]那个.....魔王....究竟有多强？",
            "\t[初代勇者,N1385]\b[this,6,4].....那是远远超越人类极限的存在.....距离成为真正神灵只差一步之遥的存在！",
            "\t[初代勇者,N1385]\b[this,6,4]而最后我当时以自己被空间放逐的代价将魔塔最顶层变成了极寒冰牢，让魔王与谶祖与我同归于尽！！",
            "\t[青年,hero]\b[hero]那初代勇者大人你现在...................以及那个谶祖.......怎么没被冰封？",
            "\t[初代勇者,N1385]\b[this,6,4]啊........那个谶祖....不知道运用了什么力量...强行将自己的副体传送出了被我冰封的地方，而他的本体却被永远冰封起来。",
            "\t[初代勇者,N1385]\b[this,6,4]而这些年他在外面流荡就是为了能够让他的本体重新恢复。",
            "\t[初代勇者,N1385]\b[this,6,4]而我也因为招数的副作用被放逐在这个空间，并且变成了现在这幅模样。",
            "\t[青年,hero]\b[hero]那我和梦儿是怎么来到这个空间的....。",
            "\t[初代勇者,N1385]\b[this,6,4]哎.....是你的爱人强行打破空间将你带到这里的.....\r[red]就是为了保护你啊....。",
            "\t[青年,hero]\b[hero]梦儿...........。",
            "\t[初代勇者,N1385]\b[this,6,4]现在...复活你的爱人唯一办法就是让你\r[gold]成为神灵！",
            {
                "type": "playBgm",
                "name": "holy7.mp3",
                "keep": true
            },
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            {
                "type": "vibrate",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]成为神灵？！这......这真的可能吗？神灵是真的真实存在的吗？！！",
            "\t[初代勇者,N1385]\b[this,6,4]啊.....当然存在.....你的爱人不就为了救你...成为了近似神灵般的存在。",
            "\t[青年,hero]\b[hero]......................",
            "\t[初代勇者,N1385]\b[this,6,4]我在这个空间除了找回自己的力量之外...还在研究如何成为神灵。",
            "\t[初代勇者,N1385]\b[this,6,4]而如今，我终于拥有了一个完美的计划！",
            "\t[青年,hero]\b[hero]什么计划？",
            "\t[初代勇者,N1385]\b[this,6,4]你可以称它为——\r[gold]造神计划！",
            "\t[青年,hero]\b[hero]\r[gold]造神计划？\r[white]那应该要如何实施造神计划呢？.....",
            "\t[初代勇者,N1385]\b[this,6,4]\r[red]第一步，就是让你成为现在统领魔塔世界的魔王！",
            "\t[青年,hero]\b[hero]什么？！！让我成为魔王？！这.......。",
            "\t[初代勇者,N1385]\b[this,6,4]听我说，其实...这座魔塔里的魔物都相信被冰封的魔王终有一天能够重新回到他的王座！",
            "\t[初代勇者,N1385]\b[this,6,4]而你现在只用变成魔王当初的模样，并且打破冰牢即可！这样...就能让魔物们知道..\r[red]他们的王！回来了！！",
            "\t[青年,hero]\b[hero]但是....我现在的力量与魔王相比如同天壤之别.....别说成为魔王..就算是登上塔顶都难以做到吧！",
            "\t[初代勇者,N1385]\b[this,6,4]是吗？那这样如何！",
            {
                "type": "playSound",
                "name": "087-Action02.ogg"
            },
            {
                "type": "animate",
                "name": "yongchang",
                "loc": [
                    6,
                    4
                ]
            },
            {
                "type": "playSound",
                "name": "087-Action02.ogg"
            },
            {
                "type": "animate",
                "name": "yongchang",
                "loc": [
                    6,
                    4
                ]
            },
            {
                "type": "playSound",
                "name": "087-Action02.ogg"
            },
            {
                "type": "animate",
                "name": "yongchang",
                "loc": [
                    6,
                    4
                ]
            },
            {
                "type": "playSound",
                "name": "115-Raise01.ogg"
            },
            {
                "type": "animate",
                "name": "attack20",
                "loc": "hero"
            },
            {
                "type": "playSound",
                "name": "115-Raise01.ogg"
            },
            {
                "type": "animate",
                "name": "attack20",
                "loc": "hero"
            },
            {
                "type": "playSound",
                "name": "115-Raise01.ogg"
            },
            {
                "type": "animate",
                "name": "attack20",
                "loc": "hero"
            },
            "初代勇者给青年灌输了相当庞大的力量！但自己的身体也愈发虚化了。",
            {
                "type": "setBlock",
                "number": "N1386",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "time": 0
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]这！如此强大的力量！！我感觉自己的实力达到了一种匪夷所思的高度！！初代勇者大人！你究竟做了些什么。",
            "\t[初代勇者,N1386]\b[this,6,4]呼....呼....我以自身绝大部分力量…………将你变成了近似于魔王的存在…………。",
            "\t[初代勇者,N1386]\b[this,6,4]只不过......想要完全吸收这股力量....得需要时间的沉淀......。",
            "\t[初代勇者,N1386]\b[this,6,4]不过现在这种程度的力量...也足够骗他们了！",
            "\t[青年,hero]\b[hero]初代勇者大人！你的身体与修为.....。",
            "\t[初代勇者,N1386]\b[this,6,4]我没事.....这些只是需要时间就可以重新恢复过来。",
            "\t[初代勇者,N1386]\b[this,6,4]现在...你就去完成你现在的使命吧.....而我....将会以这种状态暂时居住在你精神里。",
            "\t[初代勇者,N1386]\b[this,6,4]放开你的心神.....就让我.....。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "remove": true,
                "time": 0
            },
            {
                "type": "setHeroIcon",
                "name": "hero3.png"
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "animate",
                "name": "emmslow",
                "loc": "hero"
            },
            "\t[青年,hero]\b[hero]...........这就是魔王当初的模样吗？真是......。",
            "\t[初代勇者]等会我就打破这个空间，然后就按照计划执行吧！",
            "\t[青年,hero]\b[hero]嗯。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "青年与初代勇者到达了魔塔顶层",
            "\t[初代勇者]到了，就是这里。",
            "\t[青年]如此极寒的温度.....怪不得一路上都没有看到有魔物的痕迹....，全部畏惧这种力量呢。",
            "\t[初代勇者]现在不用在意这些，用你的力量，粉碎这一切吧！",
            "\t[青年]那原来的魔王与谶祖会不会被放出来呢？",
            "\t[初代勇者]放心吧，他们被冰封这么久，就是被放出来也没有力量能对付你的！",
            "\t[青年]那好！",
            "\t[青年]\r[gold]圣魔决·纪元永世！",
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            "青年施展出他的最强一招，顿时间魔塔顶层所有的冰牢全部破碎！",
            "\t[青年]..................并没有感受到魔王与谶祖的气息，看来都已经被粉碎掉了。",
            "\t[初代勇者]嗯，那.....\r[gold]造神计划，就此开始吧！\r[white]…让这些魔物们见证一下属于你的时代吧。哈哈哈哈哈哈哈哈！！",
            "与此同时魔塔世界里的魔物们同时感受到了青年所施展的力量！！",
            "随之而来的则是铺天盖地的通报！！",
            "\t[情报兵]紧急通报！紧急通报！魔塔顶层的永劫冰牢已被打破！！已被打破！！",
            "\t[情报兵]重复！重复！魔塔顶层的永劫冰牢已被打破！！已被打破！！",
            {
                "type": "sleep",
                "time": 500
            },
            "在三圣之巅处",
            "\t[黯夜殇]圣羽洛斯，你听说了吗，禁锢魔王大人的永劫冰牢已经被打破了，你认为是谁有如此神通？",
            "\t[圣羽洛斯]永劫冰牢是当初闯入这魔塔世界的初代人类勇者以自己生命代价所施展的，其温度近乎达到了绝对零度，就算是我们这种阁主级别的人物也不敢接近半步。",
            "\t[黯夜殇]那会是谁呢.....不仅能够靠近永劫冰牢，还能够完全打破。",
            "\t[圣羽洛斯]实力在我们之上的只有黯祖，谶祖，剑祖，以及仙月。",
            "\t[圣羽洛斯]但是他们四人都身受重伤，直至现在都没有完全恢复，尤其是谶祖，他本身就是被冰封状态。更不可能是他做的。",
            "\t[圣羽洛斯]\r[red]那么真相只有一个——那就是魔王他自己突破了永劫冰牢！！",
            "\t[黯夜殇]什么？你确定吗，魔王大人不是当初跟谶祖一起被冰封吗，而你也说被冰封的他们是难以自我突破的啊。",
            "\t[圣羽洛斯]啧，魔王大人何等大能你不清楚？",
            "\t[黯夜殇].....这...的确...魔王大人的神通的确是我们难以想象的。",
            "\t[圣羽洛斯]走吧，黯夜殇，我们去魔塔顶层，看看究竟是不是魔王大人自我突破了呢！",
            "\t[黯夜殇]好！",
            "在剑祖之坛处",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[剑祖].....................",
            "\t[剑祖]....................！！！永劫冰牢被打破了？！",
            "\t[君无天]怎么了，剑祖师父，为啥我感觉整座魔塔都在动荡......。",
            "\t[剑祖]被冰封的魔王重新降临这个世界....又会引起怎样的变革呢。",
            "\t[君无天]什么？！魔王重新登上王位了！！",
            "在生命之森处",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[仙月]...........",
            "\t[仙月]................",
            "\t[仙月]永劫冰牢....已经被打破了，是原来那个魔王自我解封的.....还是你干的.....",
            "\t[仙月]你作为人类......真的能够....成为魔王吗？",
            "\t[仙月]而你对我说的......真的会成功吗？！",
            "不知过了多久，圣羽洛斯与黯夜殇以及诸多魔物来到了魔塔顶层——光明圣堂！",
            {
                "type": "setHeroIcon",
                "name": "hero.png"
            },
            {
                "type": "follow",
                "name": "xy.png"
            },
            {
                "type": "follow",
                "name": "jwt.png"
            },
            {
                "type": "changeFloor",
                "floorId": "MT436",
                "loc": [
                    6,
                    111
                ],
                "direction": "up",
                "time": 500
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "0,0": {
            "0": null,
            "1": null,
            "2": null
        }
    },
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,1380,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}