main.floors.MT439=
{
    "floorId": "MT439",
    "title": "未知空间",
    "name": "未知空间",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "start1.mp3",
            "keep": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[守望者,N724]\b[this,6,2]..............时间差不多了！",
        "\t[守望者,N724]\b[this,6,2]各个势力即将要碰撞出那最璀璨的火花了！",
        "\t[守望者,N724]\b[this,6,2]\\d勇者,立守护之剑,造苍穹守世",
        "\t[守望者,N724]\b[this,6,2]\\d魔者,寻伊人之梦,统绝世之塔",
        "\t[守望者,N724]\b[this,6,2]\\d神者,窥人心之本,定万道法则",
        "\t[守望者,N724]\b[this,6,2]\\d那么究竟最后谁才是真正的赢家呢！是勇者,魔者,还是神者呢？",
        "\t[守望者,N724]\b[this,6,2]\\d吾可是非常期待呀！！",
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                2
            ]
        },
        "\t[守望者,N724]\b[this,6,2]嗯？这是……………………",
        "\t[守望者,N724]\b[this,6,2]………………………………",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                2
            ]
        },
        "\t[守望者,N724]\b[this,6,2]明明你的身躯早已被时间长河所吞噬，你的情感却依旧不愿在这天地之间消散吗？",
        "\t[？？]\\d……………………",
        "\t[？？]\\d……………………求…………",
        "\t[？？]\\d……………………求……求……",
        "\t[？？]\\d……………………求……求……你……",
        "\t[？？]\\d……………………我…………不…………要……就..............这...........样....",
        "\t[？？]\\d…………我…………想…………陪……伴……",
        "\t[？？]\\d着……他……",
        "\t[？？]\\d求…………你……了……",
        "\t[？？]\\d求……你……了。",
        "\t[？？]\\d求你了！",
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                2
            ]
        },
        "\t[守望者,N724]\b[this,6,2]诶，没想到呀……你的情感又一次让我感到吃惊到了呢。",
        "\t[？？]\\d求你了……",
        "\t[守望者,N724]\b[this,6,2]嗯…………不错，我想到了一个非常有趣的情节呢。",
        "\t[守望者,N724]\b[this,6,2]我知道你非常思念他，但是你也应该知道你已经是已故之人。",
        "\t[？？]\\d求你…………求……",
        "\t[守望者,N724]\b[this,6,2]好了，暂时先让你清醒过来吧。",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                10
            ]
        },
        {
            "type": "setBlock",
            "number": "N1397",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "time": 1000
        },
        "\t[仙琳,N1397]\b[this,6,10]...............",
        "\t[仙琳,N1397]\b[this,6,10]..............................",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ]
        },
        "\t[仙琳,N1397]\b[this,6,10]我…………我这是……！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ]
        },
        "\t[仙琳,N1397]\b[this,6,10]小粽？！！",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                10
            ]
        },
        "\t[仙琳,N1397]\b[this,6,10]不……你不是他…………你是守望者…………。",
        "\t[守望者,N724]\b[this,6,2]吾之身份，不足为耳，现在的主角应该是你才对。",
        "\t[守望者,N724]\b[this,6,2]本来，你应该像其他人一样，被时间长河所吞噬。",
        "\t[守望者,N724]\b[this,6,2]但是我现在不仅能够感受你那亘古不变的情感，而且我还感受到了来自那个世界所传递的情感。",
        "\t[守望者,N724]\b[this,6,2]似乎是有人不愿意让你就此消散。",
        "\t[仙琳,N1397]\b[this,6,10]………………",
        "\t[守望者,N724]\b[this,6,2]现在，就让你看看你想看到的一切吧！",
        {
            "type": "showImage",
            "code": 1,
            "image": "stop7.jpg",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        "\t[仙琳]小粽！！星姐姐！！",
        "\t[仙琳]他们怎么了，怎么伤痕累累……",
        "\t[守望者]你看前面。",
        "仙琳看到了魔王",
        "\t[仙琳]他是谁，为什么小粽他们要与他拼杀？",
        "\t[守望者]他就是这座魔塔的主宰者——魔王！",
        "\t[仙琳]魔王吗？",
        "\t[仙琳]是吗……小粽他已经这么强了呀……",
        {
            "type": "hideImage",
            "code": 1,
            "time": 500
        },
        "\t[守望者,N724]\b[this,6,2]你想陪伴在他身边吗？",
        "\t[仙琳,N1397]\b[this,6,10]想！非常想！！我想永远与小粽在一起！",
        "\t[守望者,N724]\b[this,6,2]是吗？不过当我说：魔王其实是你父亲之后，你的选择是什么呢？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ]
        },
        "\t[仙琳,N1397]\b[this,6,10]什么？魔王他……他是我的亲生父亲吗？！",
        "\t[守望者,N724]\b[this,6,2]虽然这对于你来说难以接受，但现实便是如此。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "守望者把魔王的身份以及过去告诉给了仙琳。",
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[仙琳,N1397]\b[this,6,10]这…………",
        "\t[守望者,N724]\b[this,6,2]一边是你最爱的人，一边是你的亲生父亲。所以你的选择是什么呢？",
        "\t[仙琳,N1397]\b[this,6,10]…………",
        "\t[仙琳,N1397]\b[this,6,10]………………",
        "\t[仙琳,N1397]\b[this,6,10]……………………",
        "\t[仙琳,N1397]\b[this,6,10]我选择小粽这里。",
        "\t[守望者,N724]\b[this,6,2]哦？为什么呢，魔王可是你的亲生父亲呢。为什么你会选择一个外来人呢？",
        "\t[仙琳,N1397]\b[this,6,10]首先，小粽他不是外来人，他是我最珍视的人，他无时无刻不都在呵护我守护我。",
        "\t[仙琳,N1397]\b[this,6,10]而相反，魔王他虽然是我的亲生父亲，但是我从他身上并没有感受到亲情的存在。而我从小粽身上却感受到了这一点…………",
        "\t[仙琳,N1397]\b[this,6,10]所以这便是我的选择！",
        "\t[守望者,N724]\b[this,6,2]……是吗？吾知晓了。",
        "\t[守望者,N724]\b[this,6,2]去吧，离开这里吧。就让世人看一看属于你的故事吧！",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                10
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "remove": true,
            "time": 0
        },
        "\t[守望者,N724]\b[this,6,2]......................",
        "\t[守望者,N724]\b[this,6,2]\\d花开花落终有时，相逢相聚本无意啊。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setVolume",
            "value": 0,
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        },
        {
            "type": "unfollow",
            "name": "xy.png"
        },
        {
            "type": "unfollow",
            "name": "jwt.png"
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "floorId": "MT440",
            "remove": true,
            "time": 0
        },
        {
            "type": "changeFloor",
            "floorId": "MT440",
            "loc": [
                6,
                7
            ],
            "direction": "up",
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,724,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}