main.floors.MT431=
{
    "floorId": "MT431",
    "title": "未有之地",
    "name": "未有之地",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "showStatusBar"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "up",
                "up"
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]这…………怎么会这样。",
        "\t[星钰,N1196]\b[hero,1]梦儿居然………….真的如同那个谶祖所说…………离开了他！",
        "\t[君无天,N1195]\b[hero,2]………………有问题，很有问题！",
        "\t[小粽,hero]\b[hero]星天前辈，您怎么看？",
        "\t[君无天,N1195]\b[hero,2]我怀疑………………梦儿的离去可能与谶祖有关！",
        "\t[星钰,N1196]\b[hero,1]这…………仔细一想的确很不对劲。但是他是怎么做到的呢…………明明梦儿不是傀儡...。",
        "\t[君无天,N1195]\b[hero,2]……………………。",
        "\t[小粽,hero]\b[hero]啊！小心！！这些元素已经带有一种非常悲伤的气息了！！而且实力与之前相比更加强大了！",
        "\t[君无天,N1195]\b[hero,2]抱定本心！小心不要受到精神污染了！！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT431\", ]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==1)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "remove": true
                    }
                ]
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {
        "6,0": [
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "时间回到十七年前",
            {
                "type": "hideStatusBar"
            },
            {
                "type": "setHeroIcon",
                "name": "hero2.png"
            },
            {
                "type": "unfollow",
                "name": "xy.png"
            },
            {
                "type": "unfollow",
                "name": "jwt.png"
            },
            {
                "type": "changeFloor",
                "floorId": "MT432",
                "loc": [
                    6,
                    4
                ],
                "direction": "down",
                "time": 500
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 17, 17, 17, 17, 17, 17,1378, 17, 17, 17, 17, 17, 17],
    [ 17,240007,240007,240007,240007,240007,670,240007,240007,240007,240007,240007, 17],
    [ 17,240007,1377,334,1374,350,1377,334,1374,350,1377,240007, 17],
    [ 17,240007,350,240007,366,240007,366,240007,366,240007,334,240007, 17],
    [ 17,240007,1376,1273,1377,1273,1374,1273,1377,1273,1376,240007, 17],
    [ 17,240007,334,240007,366,240007,366,240007,366,240007,350,240007, 17],
    [ 17,240007,1376,1273,1377,1273,1377,1273,1377,1273,1376,240007, 17],
    [ 17,240007,350,240007,366,240007,366,240007,366,240007,334,240007, 17],
    [ 17,240007,1377,334,1376,350,1374,334,1376,350,1377,240007, 17],
    [ 17,1275,240007,240007,240007,240007,1276,240007,240007,240007,240007,1275, 17],
    [ 17, 81,240007,240007,240007,240007, 22,240007,240007,240007,240007,1276, 17],
    [ 17,1273,1274, 81,1274, 81,  0, 82,1275,1275,1273, 82, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}