main.floors.MT435=
{
    "floorId": "MT435",
    "title": "未有之地",
    "name": "未有之地",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showStatusBar"
        },
        "\t[星钰,N1196]\b[hero,1]呜呜………………怎么会这样…………梦姐姐…………。",
        "\t[君无天,N1195]\b[hero,2]………………仙月……………仙梦…………仙琳…………青年……以及剑祖师父，…………原来如此…………原来如此…………怪不得前辈不愿意跟着我们…………原来是这样啊…………。",
        "\t[君无天,N1195]\b[hero,2]这个故事的女主，就是仙月前辈与剑祖师父的女儿，仙琳的亲生母亲！",
        "\t[君无天,N1195]\b[hero,2]而男主，则是\r[red]————魔王！！",
        "\t[星钰,N1196]\b[hero,1]怎么会这样…………仙琳妹妹……居然是魔王的女儿…………这…………而且魔王……",
        "\t[君无天,N1195]\b[hero,2]……这是我大胆分析出来的，一.仙月前辈不愿意跟我们一起阻止魔王就说明魔王与仙月前辈有密切关系，从前辈讲的故事也能看出。",
        "\t[君无天,N1195]\b[hero,2]二.魔王作为万魔之主，本应该是魔物担当的，结果在这里却出现的都是人类的记忆片段。",
        "\t[君无天,N1195]\b[hero,2]也就是说：魔王以前就是人类！",
        "\t[君无天,N1195]\b[hero,2]三.之前那个跳崖的“梦”，她的外表与仙梦一模一样，这也让我更加肯定了我的决策。",
        "\t[君无天,N1195]\b[hero,2]而与此同时我也终于明白了出魔王完成造神计划并不只是为了成为神，更重要的是让仙梦——\r[red]复活！！！",
        "\t[星钰,N1196]\b[hero,1]这…………的确如父亲大人所说的那番…………不过…………小粽…………你……",
        "\t[小粽,hero]\b[hero]…………我没事。",
        "\t[星钰,N1196]\b[hero,1]诶？",
        "\t[君无天,N1195]\b[hero,2]嗯？",
        "\t[君无天,N1195]\b[hero,2]……………………。",
        "\t[小粽,hero]\b[hero]我只想知道：既然仙琳是他的女儿，那他为什么不保护好他的亲生骨肉，导致仙琳为了我们付出了生命的代价！",
        "\t[君无天,N1195]\b[hero,2]这……的确是个谜题。为什么魔王不照护好自己的女儿呢……",
        "\t[星钰,N1196]\b[hero,1]父亲大人！小粽！你们看！这些元素所蕴含的情感好悲伤…………好痛苦……",
        "\t[星钰,N1196]\b[hero,1]如此强烈而庞大的情感…………魔王究竟有多么爱梦姐姐呀…………。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT435\", ]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==1)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "remove": true
                    },
                    {
                        "type": "insert",
                        "loc": [
                            5,
                            0
                        ]
                    }
                ]
            }
        ],
        "5,0": [
            "\t[君无天,N1195]\b[hero,2]果然.....这个故事的男主就是魔王啊.....。",
            "\t[君无天,N1195]\b[hero,2]蕴含的情感已经化为人型了......你究竟是有多么执着啊......。",
            "\t[死亡,E1381]\b[this,6,2]我....一定会让....你......。",
            "\t[君无天,N1195]\b[hero,2]小粽，星钰....让我们....给他一个痛快吧！"
        ],
        "7,0": [],
        "6,0": []
    },
    "changeFloor": {},
    "afterBattle": {
        "6,1": [
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "时间回到之前记忆片段之后.....",
            {
                "type": "hideStatusBar"
            },
            {
                "type": "setHeroIcon",
                "name": "hero2.png"
            },
            {
                "type": "unfollow",
                "name": "xy.png"
            },
            {
                "type": "unfollow",
                "name": "jwt.png"
            },
            {
                "type": "changeFloor",
                "floorId": "MT433",
                "loc": [
                    10,
                    111
                ],
                "direction": "down",
                "time": 500
            },
            {
                "type": "insert",
                "loc": [
                    0,
                    0
                ],
                "floorId": "MT433"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [1274, 81,1275,1274,240007, 17,  0, 17,240007,1275,1275,1276, 82],
    [1275,240007,240007,240007,240007,240007,1381,240007,240007,240007,240007,240007,1273],
    [ 81,240007,366,1356,382,1378,670,1378,382,1356,366,240007,1275],
    [1273,240007,1382,382,1378,382,1382,382,1378,382,1382,240007,1276],
    [1275,240007,382,1382,382,1382,366,1382,382,1382,382,240007, 82],
    [ 81,240007,1374,382,1378,366,1382,366,1378,382,1374,240007,1273],
    [1273,240007,382,1382,366,1382,1276,1382,366,1382,382,240007,1275],
    [1275,240007,1374,366,1378,1276,1377,1276,1378,366,1374,240007,1276],
    [ 81,240007,382,1372,366,1356,1276,1356,366,1372,382,240007, 82],
    [1273,240007,1382,382,1377,366,1372,366,1377,382,1382,240007,1274],
    [1275,240007,366,1356,382,1378, 22,1378,382,1356,366,240007,1276],
    [ 81,240007,240007,240007,240007,240007, 22,240007,240007,240007,240007,240007, 82],
    [1275, 81,1275, 81,1275, 81, 22, 82,1276,1274, 82,1276,1274]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0, 17,  0,  0,  0, 17,  0,  0,  0,  0],
    [  0,  0,  0,  0, 17, 17,  0, 17, 17,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}