main.floors.MT443=
{
    "floorId": "MT443",
    "title": "未知地带（回忆）",
    "name": "未知地带（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[魔王,N831]\b[this,6,4]…………从现在起，以前作为人类的我已经死去了，而现在我就是——",
        "\t[魔王,N831]\b[this,6,4]\r[red]魔王",
        "\t[魔王,N831]\b[this,6,4]梦儿，我一定会完成造神计划的，并且我会让你活过来的，并且…………",
        "\t[魔王,N831]\b[this,6,4]\r[red]对这个世界重新洗牌！！",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "setBlock",
            "number": "N1199",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ]
        },
        "\t[仙月,N1199]\b[this,6,7]魔王？？？！！你不是被永劫冰牢给冰封住了吗？！！",
        "\t[魔王,N831]\b[this,6,4]初次见面，岳母大人！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ]
        },
        "\t[仙月,N1199]\b[this,6,7]！！！你是？！！",
        "\t[魔王,N831]\b[this,6,4]自我介绍一下，吾是仙梦的爱人，也是这座魔塔的魔王！",
        "\t[仙月,N1199]\b[this,6,7]仙梦呢？她去哪里了！为什么我感受不到她的气息了！",
        "\t[魔王,N831]\b[this,6,4]梦儿她已经不在了…………",
        "\t[仙月,N1199]\b[this,6,7]什么！！怎么回事！发生了什么！",
        "\t[魔王,N831]\b[this,6,4]梦儿她为了救我，用了你们仙子一族的秘法。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                7
            ]
        },
        "\t[仙月,N1199]\b[this,6,7]！！！！！",
        "\t[魔王,N831]\b[this,6,4]而在梦儿不在之后，我也变成为了魔王！",
        "\t[仙月,N1199]\b[this,6,7]你知道你自己在说些什么吗？！你明明是纯粹的人类，怎么可能成为魔王呢！别以为披着一个魔王一样的外衣就可以蒙骗自己！！",
        "\t[魔王,N831]\b[this,6,4]我当然知道自己在说些什么，我现在不仅成为了魔王，更要去完成造神计划！成为神灵去复活梦儿！",
        "\t[仙月,N1199]\b[this,6,7]你已经疯了…………什么复活，什么神灵，这些事情明明都是不可能实现的！",
        "\t[仙月,N1199]\b[this,6,7]我知道仙梦的死对你来说打击非常大，但是你必须要面对现实啊。",
        "\t[魔王,N831]\b[this,6,4]对呀，我是在面对现实啊，成为神灵，将梦儿复活过来，多么现实啊！",
        "\t[仙月,N1199]\b[this,6,7]…………你若执意如此，我只有强行打晕你了！",
        "\t[仙月,N1199]\b[this,6,7]生命·天光！",
        "\t[魔王,N831]\b[this,6,4]圣魔决·生灵之剑！",
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                6,
                7
            ]
        },
        "\t[仙月,N1199]\b[this,6,7]呃！",
        "\t[仙月,N1199]\b[this,6,7]怎么可能！你的实力怎么可能达到魔王的范畴了！！",
        "\t[魔王,N831]\b[this,6,4]看到了吗？这就是魔王的力量，虽然我才初步掌握，一旦我完全掌握，我便能成为神的存在！",
        "\t[仙月,N1199]\b[this,6,7]快清醒过来！生命·自然！",
        "\t[魔王,N831]\b[this,6,4]该清醒的是你！圣魔决·死冥玄海！",
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "move",
            "loc": [
                6,
                7
            ],
            "time": 100,
            "keep": true,
            "steps": [
                "backward"
            ]
        },
        "\t[仙月,N1199]\b[this,6,8]呃！",
        "\t[魔王,N831]\b[this,6,4]放弃吧，你不是我的对手。",
        "\t[仙月,N1199]\b[this,6,8]你……为什么！给我……清醒过来！",
        "\t[魔王,N831]\b[this,6,4]圣魔决·天魔芸汐！",
        {
            "type": "playSound",
            "name": "050-Explosion03.ogg"
        },
        {
            "type": "animate",
            "name": "attack11",
            "loc": [
                6,
                8
            ]
        },
        {
            "type": "move",
            "loc": [
                6,
                7
            ],
            "time": 100,
            "keep": true,
            "steps": [
                "backward",
                "backward"
            ]
        },
        "\t[仙月,N1199]\b[this,6,10]啊！！",
        "\t[魔王,N831]\b[this,6,4]……回去吧，替我照护好仙琳。",
        "\t[仙月,N1199]\b[this,6,10]咳咳咳！你…………给我回来！",
        "\t[魔王,N831]\b[this,6,4]对了这个东西交给你，就当作我送给仙琳的礼物吧。",
        "魔王将仙梦送她的定情信物丢给了仙月。",
        "\t[仙月,N1199]\b[this,6,10]哈哈哈…………那为什么你不亲自回去照护呢…………。",
        "\t[魔王,N831]\b[this,6,4]…………以后再见了，请！",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    4
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[仙月,N1199]\b[this,6,10]\r[red]混蛋！你给我回来！回来啊！！",
        "\t[仙月,N1199]\b[this,6,10]\r[red]你这个孽畜！孽畜！！",
        {
            "type": "screenFlash",
            "color": [
                255,
                0,
                0,
                1
            ],
            "time": 500,
            "times": 1
        },
        "\t[仙月,N1199]\b[this,6,10]\r[red]咳咳咳咳咳咳咳！！！",
        "\t[仙月,N1199]\b[this,6,10]为什么…………为什么会是你…………来到我们这里…………",
        "\t[仙月,N1199]\b[this,6,10]为什么啊！！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "十六年前……",
        {
            "type": "changeFloor",
            "floorId": "MT444",
            "loc": [
                6,
                134
            ],
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [240115,240129,240129,240129,240129,240129,240129,240129,240129,240129,240129,240129,240131],
    [240122,240081,240081,240081,240081,240081,240081,240081,240081,240081,240081,240081,240120],
    [240122,240089,240089,240089,240089,240089,  0,240089,240089,240089,240089,240089,240120],
    [240122,240097,240097,240097,240097,240097,  0,240097,240097,240097,240097,240097,240120],
    [240122,  0,  0,  0,  0,  0,831,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240122,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,240120],
    [240099,240105,240105,240105,240105,240106,  0,240105,240105,240105,240105,240105,240091],
    [240107,240113,240113,240113,240113,240114,  0,240112,240113,240113,240113,240113,240123],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121],
    [240121,240121,240121,240121,240121,240122,  0,240120,240121,240121,240121,240121,240121]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,240089,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,240097,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}