main.floors.MT449=
{
    "floorId": "MT449",
    "title": "魔塔之巅",
    "name": "魔塔之巅",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "holy4.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "blockWall",
    "firstArrive": [
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "setVolume",
            "value": 0,
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "disorder10.mp3",
            "keep": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "function",
            "function": "function(){\ncore.removeMaps(\"MT0\", \"MT448\")\n}"
        },
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "20000000"
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "value": "200000"
        },
        {
            "type": "setValue",
            "name": "status:def",
            "value": "200000"
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "value": "1000000"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:yellowKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:blueKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "item:redKey",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "addValue",
            "name": "item:I507",
            "value": "-114514"
        },
        {
            "type": "addValue",
            "name": "item:centerFly",
            "value": "-114514"
        },
        {
            "type": "addValue",
            "name": "item:pickaxe",
            "value": "-114514"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[邪神·谶,E1414]\b[this,6,8]造神计划！就此落幕！！",
        "\t[邪神·谶,E1414]\b[this,6,8]接下来，就让你们看看真正神灵的力量吧！",
        "\t[邪神·谶,E1414]\b[this,6,8]\r[red]蝼蚁们！！",
        "邪神·谶随口一言，在场所有人无论是身体，还是思维，都再次不得动弹！",
        "无论众人做出怎样身体与思维的应急反应，在这股极其恐怖的力量面前如同虚设。",
        "\t[邪神·谶,E1414]\b[this,6,8]第一个就先把你解决掉吧！",
        "邪神·谶那看似没有任何能量波动的的右手逐渐伸向小粽！",
        "\t[小粽,N724]\b[this,6,11](不..............好................！）",
        {
            "type": "playBgm",
            "name": "god2.mp3",
            "keep": true
        },
        "\t[？？？]邪神·谶？没想到你不仅修复好了自己的神识，还能够无视世界线的压制来到这里！",
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                8
            ]
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "jump",
            "from": [
                6,
                8
            ],
            "to": [
                6,
                5
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "screenFlash",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 100,
            "times": 3,
            "async": true
        },
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "setBlock",
            "number": "E889",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[邪神·谶,E1414]\b[this,6,5]守望者弃坑立粽？看来真正的主角还是在吾书写之下强行提前登场了啊！",
        "\t[弃坑立粽,E889]\b[this,6,8]邪神·谶，这一次，我不会再让你破坏这条世界线！",
        "\t[邪神·谶,E1414]\b[this,6,5]哦？是吗，就凭你一个人？你能吗？！",
        {
            "type": "callBook"
        },
        "\t[邪神·谶,E1414]\b[this,6,5]明白了吗？就算是你也不是我的对手！",
        "\t[邪神·谶,E1414]\b[this,6,5]不过那个在我笔下叫记录者的小家伙呢？他怎么没有登场呢。",
        "\t[弃坑立粽,E889]\b[this,6,8]...........................",
        "\t[邪神·谶,E1414]\b[this,6,5]罢了，无论如何，一切都将终结！",
        "\t[弃坑立粽,E889]\b[this,6,8]你说的没错，我的确没有与你匹敌的实力...但是！",
        "\t[弃坑立粽,E889]\b[this,6,8]别忘了我可不是一个人！",
        "\t[邪神·谶,E1414]\b[this,6,5]哦？你打算将一切的希望的交给这个叫小粽的小家伙吗。",
        "\t[邪神·谶,E1414]\b[this,6,5]不过你真的以为现在的他拥有担负这一切的能力吗？",
        "\t[弃坑立粽,E889]\b[this,6,8]就算没有，现在也得有！如果人们失去了信念，终将会被黑暗所吞噬！",
        "\t[邪神·谶,E1414]\b[this,6,5]哈哈哈哈哈哈哈哈！！我突然想到一个十分有趣的游戏呢。不如现在就开始吧！",
        "\t[邪神·谶,E1414]\b[this,6,5]我将给予你们七天时间，在这七天内你们可以想尽一切办法提升自己的实力，在七天之后我将会再度降临。",
        "\t[邪神·谶,E1414]\b[this,6,5]不知道七天之后你们是否能够给我带来比现在更为绝望的情感呢？哈哈哈哈哈哈哈哈！！",
        "\t[邪神·谶,E1414]\b[this,6,5]加油吧！弃坑立粽，以及既定之人小粽。哈哈哈哈哈哈哈哈！！！",
        {
            "type": "playSound",
            "name": "139-Darkness02.ogg"
        },
        {
            "type": "animate",
            "name": "attack18",
            "loc": [
                6,
                5
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "remove": true,
            "time": 0
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "E886",
            "loc": [
                [
                    6,
                    8
                ]
            ],
            "time": 0
        },
        "\t[弃坑立粽,E886]\b[this,6,8]....................",
        "\t[弃坑立粽,E886]\b[this,6,8]解！",
        {
            "type": "playSound",
            "name": "stop1.wav"
        },
        {
            "type": "changeFloor",
            "floorId": "MT450",
            "loc": [
                3,
                144
            ],
            "time": 0
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 17,130112, 17, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,312,312,312, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17, 17,312,  0,312, 17, 17, 17, 17, 17],
    [ 17, 17, 17, 17,312,312,  0,  0,312, 17, 17, 17, 17],
    [ 17, 17, 17,312,312,  0,1414,  0,312,312, 17, 17, 17],
    [ 17, 17,  0,  0,  0,1195,  0,1196,  0,  0,  0, 17, 17],
    [ 17,312,312,312,312,  0,1403,  0,312,312,312,312, 17],
    [312,312,312,312,312,312,1398,312,312,312,312,312,312],
    [312,312,312,312,312,312,  0,312,312,312,312,312,312]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,312,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,312,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,312,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,312,312,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,312,312,312,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,312,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,130112,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,312,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,312,312,312,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,312,130113,312,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,312,312,130112,130120,312,  0,  0,  0,  0],
    [  0,  0,  0,312,312,130114,312,130128,312,312,  0,  0,  0],
    [  0,  0,312,312,312,312,312,312,312,312,312,  0,  0],
    [  0,312,312,312,312,312,312,312,312,312,312,312,  0],
    [312,312,312,312,312,312,312,312,312,312,312,312,312],
    [312,312,312,312,312,312,312,312,312,312,312,312,312]
],
    "fg2map": [

]
}