main.floors.MT447=
{
    "floorId": "MT447",
    "title": "生命之森（回忆）",
    "name": "生命之森（回忆）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 5000,
    "defaultGround": "grass",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,0": [
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        8
                    ]
                ],
                "remove": true,
                "time": 0,
                "async": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        8
                    ]
                ],
                "remove": true,
                "time": 0
            },
            {
                "type": "playBgm",
                "name": "start.mp3",
                "keep": true
            },
            {
                "type": "addValue",
                "name": "item:book",
                "value": "1"
            },
            {
                "type": "addValue",
                "name": "item:fly",
                "value": "1"
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[小粽]时间所剩无几。",
            "\t[小粽]离魔王完成造神计划仅剩下一个月的时间了......。",
            "\t[小粽]听星天前辈说如果魔王完成了造神计划的话，整个世界都会陷入一场腥风血雨当中！",
            "\t[小粽]所以我必须阻止魔王！绝对不能让他成功！",
            "\t[小粽]这不仅仅要是像在童话故事里的勇者那样——去拯救世界，更是......。",
            {
                "type": "changeFloor",
                "floorId": "MT448",
                "loc": [
                    6,
                    9
                ],
                "direction": "up",
                "time": 500
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[仙琳,E962]\b[this,6,6]再见了小粽，谢谢你教会了我你们人类的情感\n在未来的道路上你一定要好好活着哟！",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "\t[小粽]也为了你！仙琳！！",
            "\t[小粽]我一定会实现当初你对我许下的诺言，哪怕为此......",
            {
                "type": "setBlock",
                "number": "N1196",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "floorId": "MT447",
                "time": 0
            },
            {
                "type": "changeFloor",
                "floorId": "MT447",
                "loc": [
                    6,
                    6
                ],
                "direction": "down",
                "time": 500
            },
            {
                "type": "function",
                "function": "function(){\ncore.removeMaps(\"MT0\", \"MT311\")\n}"
            },
            {
                "type": "playBgm",
                "name": "slience1.mp3",
                "keep": true
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "animate",
                "name": "emmslow",
                "loc": "hero"
            },
            "\t[星钰,N1196]\b[this,6,7]怎么了，小粽？",
            "\t[星钰,N1196]\b[this,6,7]是在想什么心事吗？",
            "\t[小粽,hero]\b[this,6,6]......我想起仙琳了。",
            "\t[星钰,N1196]\b[this,6,7]...............是吗。",
            "\t[小粽,hero]\b[this,6,6]嗯，当初我记得她希望有朝一日她能够离开这座高塔......去看一看我那里的世界。",
            "\t[小粽,hero]\b[this,6,6]只不过....她为了保护我们....付出了自己的生命。",
            "\t[小粽,hero]\b[this,6,6]也就是说我这条命——是她给的！",
            "\t[星钰,N1196]\b[this,6,7].......................",
            "\t[星钰,N1196]\b[this,6,7]小粽你.........。",
            "\t[小粽,hero]\b[this,6,6].......不过，这些悲剧都已经发生了，单纯的沉湎过去毫无意义。",
            "\t[小粽,hero]\b[this,6,6]现在我能做的只有继续前进，并且珍惜眼前的事物。",
            "\t[星钰,N1196]\b[this,6,7]嗯....我相信你！",
            "\t[星钰,N1196]\b[this,6,7]你一定能做到的！",
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "setBlock",
                "number": "N1195",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "floorId": "MT447",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unexpected2",
                "loc": "hero",
                "async": true
            },
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unexpected2",
                "loc": [
                    6,
                    7
                ]
            },
            {
                "type": "setBlock",
                "number": "N1250",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "floorId": "MT447",
                "time": 0
            },
            "\t[小粽,hero]\b[this,6,6]星天前辈好。",
            "\t[星钰,N1250]\b[this,6,7]诶？父亲大人，你回来了！",
            "\t[君无天,N1195]\b[this,6,8]嗯，在仙月前辈的帮助下，我终于把最终的传送门给创造出来了！",
            "\t[君无天,N1195]\b[this,6,8]也就是说我们可以开始启程了！",
            "\t[小粽,hero]\b[this,6,6]是吗，终于要来了吗！",
            "\t[星钰,N1250]\b[this,6,7]对了，父亲大人，仙月奶奶不跟我们一起去吗？",
            "\t[君无天,N1195]\b[this,6,8]她老人家......不愿意跟我们一起去。",
            "\t[星钰,N1250]\b[this,6,7]啊？为什么呀，难道仙月奶奶有什么苦衷吗？",
            "\t[君无天,N1195]\b[this,6,8]......或许吧。",
            "\t[小粽,hero]\b[this,6,6].............",
            {
                "type": "setBlock",
                "number": "N1199",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "floorId": "MT447",
                "time": 500,
                "async": true
            },
            {
                "type": "setBlock",
                "number": "N1197",
                "loc": [
                    [
                        7,
                        10
                    ]
                ],
                "floorId": "MT447",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unexpected2",
                "loc": "hero",
                "async": true
            },
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unexpected2",
                "loc": [
                    6,
                    7
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "jump.mp3"
            },
            {
                "type": "animate",
                "name": "unexpected2",
                "loc": [
                    6,
                    8
                ]
            },
            {
                "type": "setBlock",
                "number": "N1252",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "floorId": "MT447",
                "time": 0
            },
            "\t[星钰,N1250]\b[this,6,7]仙月奶奶好。",
            "\t[君无天,N1252]\b[this,6,8]仙月前辈？！！您怎么来了！",
            "\t[仙月,N1199]\b[this,6,9]我来是为了了解一些因果。",
            "\t[君无天,N1252]\b[this,6,8]因果？什么因果。",
            "\t[小粽,hero]\b[this,6,6]...............",
            "\t[仙月,N1199]\b[this,6,9]小粽，为何要躲着我呢？",
            {
                "type": "setBlock",
                "number": "N823",
                "loc": [
                    [
                        6,
                        7
                    ]
                ],
                "floorId": "MT447",
                "time": 0
            },
            {
                "type": "move",
                "loc": [
                    6,
                    7
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "left"
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        5,
                        7
                    ]
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        6,
                        8
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "N1133",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "floorId": "MT447",
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N1250",
                "loc": [
                    [
                        5,
                        7
                    ]
                ],
                "floorId": "MT447",
                "time": 0
            },
            {
                "type": "move",
                "loc": [
                    6,
                    8
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "up",
                    "right"
                ]
            },
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        7,
                        7
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "N1252",
                "loc": [
                    [
                        7,
                        7
                    ]
                ],
                "floorId": "MT447",
                "time": 0
            },
            "\t[小粽,hero]\b[this,6,6]......仙月奶奶好。",
            "\t[仙月,N1199]\b[this,6,9]事情的前因后果其实我已经知道了。",
            "\t[小粽,hero]\b[this,6,6]............",
            "\t[仙月,N1199]\b[this,6,9]或许......这就是命运吧。",
            "\t[仙月,N1199]\b[this,6,9]当初仙琳她母亲为了她所爱之人选择了燃烧自己生命之火。",
            "\t[仙月,N1199]\b[this,6,9]而现在....仙琳这小丫头为了你也做出了与她母亲一样的选择.........。",
            "\t[小粽,hero]\b[this,6,6]是我当初太无能了，才让她.....",
            "\t[仙月,N1199]\b[this,6,9]不，这与力量无关，这是命运的选择。",
            "\t[仙月,N1199]\b[this,6,9]在当初......仙琳她父亲的实力并不逊色于当初在阴阳圣坛时的你.....但还是摆脱不了这早已既定的命运......",
            "\t[小粽,hero]\b[this,6,6]对了，仙月奶奶 ，既然仙琳她父亲实力都凌驾于巅峰圣护之手级别的高手，那为什么我却从来都没从仙琳那里或者在其他地方听说过她父亲的信息呢？",
            "\t[仙月,N1199]\b[this,6,9]...............",
            "\t[仙月,N1199]\b[this,6,9]其实.....在仙梦那孩子死去之后.....他死了。",
            "\t[小粽,hero]\b[this,6,6]死了？此言何意。",
            "\t[仙月,N1199]\b[this,6,9]并不是身躯上的死去，而是精神上的死去。",
            "\t[小粽,hero]\b[this,6,6]...............因极度悲痛而性情大变吗？",
            "\t[仙月,N1199]\b[this,6,9]嗯，他从一个阳光青年，变成了一个性情冰冷的人。",
            "\t[仙月,N1199]\b[this,6,9]在我最后一次见到他时是在八年前，他跟我说——总有一天他会把一个完整的仙梦带回来的.........。",
            "\t[君无天,N1252]\b[this,7,7]嗯.......他的意思是说他会在未来复活仙梦吗？",
            "\t[仙月,N1199]\b[this,6,9]嗯........就是这个意思。",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero",
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    7
                ]
            },
            "\t[小粽,hero]\b[this,6,6]什么？！",
            "\t[星钰,N1250]\b[this,5,7]这......仙琳母亲不是已经不在了吗？这怎么可能呢！",
            "\t[星钰,N1250]\b[this,5,7]人真的可以死而复生吗？.......",
            "\t[仙月,N1199]\b[this,6,9]这个问题无人知晓.......",
            "\t[小粽,hero]\b[this,6,6]仙月奶奶，那您应该劝说过他吧。复活死者，这根本就不可能呀！",
            "\t[仙月,N1199]\b[this,6,9]..........说过，可是毫无意义。",
            "\t[小粽,hero]\b[this,6,6]这........。",
            "\t[仙月,N1199]\b[this,6,9]好了，这些事情都是老黄历了，没有必要再继续讨论了。",
            "\t[仙月,N1199]\b[this,6,9]传送门已经搭建，你们是时候该离开生命之森了。",
            "\t[仙月,N1199]\b[this,6,9]我就让罗天这小家伙跟你们一起去吧，剩下的全靠你们自己的了！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        9
                    ]
                ],
                "remove": true,
                "time": 500
            },
            "\t[小粽,hero]\b[this,6,6]............",
            "\t[星钰,N1250]\b[this,5,7]............",
            "\t[君无天,N1252]\b[this,7,7]...........哎，仙月前辈您还是与之前一样的选择吗？",
            {
                "type": "setBlock",
                "number": "N773",
                "loc": [
                    [
                        7,
                        10
                    ]
                ],
                "time": 0
            },
            {
                "type": "move",
                "loc": [
                    7,
                    10
                ],
                "time": 500,
                "keep": true,
                "steps": [
                    "left"
                ]
            },
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        6,
                        10
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "N1197",
                "loc": [
                    [
                        6,
                        10
                    ]
                ],
                "time": 0
            },
            "\t[罗天,N1197]\b[this,6,10]或许仙月老师有她自己的想法吧。",
            "\t[君无天,N1252]\b[this,7,7]嗯..........你是.....",
            "\t[星钰,N1250]\b[this,5,7]父亲大人，他就是曾经的音律星尊。",
            "\t[君无天,N1252]\b[this,7,7]哦？",
            "\t[罗天,N1197]\b[this,6,10]嗯，我之前所居住的音律塔就是令爱所打造的。",
            "\t[君无天,N1252]\b[this,7,7]你说你是前辈的亲传弟子？",
            "\t[罗天,N1197]\b[this,6,10]不敢当，不敢当，我顶多就算个记名弟子罢了。",
            "\t[君无天,N1252]\b[this,7,7]哈，能让前辈收为弟子的，一定有其过人之处。",
            "\t[君无天,N1252]\b[this,7,7]不过...你虽然身为音律星尊，但在魔塔势力内还是属于偏基层的存在，按道理你是不可能知晓仙月前辈的居住地呀。",
            "\t[君无天,N1252]\b[this,7,7]你是怎么来到这里的呢？",
            "\t[罗天,N1197]\b[this,6,10]嗯.........应该仙琳把我送到这里的。",
            "\t[罗天,N1197]\b[this,6,10]当初我与小粽决战的时候落败，在那个时候我本以为我已经死去了，结果醒来的时候我却已经在生命之森了。",
            "\t[罗天,N1197]\b[this,6,10]而在那时是仙月老师救了我，并且说是她外孙女把我带过来的，也就是仙琳。",
            "\t[君无天,N1252]\b[this,7,7]原来如此......",
            "\t[罗天,N1197]\b[this,6,10]小粽，当初你让仙琳把我救回到生命之森应该是你要求吧。",
            "\t[小粽,hero]\b[this,6,6]嗯，因为我觉得当初罗天你对我的敌意只是因为我打破了音律塔的宁静，而且....",
            "\t[小粽,hero]\b[this,6,6]\\d我觉得你是一个至信至情的人。",
            "\t[罗天,N1197]\b[this,6,10]哈，是吗.........你也一样呀。",
            "\t[罗天,N1197]\b[this,6,10]小粽，谢谢你。",
            "\t[小粽,hero]\b[this,6,6]嗯，谢我干什么？",
            {
                "type": "setVolume",
                "value": 0,
                "time": 500
            },
            "\t[罗天,N1197]\b[this,6,10]因为你替我杀了圣羽洛斯那个禽兽！",
            "\t[小粽,hero]\b[this,6,6]圣羽洛斯？！",
            "\t[罗天,N1197]\b[this,6,10]那个家伙......毁了我的一切....",
            "\t[小粽,hero]\b[this,6,6]嗯，怎么回事？",
            "\t[罗天,N1197]\b[this,6,10]是这样的.......",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "罗天把过去发生的一切都告诉了小粽他们",
            "（关于罗天的故事详细请看音律塔结尾剧情）",
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "time": 500
            },
            {
                "type": "setVolume",
                "value": 90,
                "time": 0,
                "async": true
            },
            "\t[罗天,N1197]\b[this,6,10]故事就是以这样的结局完结了......",
            "\t[星钰,N1250]\b[this,5,7]圣羽洛斯！果然是个彻头彻尾的疯子加变态！！",
            "\t[君无天,N1252]\b[this,7,7]圣羽洛斯，真是一个令人作呕的家伙，为了所谓的实验，竟然做到这种份上。",
            "\t[君无天,N1252]\b[this,7,7]真不愧是他呢！",
            "\t[小粽,hero]\b[this,6,6].........罗天，这段路并不好走吧.......。",
            "\t[罗天,N1197]\b[this,6,10]..........是呀，你也一样呢。",
            "\t[罗天,N1197]\b[this,6,10]算了，既然大仇得报，也没必要继续沉湎了。",
            "\t[小粽,hero]\b[this,6,6].........嗯。",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "小粽、星钰、君无天、以及罗天一起通过生命之森的传送门前往最顶层的区域：终焉之城！",
            "即使在小粽他们离开的那一刻，仙月也没有出来送别....",
            "或许仙月奶奶她是为了治疗堇才不方便告别吧，小粽心想。",
            "与此同时.......",
            {
                "type": "pauseBgm"
            },
            {
                "type": "playBgm",
                "name": "Eternity.mp3",
                "keep": true
            },
            "\t[？？？]这就是我的存在的意义吗？",
            "\t[？？？]大人的命令就是我的选择！",
            "\t[？？？]为了大人.......我可以付出一切代价！哪怕是我的生命。",
            "\t[？？？]而这一切.....都会在我手上....",
            {
                "type": "setVolume",
                "value": 0,
                "time": 500
            },
            {
                "type": "pauseBgm"
            },
            "不久之后，小粽他们来到了终焉之城的门口。",
            {
                "type": "changeFloor",
                "floorId": "MT330",
                "loc": [
                    6,
                    12
                ],
                "direction": "up",
                "time": 500
            },
            {
                "type": "waitAsync"
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [200065,200066,200067,200168,200169,200170,200171,200172,200173,200174,200049,200050,  0],
    [200073,200074,200075,200176,200177,200178,200179,200180,200181,200182,200057,  0,  0],
    [200081,200082,200083,200184,200185,200186,200187,200188,200189,200190,200191,  0,200049],
    [200050,  0,  0,  0,  0,182149,182150,182151,200197,200198,  0,  0,  0],
    [200058,200059,  0,  0,190106,182157,182158,182159,190106,  0,  0,200082,  0],
    [200050,200067,  0,  0,190114,182165,180820,182167,190114,  0,  0,  0,200048],
    [200058,200059,  0,  0,190122,  0,  0,  0,190122,  0,  0,  0,200056],
    [200066,200067,  0,  0,  0,  0,  0,  0,  0,90541,90542,90543,200081],
    [200074,200075,  0,  0,190106,  0,  0,  0,190106,90549,90550,90551,  0],
    [  0,200083,  0,  0,190114,  0,  0,  0,190114,  0,  0,200049,200080],
    [  0,200048,200049,200050,190122,  0,  0,  0,190122,  0,200056,200057,200058],
    [  0,200056,200057,200058,  0,200049,200050,200049,200050,  0,200064,200065,200066],
    [  0,200064,200065,200066,200067,200049,200056,200057,200058,200059,200072,200073,200074]
],
    "bgmap": [
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000],
    [200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000,200000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,200048,  0,200050,200051],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200058,200059],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200066,200067],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,200073,200074,200075],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,200080,200081,  0,200083],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180985,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180984,  0,200050],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,180985,  0,  0],
    [  0,  0,  0,  0,200059,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,200072,200073,200074,200075,  0,  0,  0,  0,200064,200069,200070],
    [  0,  0,200080,200081,200082,200083,  0,  0,  0,200056,200072,200077,200078],
    [200049,200050,  0,  0,  0,  0,  0,  0,  0,200064,200065,200085,200086],
    [200057,200058,200059,  0,200193,200194,200195,200196,  0,200072,  0,200056,200057],
    [200065,200066,200067,  0,  0,  0,  0,  0,  0,  0,  0,200064,200065],
    [200066,200074,200075,  0,  0,  0,182166,  0,  0,  0,  0,200072,200073],
    [  0,200082,200083,  0,182152,182153,182154,182155,182156,  0,  0,200080,200081],
    [  0,  0,  0,  0,182160,182161,182162,182163,182164,  0,  0,  0,  0],
    [200049,200050,  0,  0,182168,182169,182170,182171,182172,  0,  0,  0,  0],
    [200057,200058,200059,  0,182176,182177,182178,182179,182180,  0,  0,  0,  0],
    [200069,200070,200055,  0,182184,182185,182186,182187,182188,  0,  0,  0,  0],
    [200077,200078,200079,  0,  0,  0,  0,  0,  0,  0,200049,  0,  0],
    [200085,200086,200087,  0,200068,200077,200078,200079,  0,200060,200057,200058,  0]
],
    "fg2map": [

]
}