main.floors.MT456=
{
    "floorId": "MT456",
    "title": "世界线的终焉",
    "name": "世界线的终焉",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "universe2.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "T1158",
    "bgm": "universe.mp3",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 50000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 100000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 10000
        }
    ],
    "parallelDo": "",
    "events": {
        "6,2": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[小粽,hero]\b[hero]前辈你怎么会在这里。",
                "\t[弃坑立粽,E886]\b[this,6,2]这是我残留的一道投影，小粽，我现在有一个很严肃的问题要问你。",
                "\t[小粽,hero]\b[hero]什么问题。",
                "\t[弃坑立粽,E886]\b[this,6,2]这个问题是——你是否打算继续前进，并且你对此坚定不移。",
                "\t[小粽,hero]\b[hero]......前辈您想表达什么？",
                "\t[弃坑立粽,E886]\b[this,6,2]如果我对你说：你现在可以停止前进，前往一个没有悲剧的世界，你愿意吗？",
                "\t[小粽,hero]\b[hero]......我不是很明白。",
                "\t[弃坑立粽,E886]\b[this,6,2]你应该知道我的能力是命运逆转，我的最终底牌就是将一切化为原初，将你们带到一个没有悲剧，没有痛苦的世界。",
                "\t[弃坑立粽,E886]\b[this,6,2]简单的说就是如果你愿意的话，我可以将你所珍视的人都能安然无恙的带到另一个世界，在那个世界你们会忘记之前的旅途，忘记邪神·谶，包括我。",
                "\t[弃坑立粽,E886]\b[this,6,2]在那个世界你们可以幸福快乐的度过这一生。",
                "\t[小粽,hero]\b[hero]您为什么要这么做？",
                "\t[弃坑立粽,E886]\b[this,6,2]为了你们，也为了我自己。",
                "\t[弃坑立粽,E886]\b[this,6,2]所以你的选择是什么？",
                {
                    "type": "choices",
                    "text": "\t[小粽,hero].........",
                    "choices": [
                        {
                            "text": "好吧，我愿意前往。",
                            "action": [
                                "\t[弃坑立粽,E886]\b[this,6,2]是吗，那请现在闭上双眼吧。",
                                {
                                    "type": "pauseBgm"
                                },
                                {
                                    "type": "hideStatusBar"
                                },
                                {
                                    "type": "setCurtain",
                                    "color": [
                                        0,
                                        0,
                                        0,
                                        1
                                    ],
                                    "time": 500,
                                    "keep": true
                                },
                                "不知过了多久......",
                                "\t[仙琳]小粽，小粽。",
                                "\t[小粽]嗯....？",
                                {
                                    "type": "changeFloor",
                                    "floorId": "MT480",
                                    "loc": [
                                        144,
                                        2
                                    ],
                                    "time": 0
                                }
                            ]
                        },
                        {
                            "text": "不，我不愿意就这样逃避。",
                            "action": [
                                "\t[弃坑立粽,E886]\b[this,6,2]是吗，我尊重你的选择，现在继续前进吧。",
                                {
                                    "type": "hide",
                                    "loc": [
                                        [
                                            6,
                                            2
                                        ]
                                    ],
                                    "remove": true
                                },
                                {
                                    "type": "hide",
                                    "loc": [
                                        [
                                            6,
                                            0
                                        ]
                                    ],
                                    "remove": true
                                },
                                {
                                    "type": "openDoor",
                                    "loc": [
                                        3,
                                        12
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        "6,0": [
            "normal结局：沉湎之梦"
        ]
    },
    "changeFloor": {
        "12,12": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "0,12": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,90007, 89,90007,  0,  0,  0,  0,  0],
    [  0,90007,90007,90007,90007,90007, 85,90007,90007,90007,90007,90007,  0],
    [90007,90007,90007,90007,90007,90007,676,90007,90007,90007,90007,90007,90007],
    [  0,90007,90007,90007,90007,90007,1430,90007,90007,90007,90007,90007,  0],
    [90007, 21, 21, 21, 21,262,384,262, 21, 21, 21, 21,90007],
    [  0,90007,90007,90007,90007,90007,1283,90007,90007,90007,90007,90007,  0],
    [90007,399, 22, 22, 22, 24,383, 24,400,400,400,400,90007],
    [  0,90007,90007,90007,90007,90007,1441,90007,90007,90007,90007,90007,  0],
    [90007, 21, 21, 47, 21, 24,382, 24, 21, 50, 21, 21,90007],
    [  0,90007,90007,90007,90007,90007,1426,90007,90007,90007,90007,90007,  0],
    [90007,355,355,355,355, 24, 30, 24,338,385,385,338,90007],
    [90007,90007,90007,90007,90007,90007,1428,90007,90007,90007,90007,90007,90007],
    [ 87, 21,337, 85,  0, 32, 34, 32,1431,369, 22,353, 88]
],
    "bgmap": [

],
    "fgmap": [
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}