main.floors.MT451=
{
    "floorId": "MT451",
    "title": "未知空间",
    "name": "未知空间",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "pauseBgm"
        },
        {
            "type": "playBgm",
            "name": "recoil2.mp3",
            "keep": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                11
            ]
        },
        "\t[弃坑立粽,E886]\b[this,6,2]到了，在这里我们的对话外界是听不到的。",
        "\t[弃坑立粽,E886]\b[this,6,2]首先很抱歉让你们背负了如此多的负担，并且你们付出的代价是十分惨烈的。",
        "\t[众人]这究竟是怎么一回事？",
        "\t[弃坑立粽,E886]\b[this,6,2]嗯.........就让我再一次运用这个能力吧。",
        "\t[弃坑立粽,E886]\b[this,6,2]\r[gold]以神的名义！拨动命运之针！",
        "\t[弃坑立粽,E886]\b[this,6,2]\r[gold]复生吧！",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                10
            ],
            "async": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        {
            "type": "setBlock",
            "number": "N1400",
            "loc": [
                [
                    5,
                    9
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "setBlock",
            "number": "N1401",
            "loc": [
                [
                    7,
                    9
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "setBlock",
            "number": "N1397",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "time": 1000
        },
        "\t[仙琳,N1397]\b[this,6,10]唔...........我这是.........在哪？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ],
            "async": true
        },
        "\t[小粽,N724]\b[this,6,11]仙....琳。",
        "\t[仙琳,N1397]\b[this,6,10]诶，小粽你怎么了，怎么流泪了，这可不像那个从前的你呀~",
        "\t[仙琳,N1397]\b[this,6,10]哎呀，不要这么抱紧我嘛，我刚才只是睡了一觉而已了。",
        "\t[小粽,N724]\b[this,6,11]活着就好....活着就好。",
        "\t[仙琳,N1397]\b[this,6,10]................嗯。",
        "\t[弃坑立粽,E886]\b[this,6,2]（真好啊，曾经...我也对“你”.....只可惜。）",
        "\t[弃坑立粽,E886]\b[this,6,2]咳咳，我说在这个特殊时刻就不要再卿卿我我了吧。",
        {
            "type": "setBlock",
            "number": "N1195",
            "loc": [
                [
                    5,
                    9
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "setBlock",
            "number": "N1196",
            "loc": [
                [
                    7,
                    9
                ]
            ],
            "time": 0,
            "async": true
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                10
            ]
        },
        "\t[仙琳,N1397]\b[this,6,10]是你再一次拯救了我吗？守望者。",
        "\t[弃坑立粽,E886]\b[this,6,2]不，我只是在遵循世界线的发展罢了，是这条世界线需要你的存在。因此我才用我的能力将你重新代入这个故事。",
        "\t[弃坑立粽,E886]\b[this,6,2]比起在意这个，我倒觉得我们应该在于之前所发生的一切吧。",
        "\t[小粽,N724]\b[this,6,11]对，守望者前辈，那个邪神·谶究竟是何方神圣？我们在他面前就如同蝼蚁一般脆弱.....而魔王他...",
        "\t[弃坑立粽,E886]\b[this,6,2].....那个人......他来自于另一条世界线。",
        "\t[君无天,N1195]\b[this,5,9]另一条世界线？您的意思是说他是来自于世界之外的存在吗。",
        "\t[弃坑立粽,E886]\b[this,6,2]正是如此，并且准确来说，他跟我来自于同一条世界线。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                10
            ]
        },
        "\t[小粽,N724]\b[this,6,11]同一条世界线？！原来前辈您不是这个世界的人吗？！！",
        "\t[君无天,N1195]\b[this,5,9]既然你们不是这个世界的人，那为什么会来到这个世界呢？",
        "\t[弃坑立粽,E886]\b[this,6,2]不错的问题，那是因为这条世界线存在着与其他世界线截然不同的底蕴。",
        "\t[小粽,N724]\b[this,6,11]底蕴？什么底蕴。",
        "\t[弃坑立粽,E886]\b[this,6,2]那就是这条世界线可能存在着一种人——其名为\r[aqua]观测者。",
        "\t[小粽,N724]\b[this,6,11]观测者？那是什么？？",
        "\t[弃坑立粽,E886]\b[this,6,2]简单来说，是观测世界之人。",
        "\t[弃坑立粽,E886]\b[this,6,2]从来没有人见过他们的真实面目，也从来没有人知道他们是从何而来。他们看似不隶属于任何一个世界线，但是他们的足迹却能无视世界线的阻止踏入任何他们想要去的地方。",
        "\t[弃坑立粽,E886]\b[this,6,2]而我来到这里的目的就是为了找寻观测者的下落。",
        "\t[小粽,N724]\b[this,6,11]那前辈您为什么在我登上这座魔塔没多久的时候要来帮助我呢？而且为什么你与我长的一模一样呢？",
        "\t[弃坑立粽,E886]\b[this,6,2]外貌这种东西我是可以任意伪造的，所以这个问题就没必要继续深究，至于我为什么要帮你....",
        "\t[弃坑立粽,E886]\b[this,6,2]\r[aqua]那是因为你是观测者所选定的人！",
        "\t[君无天/星钰/仙琳]什么？！",
        "\t[小粽,N724]\b[this,6,11]前辈您....说我是观测者所选定的人？？",
        "\t[弃坑立粽,E886]\b[this,6,2]正是。",
        "\t[小粽,N724]\b[this,6,11]我也不过是寻常之辈，那观测者为什么会选择我呢？",
        "\t[弃坑立粽,E886]\b[this,6,2]寻常之辈？哈哈哈哈哈哈哈哈！！",
        "\t[弃坑立粽,E886]\b[this,6,2]如果你真的只是寻常之辈的话，那你现在还能够站在我面前吗？小粽。",
        "\t[弃坑立粽,E886]\b[this,6,2]至于你问我为什么要帮你，那也是因为我在你身上看到了观测者们所给予你那不可视的底蕴。",
        "\t[弃坑立粽,E886]\b[this,6,2]而这种底蕴能够让你拥有改变这个早已被他人所书写下的故事的能力！",
        "\t[小粽,N724]\b[this,6,11]............我不是很明白您想要表达的意思。",
        "\t[弃坑立粽,E886]\b[this,6,2].............那换个方式对你们解释吧。你们知不知道那个邪神·谶为什么要暂时放过我们吗？",
        "\t[小粽,N724]\b[this,6,11]不知道。",
        "\t[弃坑立粽,E886]\b[this,6,2]那是因为他想让我们彻底绝望。",
        "\t[弃坑立粽,E886]\b[this,6,2]因为在他眼中，我们已经是失败者了。",
        "\t[弃坑立粽,E886]\b[this,6,2]那人的实力你们也看到了，就算是我也没有战胜他的可能。",
        "\t[星钰,N1196]\b[this,7,9]难道我们只能坐以待毙吗？就没有其他可行的办法了吗。",
        "\t[弃坑立粽,E886]\b[this,6,2]还有一个最后可行的办法。",
        "\t[小粽,N724]\b[this,6,11]什么办法？",
        "\t[弃坑立粽,E886]\b[this,6,2]\r[aqua]那就是穿越到这个世界线与我那个世界线之间的夹域之地！",
        "\t[众人]什么？？！！",
        "\t[弃坑立粽,E886]\b[this,6,2]你们可以理解成那是穿越世界线的必经之地。",
        "\t[众人]为什么要到那个地方去，还有为什么会存在这个地方？",
        "\t[弃坑立粽,E886]\b[this,6,2]每个世界之间其实都是有一个通道，通过这个通道可以去其他的世界线。这是它存在的意义。",
        "\t[弃坑立粽,E886]\b[this,6,2]至于为什么要去哪里，并不是让你们去那个已经被邪神·谶所毁灭的世界线，而是去那条通道进行修炼。",
        "\t[众人]进行修炼？如何进行？",
        "\t[弃坑立粽,E886]\b[this,6,2]那条通道不仅蕴含大量情感之力，还有极其强烈的压制之力，在这种高强环境下你们的修炼将会有大幅度提升。",
        "\t[弃坑立粽,E886]\b[this,6,2]小粽，不知道你现在有没有感觉自己的修炼速度开始变得缓慢起来了呢？",
        "\t[小粽,N724]\b[this,6,11]..............在光明圣堂之后我的确感觉自己的力量不在像以前那样提升的如此迅速了。",
        "\t[弃坑立粽,E886]\b[this,6,2]呵呵呵............是吗，毕竟你也撑得上是半神级别的人物了。",
        "\t[小粽,N724]\b[this,6,11]半神？",
        "\t[弃坑立粽,E886]\b[this,6,2]啊，可能你们对自己的力量达到何种地步还并没有一套系统的定义吧，就让我现在简单跟你们介绍一下。",
        "\t[弃坑立粽,E886]\b[this,6,2]嗯.....我记得在你们的世界中，多次提及到了\r[gold]“神”\r[white]这个名词吧，你们将\r[gold]“神”\r[white]作为传说般的存在，没错吧。",
        "\t[君无天,N1195]\b[this,5,9]嗯，没错，在魔塔世界中神是最为强大的存在，不过没想到那位初代勇者居然达到神灵的范畴了。",
        "\t[弃坑立粽,E886]\b[this,6,2]此言差矣，那位人类的初代勇者并不是真正的神灵，而是半神巅峰中的最强者。",
        "\t[君无天,N1195]\b[this,5,9]啊？可是那位初代勇者所展示的力量的确就是历史书上所写的神灵那般的存在啊。",
        "\t[弃坑立粽,E886]\b[this,6,2]历史是由胜利者来书写的，但是真正的历史只有亲临者才可得知。你们所谓的神灵不过只是单纯属于这个世界之内的范畴罢了。",
        "\t[弃坑立粽,E886]\b[this,6,2]而真正的神灵你们也应该见识过三位了，我是其中一位，邪神·谶是其中一位。",
        "\t[小粽,N724]\b[this,6,11]那还有一位呢？",
        "\t[弃坑立粽,E886]\b[this,6,2]那个家伙，想必你们在魔殿第四十层的时候就已经跟他见过一面了吧。",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        "\t[小粽,N724]\b[this,6,11]是他？！",
        "\t[弃坑立粽,E886]\b[this,6,2]没错，就是那位影子人。",
        "\t[弃坑立粽,E886]\b[this,6,2]那家伙虽然平时吊儿郎当，但是他在关键时刻绝对不会含糊的。他之所以在魔殿第四十层是为了给予你们帮助。",
        "\t[小粽,N724]\b[this,6,11]嗯，不过他当时对我们说的话我到现在还未完全明白。",
        "\t[弃坑立粽,E886]\b[this,6,2]这个家伙的心思有些独特，不是现在的你能理解的，你只需要记住他对你们有帮助，有他帮忙，就是一件好事。",
        "\t[小粽,N724]\b[this,6,11]嗯。",
        "\t[弃坑立粽,E886]\b[this,6,2]好了，废话我就不多说了，接下来继续刚才的话题。",
        "\t[弃坑立粽,E886]\b[this,6,2]刚才我说到了那位初代勇者的实力是半神巅峰的最强者，而你们之前认为他这个级别的战力就是神灵，这是你们以前的看法。",
        "\t[弃坑立粽,E886]\b[this,6,2]而现在如果要让我对你们四人进行一个战力排序的话，仙琳则与那么初代勇者差不多是一个水平的。小粽达到了初入半神级别的层次，至于君无天和星钰就差上一些，不过也接近当时半神之下无敌的“魔王”那个战力的了。",
        "\t[小粽,N724]\b[this,6,11]......原来如此。",
        "\t[弃坑立粽,E886]\b[this,6,2]现在我说一下我自己吧，我的实力跟邪神·谶一样都是巅峰级别的神灵，我最擅长的能力是时空凝固与命运逆转，时空凝固你们现在已经见识过了，而我刚刚对仙琳使用的复活术就是运用的命运逆转。也叫做因果逆转。",
        "\t[弃坑立粽,E886]\b[this,6,2]只不过命运逆转所要涉及到的因果颇为复杂，并且因果逆转需要付出的代价非常的大，而其实我也没有把握能够将命运逆转施展到最好，毕竟我的目前身体状况并不太好，每使用一次这个能力都会使我的身体状态愈发虚弱，所以不到万不得已我是不会使用的。",
        "\t[小粽,N724]\b[this,6,11]那个邪神呢？他会什么能力。",
        "\t[弃坑立粽,E886]\b[this,6,2]他擅长控制人的心智以及精神威压，也可以说他可以控制他一切想要控制的事物，你们刚才在魔塔之巅的时候就已经深刻领会过了。",
        "\t[小粽,N724]\b[this,6,11]的确，在他面前，我们身体，包括思维都被他所死死束缚了，根本无法动弹半步。",
        "\t[弃坑立粽,E886]\b[this,6,2]这主要是有两个原因，一是因为你们的实力对于他来说如同天壤之别，二是因为他极其擅长控制思维，所以才导致你们在他面前如同蝼蚁一般脆弱。",
        "\t[弃坑立粽,E886]\b[this,6,2]但是不用担心，只要按我说的进入两条世界线的夹域地带继续修炼的话就不用太过担心这个问题。",
        "\t[小粽,N724]\b[this,6,11]那我们还等什么，抓紧时间吧。",
        "\t[弃坑立粽,E886]\b[this,6,2]但是....邪神·谶最可怕的不是他的特殊能力，而是他的真实目的。",
        "\t[小粽,N724]\b[this,6,11]真实目的？什么意思，他的真实目的不是毁灭这个世界吗。",
        "\t[弃坑立粽,E886]\b[this,6,2]不是这么简单的，他的真实目的我只知道与“情感”这个因素有关。",
        "\t[小粽,N724]\b[this,6,11]情感？",
        "\t[弃坑立粽,E886]\b[this,6,2]情感这个东西，可谓是一切生灵都会拥有的产物，他可能是想掌控所有的情感吧。",
        "\t[小粽,N724]\b[this,6,11]掌控所有的情感？掌控这些的意义是什么呢？？",
        "\t[弃坑立粽,E886]\b[this,6,2]情感这个东西，可谓是一切生灵都会拥有的产物，他可能是想掌控所有的情感吧。",
        "\t[弃坑立粽,E886]\b[this,6,2]情感？也许是情感的力量，或许也是超越世界线的力量，总之我不知道是因为什么，不过邪神·谶是一个十分危险的人物，你们一定小心谨慎。",
        "\t[小粽,N724]\b[this,6,11]嗯，那我们现在该如何去那个什么夹域之地呢？",
        "\t[弃坑立粽,E886]\b[this,6,2]现在应该就差不多就可以了。",
        {
            "type": "setBlock",
            "number": "E1437",
            "loc": [
                [
                    7,
                    1
                ]
            ],
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                5,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                7,
                9
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        "\t[记录者,E1437]\b[this,7,1]我已经搭建好了通往世界线的中枢地带的传送门了，你们现在就可以启程了。",
        "\t[小粽/星钰/君无天]是你？！",
        "\t[弃坑立粽,E886]\b[this,6,2]由于实力差距和世界线的压制，你们四人将会前往不同的区域分别进行修炼。",
        "\t[弃坑立粽,E886]\b[this,6,2]如果你们支撑不住的话，只要按下这个底牌，就会将你们重新带到这里。",
        "\t[弃坑立粽,E886]\b[this,6,2]不过你们不要太过深入，不然底牌也会受到世界线的压制无法将你们顺利带回。",
        "\t[记录者,E1437]\b[this,7,1]你们准备好的话我就将你们传送走了。",
        "\t[小粽,N724]\b[this,6,11]......大家，为了这个世界，为了我们的未来，结束这一切吧！",
        "\t[众人]嗯！",
        "\t[君无天,N1195]\b[this,5,9]小粽，仙琳，星钰，你们一定要平安无事啊！",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                5,
                9
            ]
        },
        "\t[星钰,N1196]\b[this,7,9]父亲大人，你也要小心啊！",
        "\t[君无天,N1195]\b[this,5,9]嗯！",
        {
            "type": "hide",
            "loc": [
                [
                    5,
                    9
                ]
            ],
            "remove": true,
            "time": 0
        },
        "\t[记录者,E1437]\b[this,7,1]下一位。",
        "\t[星钰,N1196]\b[this,7,9]小粽，仙琳妹妹你们也要多保重啊！",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                7,
                9
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    9
                ]
            ],
            "remove": true,
            "time": 0
        },
        "\t[记录者,E1437]\b[this,7,1]下一位。",
        "\t[仙琳,E962]\b[this,6,10]小粽......我。",
        "\t[小粽,N724]\b[this,6,11]不必多言，仙琳你知道我要对你说什么的。",
        "\t[小粽,N724]\b[this,6,11]这一次，让我为你遮风挡雨就行了。",
        "\t[仙琳,E962]\b[this,6,10]......嗯。",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                10
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "remove": true,
            "time": 0
        },
        "\t[记录者,E1437]\b[this,7,1]小粽，最后到你了。",
        "\t[小粽,N724]\b[this,6,11]不必多言，让我去终结这一切吧。",
        "\t[记录者,E1437]\b[this,7,1]是吗，那做好准备。",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                11
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    11
                ]
            ],
            "remove": true,
            "time": 0
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "为了阻止邪神·谶，小粽四人分别前往两条世界线的夹域地带提升自己的实力。",
        "没过多久，小粽就已经到达了。",
        "不过就在这里，小粽得知了......\r[aqua]这个世界存在的意义！",
        {
            "type": "changeFloor",
            "floorId": "MT452",
            "loc": [
                6,
                11
            ],
            "direction": "up"
        },
        {
            "type": "playBgm",
            "name": "universe.mp3",
            "keep": true
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,886,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,1195,  0,1196,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,1403,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,1398,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}