main.floors.MT465=
{
    "floorId": "MT465",
    "title": "世界线的终焉",
    "name": "世界线的终焉",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "universe2.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "T1158",
    "bgm": "slience3.mp3",
    "firstArrive": [
        "\t[小粽,hero]\b[hero]看来又是一段记忆片段了。",
        "\t[梦？,N1351]\b[this,8,11]少爷！您受伤了。",
        "\t[少爷]我没事....只是被岩浆烫到了而已。",
        "\t[梦？,N1351]\b[this,8,11]..........这怎么叫没事呢！明明你受了那么重的伤，为什么要说没事呢？！",
        "\t[少爷]呵呵呵......毕竟为了能让这个世界不再出现悲剧...这种事...算不了什么。",
        "\t[梦？,N1351]\b[this,8,11].............",
        "\t[梦？,N1351]\b[this,8,11]我不希望少爷为了我而受这么重的伤，如果少爷你执意如此...那我就。",
        {
            "type": "hide",
            "loc": [
                [
                    8,
                    11
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[小粽,hero]\b[hero]............不知道为什么我无法看到那位少爷的外貌...究竟是怎么一回事呢？"
    ],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 50000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 100000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 2000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 10000
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,6": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "6,2": {
            "floorId": ":next",
            "stair": "downFloor",
            "direction": "down",
            "time": 0
        }
    },
    "afterBattle": {
        "2,0": [
            {
                "type": "setValue",
                "name": "flag:door_MT465_6_1",
                "operator": "+=",
                "value": "1"
            }
        ],
        "4,0": [
            {
                "type": "setValue",
                "name": "flag:door_MT465_6_1",
                "operator": "+=",
                "value": "1"
            }
        ],
        "4,2": [
            {
                "type": "setValue",
                "name": "flag:door_MT465_6_1",
                "operator": "+=",
                "value": "1"
            }
        ],
        "2,2": [
            {
                "type": "setValue",
                "name": "flag:door_MT465_6_1",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,1": {
            "0": {
                "condition": "flag:door_MT465_6_1==4",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "map": [
    [1447,90007,1457,334,1444,90007,90007,346,  0,1450, 21,90007,1447],
    [90007,  0,367,90007, 27,  0, 85,90007,378,90007,1459,369,90007],
    [1450,335,1435, 29,1310, 82, 87, 81, 81,90007, 33,90007, 23],
    [ 22,90007, 34,90007, 81,90007,1450,90007,1427,383,1460,384,1458],
    [399,90007,90007,  0,411,1448,  0,1448, 81,90007,90007,  0,336],
    [90007,90007,  0, 29,1432,379, 22,379,1449, 32,90007,1456,90007],
    [ 34,90007,1444,90007,90007, 21, 88, 21,90007,1448,385,369,1451],
    [399, 82,350,1435,  0,379,412,379,1310,  0,1455,90007,400],
    [90007,90007, 81,334,90007, 81,90007, 81,90007,1448,  0,339,90007],
    [ 34,335,1311,90007,90007, 33,90007, 33,90007,90007,355,400,355],
    [335, 34,90007,90007,90007,90007,90007,90007,90007,90007,90007,339,90007],
    [90007,90007,  0,  0,  0,  0,  0,  0,1267,  0,  0,90007,90007],
    [1447,90007,  0,  0,  0,  0,  0,  0,  0,  0,  0,90007,1447]
],
    "bgmap": [

],
    "fgmap": [
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,301,301,301,301,301,301,301,301,301,  0,  0],
    [  0,  0,301,301,301,301,301,301,301,301,301,  0,  0]
],
    "fg2map": [

]
}