main.floors.MT47=
{
    "floorId": "MT47",
    "title": "登天潭径尽头",
    "name": "登天潭径尽头",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "item_ratio": 10,
    "defaultGround": "grass2",
    "bgm": "battle2.mp3",
    "color": [
        85,
        85,
        85,
        0.3
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,0": [],
        "11,11": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[仙琳,fairy]\b[this,11,11]嗯？小粽你来了呀~",
                "\t[仙琳,fairy]\b[this,11,11]哇......没想到你实力居然提升这么快！连这里最强的道傀使都不是你的对手了呢。",
                "\t[小粽,hero]\b[hero]其实我也不知道是怎么一回事，我的实力感觉跟之前相比有了质的飞跃。",
                "\t[仙琳,fairy]\b[this,11,11]嗯.......可能你经常与这些魔物厮杀所得到的战斗经验比平时要多的多吧。",
                "\t[仙琳,fairy]\b[this,11,11]算了，不想这么多，那我们现在去登天之路吧。",
                "\t[小粽,hero]\b[hero]好！",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500
                },
                {
                    "type": "setBgFgBlock",
                    "name": "fg",
                    "number": "autotile11",
                    "loc": [
                        [
                            11,
                            11
                        ]
                    ]
                },
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT47",
                    "loc": [
                        641,
                        641
                    ],
                    "time": 0
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                {
                    "type": "sleep",
                    "time": 2000
                },
                {
                    "type": "playBgm",
                    "name": "holy1.mp3"
                },
                {
                    "type": "animate",
                    "name": "fire",
                    "loc": [
                        11,
                        1
                    ],
                    "async": true
                },
                {
                    "type": "playSound",
                    "name": "VXFire4.ogg"
                },
                {
                    "type": "setBlock",
                    "number": "N831",
                    "loc": [
                        [
                            11,
                            1
                        ]
                    ]
                },
                {
                    "type": "waitAsync"
                },
                "\t[???,N831]\b[this,11,1]......哼！原来如此。",
                "\t[???,N831]\b[this,11,1]我说为什么这个渺小的人类会能斩杀安兹乌洛斯 若影卡萨 以及刚才的道傀使。",
                "\t[???,N831]\b[this,11,1]原来是有仙子一族的人在暗中帮助呀！",
                "\t[???,N831]\b[this,11,1]那么我现在应该......",
                {
                    "type": "screenFlash",
                    "color": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "times": 1
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "playSound",
                    "name": "jump.mp3"
                },
                {
                    "type": "animate",
                    "name": "unknown",
                    "loc": [
                        11,
                        1
                    ]
                },
                "\t[???,N831]\b[this,11,1]嗯？",
                {
                    "type": "screenFlash",
                    "color": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "times": 1
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "animate",
                    "name": "emmslow",
                    "loc": [
                        11,
                        1
                    ]
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[???,N831]\b[this,11,1]原来如此,这是您计划中的一部分吗？",
                {
                    "type": "screenFlash",
                    "color": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "time": 500,
                    "times": 1
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[???,N831]\b[this,11,1]我明白了。",
                "\t[???,N831]\b[this,11,1]......小家伙，看来你运气不错，我现在可腾不出手来管你了！",
                "\t[???,N831]\b[this,11,1]......不过为什么我看到那两个小家伙会有一种熟悉的感觉。",
                {
                    "type": "animate",
                    "name": "emmslow",
                    "loc": [
                        11,
                        1
                    ]
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[???,N831]\b[this,11,1]想不起来，一想起来就头痛。",
                "\t[???,N831]\b[this,11,1]罢了！反正最后能够实施【】计划就行了！",
                {
                    "type": "setCurtain",
                    "color": [
                        0,
                        0,
                        0,
                        1
                    ],
                    "time": 500
                },
                {
                    "type": "setBgFgBlock",
                    "name": "fg",
                    "number": "autotile11",
                    "loc": [
                        [
                            11,
                            1
                        ]
                    ]
                },
                {
                    "type": "setBgFgBlock",
                    "name": "fg",
                    "number": "autotile11",
                    "loc": [
                        [
                            11,
                            0
                        ]
                    ]
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT48",
                    "loc": [
                        6,
                        12
                    ],
                    "time": 0
                },
                {
                    "type": "setCurtain",
                    "time": 500
                }
            ]
        },
        "11,10": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT28\", \"MT29\", \"MT30\", \"MT31\", \"MT32\", \"MT33\", \"MT34\", \"MT35\", \"MT36\", \"MT37\", \"MT38\", \"MT39\", \"MT40\", \"MT41\", \"MT42\", \"MT43\", \"MT44\", \"MT45\", \"MT46\"]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==0)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "time": 0
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "11,0": {
            "floorId": "MT38",
            "loc": [
                11,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 91,  0],
    [  0,  0,  0,  0,  0, 29, 21,  0, 31, 29, 21,  0,  0],
    [100028,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,100044,100045,100046,  0],
    [100091,  0, 21,  0,  0,100027,100028,  0,100091,100052,100053,100054,100027],
    [  0,  0, 29,  0,  0,100091,  0,100091,  0,100060,100061,100062,100063],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100069,100070,  0],
    [100091,  0, 31,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,367, 31,  0,  0,367,  0,  0,367,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,100027,100028,100091,  0,100029,  0,  0,  0,670,  0],
    [  0,100091,  0,100044,100045,100046,  0,100037,100091,  0,  0,124,  0],
    [100028,  0,  0,100052,100053,100054,100055,  0,100091,  0,  0, 93,  0]
],
    "bgmap": [
    [141,141,141,141,141,141,141,141,141,141,141,140,141],
    [141,141,140,140,140,140,140,140,140,140,140,140,141],
    [141,141,140,141,141,141,141,141,141,141,141,141,141],
    [141,141,140,141,141,141,141,141,141,141,141,141,141],
    [141,141,140,141,141,141,141,141,141,141,141,141,141],
    [141,141,140,141,141,141,141,141,141,141,141,141,141],
    [141,141,140,141,141,141,141,141,141,141,141,141,141],
    [141,141,140,141,141,141,141,141,141,141,141,141,141],
    [141,141,140,140,140,140,140,140,140,140,140,140,141],
    [141,141,141,141,141,141,141,141,141,141,141,140,141],
    [141,141,141,141,141,141,141,141,141,141,141,140,141],
    [141,141,141,141,141,141,141,141,141,141,141,140,141],
    [141,141,141,141,141,141,141,141,141,141,141,140,141]
],
    "fgmap": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17,  0, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17,  0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17,  0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17,  0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17,  0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17,  0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17,  0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17,  0, 17]
],
    "bg2map": [

],
    "fg2map": [

]
}