main.floors.MT48=
{
    "floorId": "MT48",
    "title": "登天之路外围",
    "name": "登天之路外围",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "item_ratio": 30,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "function",
            "function": "function(){\ncore.removeMaps(\"MT28\", \"MT47\")\n}"
        },
        "\t[小粽,hero]\b[hero]呼~总算是离开那潮湿的沼泽地带了。",
        "\t[小粽,hero]\b[hero]重新沐浴在阳光之下的感觉真好。",
        "\t[小粽,hero]\b[hero]仙琳还在前面等着我呢，先赶紧过去吧！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            {
                "type": "disableShop",
                "id": "shop1"
            },
            "\t[仙琳,fairy]\b[this,6,2]小粽，前面就是堇姐姐管理的第二个区域——登天之路。",
            "\t[仙琳,fairy]\b[this,6,2]这个区域各个魔物的实力相比前面的区域来说有了质的飞跃！",
            "\t[小粽,hero]\b[hero]质的飞跃？这些魔物有多强？",
            "\t[小粽,hero]\b[hero]不要告诉我这里每一个魔物的实力都是道傀使那个级别......。",
            "\t[仙琳,fairy]\b[this,6,2]啧！慌什么呀，这些魔物实力的跨度还没那么夸张呢。",
            "\t[仙琳,fairy]\b[this,6,2]它们与道傀使相比，也就是............。",
            {
                "type": "animate",
                "name": "emmslow",
                "loc": [
                    6,
                    2
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[小粽,hero]\b[hero](有种不好的预感。）",
            "\t[仙琳,fairy]\b[this,6,2]差了114.514点吧！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    3
                ],
                "async": true
            },
            "\t[小粽,hero]\b[hero]啥？！那不就是道傀使的实力吗？？",
            "\t[仙琳,fairy]\b[this,6,2]啊？不一样呀，114.514点实力还是区别很大的呢~",
            "\t[仙琳,fairy]\b[this,6,2]呜啊！你别用这种看智障的眼神看着我呀。",
            "\t[仙琳,fairy]\b[this,6,2]就算是这里的魔物都是道傀使那个级别的，你也不要慌嘛。",
            "\t[仙琳,fairy]\b[this,6,2]因为我会一直告诉你怎么度过各个区域的呢~",
            "\t[小粽,hero]\b[hero]仙琳，上个区域你好像就告诉了我有三个头目级别的怪物呢，然后我之前差点被那些不逊色头目级别的道傀给打死。",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[仙琳,fairy]\b[this,6,2]那是因为我忘了呀OVO",
            "\t[仙琳,fairy]\b[this,6,2]小粽你也不要怀疑什么，魔塔内其实有许多事情我也不清楚。",
            "\t[仙琳,fairy]\b[this,6,2]就比如四星尊天这个区域的某些事物。",
            "\t[仙琳,fairy]\b[this,6,2]不过我们仙子一族历来都担任着引导者的身份这种事情肯定是没错的。",
            "\t[小粽,hero]\b[hero]的确，没有仙琳你的提示我估计早就死在第一区域的安兹乌洛斯手中了。",
            "\t[仙琳,fairy]\b[this,6,2]对呀~别看人家表面傻傻的，在做重要事情肯定不会含糊的。",
            "\t[仙琳,fairy]\b[this,6,2]那么回归正题，对小粽你来说这个区域的确不好应对。",
            "\t[仙琳,fairy]\b[this,6,2]所以通过这个区域的核心思想是先去商店那里，然后向右走。",
            "\t[仙琳,fairy]\b[this,6,2]这个区域所有宝石与血瓶提升的能力为30倍，而且剑盾的攻防为2000点！",
            "\t[仙琳,fairy]\b[this,6,2]剩下其他的得靠你自己去探索了~",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[小粽,hero]\b[hero]（感觉有些奇怪呀,她好像在隐瞒些什么....。）",
            "\t[小粽,hero]\b[hero]（到底是什么呢？....）",
            "\t[小粽,hero]\b[hero]嗯！我明白了。",
            "\t[仙琳,fairy]\b[this,6,2]那我去前面探路了，看看这里有没有什么变化。",
            {
                "type": "hide",
                "remove": true,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "MT49",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [145,145,145,145,145,145, 91,145,145,145,145,145,145],
    [145,397,387,387,387, 24,  0, 24, 34, 33,399,400,145],
    [145,145,145,145,145,145,124,145,145,145,145,145,145],
    [145,412,411,411,411, 24,  0, 24, 21, 21, 22, 23,145],
    [145,145,145,145,145,145,  0,145,145,145,145,145,145],
    [145,145,145, 34,399, 82,  0, 81, 34, 34,145,145,145],
    [145,145,145,145,145,145,  0,145,145,145,145,145,145],
    [145,145,145, 34,399, 82,  0, 81, 34, 34,145,145,145],
    [145,145,145,145,145,145,  0,145,145,145,145,145,145],
    [145,145,145, 34,399, 82,  0, 81, 34, 34,145,145,145],
    [145,145,145,145,145,145,  0,145,145,145,145,145,145],
    [145,145,145, 34,399, 82,  0, 81, 34, 34,145,145,145],
    [145,145,145,145,145,145,  0,145,145,145,145,145,145]
],
    "bgmap": [
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000],
    [50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000,50000]
],
    "fgmap": [
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "battle3.mp3",
    "bg2map": [

],
    "fg2map": [

]
}