main.floors.MT491=
{
    "floorId": "MT491",
    "title": "未知空间",
    "name": "未知空间",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "hope3.mp3",
            "keep": true
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[记录者,N680]\b[this,6,4]你们回来了呀，想必你们应该有不少的收获吧。",
        "\t[星钰,N1196]\b[this,7,7]的确如此，多亏那位前辈留下的一缕残念，让我对科技的领悟达到新的高度。",
        "\t[记录者,N680]\b[this,6,4]呵呵呵...你见到的那位可是当初守望者那个家伙最好的朋友，早在那个家伙刚刚出道的时候就结识的伙伴。",
        "\t[记录者,N680]\b[this,6,4]精通一切科技，以凡人之躯达到了堪比神灵的战力，的确很令人惊艳。只可惜.....哎。",
        "\t[星钰,N1196]\b[this,7,7]那位前辈最后离去的时候让我转告给守望者。",
        "\t[记录者,N680]\b[this,6,4]哦？什么话。",
        "\t[星钰,N1196]\b[this,7,7]不忘初心，方得始终。",
        "\t[记录者,N680]\b[this,6,4]..............有点意思，我会记下来的。",
        "\t[记录者,N680]\b[this,6,4]嗯......君无天所接触到的残念应该是......",
        "\t[君无天,N1195]\b[this,5,7]斗天剑神——\r[aqua]林无尘。",
        "\t[记录者,N680]\b[this,6,4]哦，原来如此....原来如此....我说为什么在你身上感受到了一缕熟悉的气息....的确像是那个家伙的作风。",
        "\t[记录者,N680]\b[this,6,4]在刚踏入半神之境时，以一己之力，战百位半神巅峰强者，不败。的确了不起。",
        "\t[记录者,N680]\b[this,6,4]只可惜他也摆脱不了.........。",
        "\t[君无天,N1195]\b[this,5,7]那位前辈也对守望者留下一些话。",
        "\t[君无天,N1195]\b[this,5,7]吾虽身消道死，但吾之剑道永存。",
        "\t[记录者,N680]\b[this,6,4].......呵呵呵...不愧是他，这种话也就只有他能说的出来了吧。",
        "\t[记录者,N680]\b[this,6,4]你们说的我会记下的。",
        "\t[君无天,N1195]\b[this,5,7]记录者前辈，我们现在应该做什么呢？有没有什么其他提升实力的方法。",
        "\t[记录者,N680]\b[this,6,4].......有到是有，只不过非常困难。",
        "\t[君无天/星钰]是什么？",
        "\t[记录者,N680]\b[this,6,4]\r[aqua]帮助守望者担任观测者之声！",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "changeFloor",
            "floorId": "MT492",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,680,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,1195,  0,1196,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}