main.floors.MT500=
{
    "floorId": "MT500",
    "title": "世界线的终焉",
    "name": "世界线的终焉",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "universe2.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "T1158",
    "firstArrive": [
        "\t[小粽,hero]\b[hero]嗯.....这里的意志体所蕴含的力量与刚才有些区别。",
        "\t[小粽,hero]\b[hero]看来世界线的对生物的压制会以不同形式的方式来表现。",
        "\t[小粽,hero]\b[hero]如果我能够摸清世界线压制变动的规律，或许就能够顺利突破这里。"
    ],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 50000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 100000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 50000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 50000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 250000
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "2,12": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [1506,90007,356,90007, 21,  0, 88,  0, 21,90007,353,90007,1506],
    [90007,340,1496,90007,  0,664,  0,664,  0,90007,1484,369,90007],
    [  0,1494,  0, 22,90007,90007, 81,90007,90007,368,  0, 81,1500],
    [395,90007, 21,1481,352,90007,1490,335,  0,1481,352, 82,376],
    [90007,90007,1499,90007,368,90007,351,90007,90007,90007,1480,90007,392],
    [400,1484,  0,90007, 81,1489,  0,1489,352,90007,  0,90007,90007],
    [ 21,90007,345,90007,1446,90007,1490,368,90007, 22,1482,  0,400],
    [90007,361,  0,1487,354,90007, 21,90007,371,1496,90007,1446,90007],
    [393,1488,90007,90007,1491,90007,1487,90007,90007,355,90007,  0,90007],
    [90007,  0,  0,1446,  0,1501,385,1501,  0, 81,1501,400,1501],
    [90007,90007,1494,90007,371,90007,881,90007,1480,90007,354,1491,354],
    [90007,346,664,362, 82,90007,  0,90007,399,90007,90007,380,90007],
    [1506,90007, 87,90007,90007,345,  0,90007,1499,  0,364,90007,1506]
],
    "bgmap": [

],
    "fgmap": [
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "bgm": "universe3.mp3"
}