main.floors.MT519=
{
    "floorId": "MT519",
    "title": "世界线的终焉",
    "name": "世界线的终焉",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "universe2.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "universe5.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "universe5.mp3"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "disableShop",
            "id": "508Fshop"
        },
        {
            "type": "function",
            "function": "function(){\ncore.removeMaps(\"MT0\", \"MT518\")\n}"
        },
        "\t[仙琳,fairy]\b[hero]嗯..........一路走来都是些奇形怪状的意志体在游荡，我并没有感受到世界线本身的压制....。",
        "\t[仙琳,fairy]\b[hero]而且这里的环境.......完全不像是毫无人烟的夹域之地....就像是人为创造的一样，是怎么一回事呢。",
        "\t[仙琳,fairy]\b[hero]还有那个叫仙雅的女人.....她究竟是什么身份，为什么与我们仙子一族的第一位神灵用的同一个名字。",
        "\t[仙琳,fairy]\b[hero]而且我为什么我感觉这些景色......似曾相识？",
        {
            "type": "animate",
            "name": "emmslow",
            "loc": "hero"
        },
        "\t[仙琳,fairy]\b[hero]哎呀，不去想那么多了，先向前面看一看吧。"
    ],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 50000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 100000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 1000000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 1000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 5000000
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [152,152,152,152,152,152, 87,152,152,152,152,152,152],
    [1273,668,668,667,667, 83,  0, 81, 82, 82, 82, 82, 23],
    [152,152,152,152,152,152,  0,152,152,152,152,152,152],
    [402,401,668, 82,668, 82,  0, 82,668, 82,668,401,402],
    [152,152,152,152,152,152,  0,152,152,152,152,152,152],
    [152,402,666, 81,666, 81,  0, 81,666, 81,666,402,152],
    [90007,90007,90007,90007,90007,90007,  0,90007,90007,90007,90007,90007,90007],
    [90007,1274, 22, 22, 22, 24,  0, 24, 21, 21, 47,669,90007],
    [90007,90007,90007,90007,90007,90007,  0,90007,90007,90007,90007,90007,90007],
    [90007,1274,1274,1273,1273, 24,  0, 24, 21, 21, 22, 23,90007],
    [90007,90007,90007,90007,90007,90007,  0,90007,90007,90007,90007,90007,90007],
    [90007,377,377,393,345, 24,  0, 24,361,393,377,377,90007],
    [90007,90007,90007,90007,90007,90007,  0,90007,90007,90007,90007,90007,90007]
],
    "bgmap": [
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}