main.floors.MT520=
{
    "floorId": "MT520",
    "title": "世界线的终焉",
    "name": "世界线的终焉",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "universe5.mp3",
    "firstArrive": [
        "\t[仙琳,fairy]\b[hero]..............",
        {
            "type": "callBook"
        },
        "\t[仙琳,fairy]\b[hero]这里的每一个意志体居然都接近于守望者那个级别的存在了。而且它们的生命气息好强烈......这里究竟发生了些什么？",
        "\t[仙琳,fairy]\b[hero]尽量避免与它们战斗吧。"
    ],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 50000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 100000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 1000000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 1000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 5000000
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        },
        "6,6": {
            "floorId": ":next",
            "stair": "downFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [666,402,152,382,1524,152, 88,152,1524,382,152,  0,335],
    [ 81,152,152,152, 81,152,401,152, 81,152,152,351,  0],
    [367,383,152,  0, 29,152,1519,152, 29,  0,152,152,1521],
    [1522,152,152, 27,1526, 27,  0, 28,1523, 28,  0, 27,  0],
    [666,  0, 28,  0,152,152, 83,152,152, 81,152, 82,152],
    [  0,152,152,152,152,667,384,667,152,666,152,666,667],
    [1523,401,  0,1520,152,352, 87,352,152, 81,152,667,1521],
    [334,152, 81,  0,152,152,1527,152,152,1523,152,152, 81],
    [152,152,152,350,1522,351,  0,1519,  0, 28,  0, 27,  0],
    [ 21,152,335, 81,152,152, 81,152,152,1525,152, 81,152],
    [1524, 81,  0,  0,  0,1525,350,  0,334,  0,152,1528,337],
    [ 21,152,152,1526,152,152,152,1520,152,668,152,353, 22],
    [152,152, 27, 29, 27,152,366,334,152,152,152,669,369]
],
    "bgmap": [
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [301,301,301,301,301,301,301,301,301,301,301,301,301],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}