main.floors.MT529=
{
    "floorId": "MT529",
    "title": "光明圣堂",
    "name": "光明圣堂",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "defaultGround": "T1272",
    "bgm": null,
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "GG5.mp3",
            "keep": true
        },
        "\t[魔王]哈哈哈...........我苦苦追寻.............最终只是换来........黄....梁...一...梦.....吗........？",
        "\t[魔王]............真是可笑的一生啊.........。",
        "\t[魔王]或许......对于我这种人来说........被时间长河所吞噬才是最好的选择吧..........。",
        "\t[魔王]....................",
        "\t[魔王]............................",
        "\t[魔王]....................................",
        "\t[魔王]....................................嗯？怎么回事，为什么前面会有亮光？",
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[魔王,hero]\b[hero].............我这是...........！！",
        "\t[梦,N1256]\b[this,8,5]你醒了？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[魔王,hero]\b[hero]！！！梦？！你不是已经.........",
        "\t[梦,N1256]\b[this,8,5]？你在说些什么呢。是太劳累出现幻觉了吗？",
        "\t[魔王,hero]\b[hero]（这究竟是怎么一回事......我不是已经被吞噬了吗？为什么会出现在这里......）",
        "\t[魔王,hero]\b[hero]（而且梦为什么也会在这里.....她不是已经死了吗........。）",
        "\t[魔王,hero]\b[hero]..........梦，你知道你自己是谁吗？",
        "\t[梦,N1256]\b[this,8,5].......我的名字叫做梦，存在的意义就是为了能够给你提供价值。",
        "\t[魔王,hero]\b[hero]（...........这种毫无情感波动的回答........果然你还是原先的“梦”啊。）",
        "\t[魔王,hero]\b[hero]........梦，你愿意听我讲一个故事吗？",
        "\t[梦,N1256]\b[this,8,5].......愿意。",
        "\t[魔王,hero]\b[hero].............从前，有一位意气风发的青年，因失去了自己的爱妻而肝肠寸断。",
        "\t[魔王,hero]\b[hero]为了能够复活他的爱妻，那个人创造了与他爱妻外貌完全一致的试验体，并且将他爱妻的部分灵魂注入其中。",
        "\t[魔王,hero]\b[hero]...........不过，由于实验上的失误，导致那个试验体完全没有任何有关于那个青年的感情.......。",
        "\t[魔王,hero]\b[hero]不久之后，那个人告诉她存在的意义就是被人需要，帮助他人，这便是她生而存在的意义。",
        "\t[魔王,hero]\b[hero]...........而那个女子说：\"我一定会尽可能的去帮助你，因为.....这就是你所说的被人所需要的价值\"。",
        "\t[梦,N1256]\b[this,8,5]后来呢？",
        "\t[魔王,hero]\b[hero]..........后来嘛........他后悔了。",
        "\t[梦,N1256]\b[this,8,5]后悔？",
        "\t[魔王,hero]\b[hero]是的，他后悔了，他后悔当初对她所说过的话了.............。",
        "\t[魔王,hero]\b[hero]因为.....他不应该就这样轻易决定她存在的意义啊！",
        "\t[梦,N1256]\b[this,8,5]..................",
        "\t[魔王,hero]\b[hero]然而就在那个人刚刚醒悟的时候，那个女人却早已离她而去。",
        "\t[魔王,hero]\b[hero]由于他的一意孤行，导致所有人都离他而去........。",
        "\t[魔王,hero]\b[hero]即使最后醒悟过来，世间却早已变迁.......就连赎罪的机会都不复存在...........。",
        "\t[魔王,hero]\b[hero]这个故事就以这么一个荒谬的结局而告终了。",
        "\t[梦,N1256]\b[this,8,5]..................很伤感的故事。这个人付出了那么多，最后换来的却只是虚妄。",
        "\t[魔王,hero]\b[hero]伤感吗？哈，........或许这就是这个人生而注定的命运吧........。",
        "\t[梦,N1256]\b[this,8,5]所以这个故事是想说.............",
        "\t[魔王,hero]\b[hero]这个故事是想告诉你——\r[red]你应该自己决定自己的人生！不应该只是为了我啊！！",
        {
            "type": "playSound",
            "name": "049-Explosion02.ogg"
        },
        {
            "type": "vibrate",
            "time": 500
        },
        "\t[梦,N1256]\b[this,8,5]......................",
        "\t[梦,N1256]\b[this,8,5].............................",
        "\t[魔王,hero]\b[hero]呼.........呼...........",
        "\t[魔王,hero]\b[hero]所以..........你.........明白了吗？",
        "\t[梦,N1256]\b[this,8,5]...................................",
        "\t[魔王,hero]\b[hero].................你走吧，让我一个人......静一静。",
        "\t[魔王,hero]\b[hero]让我一个人........像往常一样......孤独的.........活下去吧。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "pauseBgm"
        },
        "\t[梦,N1256]\b[this,8,5]噗嗤！",
        "魔王身后的女子突然噗嗤一声，这种反常的声音让魔王的悲伤神色荡然无存。",
        {
            "type": "playBgm",
            "name": "GG1.mp3",
            "keep": true
        },
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[魔王,hero]\b[hero]你......笑了？",
        "\t[梦？,N1256]\b[this,8,5]哎呀哎呀，看来我的演技很成功呀~不仅能够构造这个虚拟世界，更没想到能让现在冷若冰霜的哥哥如此敞开心扉对“梦”说这么真挚的故事和话语呢！真不愧是我呢，嘿嘿。",
        "在“梦”说出哥哥的那一刻，魔王的身体不由自主的颤抖着......因为能叫他为哥哥的......只有.......！",
        "\t[魔王,hero]\b[hero]梦儿？？？！！！",
        {
            "type": "setBlock",
            "number": "N682",
            "loc": [
                [
                    8,
                    5
                ]
            ],
            "time": 0
        },
        {
            "type": "move",
            "loc": [
                8,
                5
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down",
                "down",
                "left",
                "left"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1271",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        "\t[仙梦,N1271]\b[this,6,7]当然是我呀~欢迎回家，哥哥。",
        "\t[魔王,hero]\b[hero]我........我竟然......真的能够.....再见到你.........。",
        "魔王抚摸着仙梦脸庞的右手顿时后撤.....",
        "\t[仙梦,N1271]\b[this,6,7]怎么了？哥哥。",
        "\t[魔王,hero]\b[hero]..........梦儿....你知道吗...我为了能够复活你.....牺牲了太多人的性命了....就连我自己的女儿也........。",
        "\t[仙梦,N1271]\b[this,6,7]嗯，我知道，我都知道。",
        "\t[魔王,hero]\b[hero]你......你知道......那你....应该会怨恨我把仙琳给..........。",
        "\t[仙梦,N1271]\b[this,6,7]没关系的，无论哥哥你过去发生了些什么，我都永远同意你的决定。我都永远爱你。",
        "\t[仙梦,N1271]\b[this,6,7]哥哥，我们走吧，离开这里吧。",
        "\t[魔王,hero]\b[hero].............谢谢你....梦儿。能与你相识是我今生最大的幸福。",
        "\t[？？？]两位请留步。",
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": "hero"
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "setBlock",
            "number": "N1371",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        {
            "type": "playBgm",
            "name": "hope3.mp3",
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "087-Action02.ogg"
        },
        {
            "type": "animate",
            "name": "buff1",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "setBlock",
            "number": "N1398",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "time": 0
        },
        "\t[守望者,N1398]\b[this,6,9]跨越无数条世界线，终于找到你们了。",
        "\t[守望者,N1398]\b[this,6,9]观测者，多谢了！",
        "\t[魔王,hero]\b[hero]你是？小粽？？",
        "\t[守望者,N1398]\b[this,6,9]不，我并不是你们所认识了那个人，你们可以称我为\r[aqua]守望者。",
        "\t[魔王,hero]\b[hero]守望者？",
        "\t[守望者,N1398]\b[this,6,9]吾之身份，不足为耳，与其在意我的身份，不如在意我的来意。",
        "\t[魔王,hero]\b[hero]你想要做什么？",
        "\t[守望者,N1398]\b[this,6,9]为了阻止邪神·谶！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[魔王,hero]\b[hero]邪神·谶？！！",
        "\t[守望者,N1398]\b[this,6,9]没错，就是制造一切悲剧的邪神·谶。",
        "\t[守望者,N1398]\b[this,6,9]邪神·谶不知道用了什么办法无视了世界线的压制，来到了你们这个世界，并且杀死了你。",
        "\t[守望者,N1398]\b[this,6,9]在你邪神·谶施展力量准备杀死小粽他们的之后我出门暂时阻止了他。",
        "\t[守望者,N1398]\b[this,6,9]只可惜就算是我也无法战胜他，在那个时候他认为他自己已经胜券在握了，于是跟我们玩了一个游戏。",
        "\t[魔王,hero]\b[hero]游戏？",
        "\t[守望者,N1398]\b[this,6,9]\"我将给予你们七天时间，在这七天内你们可以想尽一切办法提升自己的实力，在七天之后我将会再度降临。\"",
        "\t[魔王,hero]\b[hero]......他为什么要这么大费周章的跟你们玩这个游戏？难道只是单纯的恶趣味？",
        "\t[守望者,N1398]\b[this,6,9]抱歉，这种事情我也不清楚，我现在只知道这七天内是我们唯一可以战胜他的机会了。",
        "\t[魔王,hero]\b[hero]那你为什么要找我们呢，那种层次的存在，我是连反抗的能力都没有的。",
        "\t[守望者,N1398]\b[this,6,9]不，不要小瞧自己，我之所以要找你，是因为你拥有能够抗衡邪神·谶的情感之力。",
        "\t[魔王,hero]\b[hero]情感之力？",
        "\t[守望者,N1398]\b[this,6,9]对，情感之力，能够战胜邪神·谶的唯一办法。",
        "\t[守望者,N1398]\b[this,6,9]你的情感，你的故事引起了观测者的注意，观测者为了能够继续观测这个世界，让早已过世的仙梦与你团聚，并且指引我找到你们，让你们成为对抗邪神·谶的必需力量！",
        "\t[魔王,hero]\b[hero].......原来是这样.....我明白了。",
        "\t[魔王,hero]\b[hero]梦儿，你先待在这里，等我把事情解决完了就.......",
        {
            "type": "setBlock",
            "number": "N1371",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        "\t[仙梦,N1371]\b[this,6,7]哥哥你是瞧不起梦儿吗？",
        "\t[魔王,hero]\b[hero]啊这.....不是....我只是怕你受伤。",
        "\t[仙梦,N1371]\b[this,6,7]哼，我看就是哥哥瞧不起梦儿，才不让梦儿跟你一起去的。",
        "\t[魔王,hero]\b[hero]不是...我没有。",
        "\t[仙梦,N1371]\b[this,6,7]别忘了我流淌的可是仙子一族皇族的血脉呢，虽然血脉不是正统皇族的，但是实力并不逊色于哥哥你哟~",
        "\t[魔王,hero]\b[hero].....好吧，就带你去吧，",
        "\t[仙梦,N1371]\b[this,6,7]好耶，真不愧是哥哥呢。",
        "\t[魔王,hero]\b[hero]不过先说好，你别想上次一样乱胡闹啊。",
        "\t[仙梦,N1371]\b[this,6,7]嗯嗯，梦儿最乖了。",
        "\t[守望者,N1398]\b[this,6,9]事情办完了吗？办完后就放轻松，我带你们离开这里。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "setHeroIcon",
            "name": "hero.png"
        },
        {
            "type": "changeFloor",
            "floorId": "MT531",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80028,80033,80033,80033,80033,80034,80009,80032,80033,80033,80033,80033,80027],
    [80026,80044,80040,80041,80067,80044,80009,80044,80066,80041,80041,80044,80024],
    [80026,80052,80048,80049,80075,80052,80009,80052,80074,80049,80049,80052,80024],
    [80026,80060,80056,80057,80083,80060,80009,80060,80082,80057,80058,80060,80024],
    [80026,80009,80178,80179,80009,80009,80009,80009,80009,80178,80179,80009,80024],
    [80026,80009,80009,  0,  0,  0,  0,  0,1256,  0,80009,80009,80024],
    [80026,70124,80009,  0,  0,90610,90611,90612,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,70124,80009,  0,  0,  0,  0,  0,  0,  0,80009,70124,80024],
    [80026,80009,80009,  0,  0,  0,  0,  0,  0,  0,80009,80009,80024],
    [80026,80151,80135,  0,  0,  0,  0,  0,  0,  0,80135,80151,80024],
    [80026,80159,80143,80009,80009,80009,  0,80009,80009,80009,80143,80159,80024],
    [80020,80017,80017,80017,80018,80201,80201,80201,80016,80017,80017,80017,80019]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,143,143,143,143,143,143,143,80009,80009,  0],
    [  0,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,80009,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,70069,  0,  0,  0,  0,  0,70069,  0,  0,  0],
    [  0,  0,80162,80163,  0,  0,  0,  0,  0,80162,80163,  0,  0],
    [  0,80151,80170,80171,  0,80151,  0,80151,  0,80170,80171,80151,  0],
    [  0,80159,  0,101,  0,80159,  0,80159,  0,101,  0,80159,  0],
    [  0,70116,  0,102,  0,90602,  0,90604,  0,102,  0,70116,  0],
    [  0,70116,  0,  0,  0,90610,  0,90612,  0,  0,  0,70116,  0],
    [  0,70116,  0,  0,  0,  0,  0,  0,  0,  0,  0,70116,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,101,  0,  0,  0,  0,  0,101,  0,  0,  0],
    [  0,  0,  0,102,  0,  0,  0,  0,  0,102,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90603,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}