main.floors.MT528=
{
    "floorId": "MT528",
    "title": "世界线的终焉",
    "name": "世界线的终焉",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "universe2.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        },
        {
            "name": "xianya.png",
            "canvas": "fg",
            "x": 168,
            "y": 166,
            "h": 64,
            "frame": 4
        }
    ],
    "ratio": 1,
    "defaultGround": "T1158",
    "bgm": "universe5.mp3",
    "firstArrive": [
        {
            "type": "hideFloorImg",
            "loc": [
                [
                    168,
                    166
                ]
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,8": [
            {
                "type": "playBgm",
                "name": "slience3.mp3",
                "keep": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[仙琳,fairy]\b[hero]是你？！名为仙雅的女子。",
            "\t[仙雅,N1256]\b[this,6,6]................",
            "\t[仙琳,fairy]\b[hero].......你究竟是什么身份？为什么要三番四次的阻拦我？",
            "\t[仙琳,fairy]\b[hero]还有那些近似于巅峰神灵战力的意志体都是你创造的吗？",
            "\t[仙雅,N1256]\b[this,6,6]................",
            "\t[仙琳,fairy]\b[hero]回答我，这次我可不会再让你逃走了！",
            "\t[仙雅,N1256]\b[this,6,6]................你所看到的这一切难道不是你的杰作吗？",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[仙琳,fairy]\b[hero]你在开什么玩笑？？！",
            "\t[仙雅,N1256]\b[this,6,6]不，这并不是玩笑话，而是现实。",
            "\t[仙雅,N1256]\b[this,6,6]你难道不觉得奇怪吗？在你踏入夹域之地时，你并没有受到世界线的压制。只有一些奇形怪状的意志体阻拦你。",
            "\t[仙雅,N1256]\b[this,6,6]而其他人，比如你最挂念的小粽，他无时无刻不被世界线所排斥。而你却没有出现这种现象。",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[仙琳,fairy]\b[hero]！！你怎么会知道这种事？！",
            "\t[仙雅,N1256]\b[this,6,6]不必激动，我之所以能够知道这些那是因为我可以看透一个人所蕴含的情感。",
            "\t[仙琳,fairy]\b[hero]看透一个人所蕴含的情感，这是何意？",
            "\t[仙雅,N1256]\b[this,6,6]你应该知道，凡是智慧生灵都会拥有七情六欲。正是因为有七情六欲，人与人之间才能够有所联系。也可以称作因缘。",
            "\t[仙雅,N1256]\b[this,6,6]而我的能力则是观测出生物的情感，并且将以引导。",
            "\t[仙琳,fairy]\b[hero]所以这跟你知道小粽这件事有什么关系吗？",
            "\t[仙雅,N1256]\b[this,6,6]呵，看来你还是不明白呀，我之前说过，我的能力是观测，我观测出了你最珍视的人是谁，并且我还动用了一缕残念去好好看了看那个小家伙呢。",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[仙琳,fairy]\b[hero]他怎么样了！你要是敢伤他，我现在就杀了你！",
            "\t[仙雅,N1256]\b[this,6,6]啧，脾气咋这么暴躁，放心好了，那个小家伙可不一般，至少现在我是杀不了他的。",
            "\t[仙琳,fairy]\b[hero]你的动机究竟是什么？！",
            "\t[仙雅,N1256]\b[this,6,6].......回到之前的话题，我之前说你不会受到世界线的压制，并且这些意志体是由你而诞生的，你明白吗？",
            "\t[仙雅,N1256]\b[this,6,6]....看你这表情就知道你完全不会相信我所说的话，毕竟现在的你可不是\r[aqua]仙雅了呀！",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[仙琳,fairy]\b[hero]你说什么？！！",
            "\t[仙雅,N1256]\b[this,6,6]你并没有听错，你，就是当初仙子一族的第一位神灵\r[aqua]仙雅！",
            "\t[仙琳,fairy]\b[hero]不可能！！我怎么可能是仙雅！！",
            "\t[仙琳,fairy]\b[hero]不要以为你用这种谶语就可以迷惑我！",
            "\t[仙雅,N1256]\b[this,6,6]不，这并不是谶语，而是现实。",
            "\t[仙琳,fairy]\b[hero]那你呢！如果按你所说的我是仙雅的话，那你是谁？！",
            "\t[仙雅,N1256]\b[this,6,6]我？呵呵呵.....我当然也是仙雅了。",
            "\t[仙琳,fairy]\b[hero]什么....？",
            "\t[仙雅,N1256]\b[this,6,6]放轻松，我知道这种情况对你现在来说难以接受，让我慢慢跟你分析。",
            "\t[仙琳,fairy]\b[hero]分析？有什么好分析的！别开玩笑了！！",
            "仙琳右手凝聚魔法能量准备轰击这个大说胡话的家伙。",
            {
                "type": "playBgm",
                "name": "disorder11.mp3"
            },
            "\t[仙雅,N1256]\b[this,6,6]好久不见，仙雅的未来身。",
            "在受到仙琳的魔法攻击之前仙雅却吐出了这么一句话....",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            {
                "type": "setBlock",
                "number": "fairy",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 0
            },
            "然而就在这个时候仙琳眼前不再是那个与“梦”一模一样的仙雅，而是与自己外貌完全一致的“仙琳”!",
            "与仙琳外貌完全一致的“她”轻轻向外挥出，仙琳的攻击居然以肉眼可见般的消融！！",
            "\t[仙琳,fairy]\b[hero]什么？！怎么可能！！",
            "“她”在抵消掉仙琳的攻击之后并没有进行反击，反而是看了一眼仙琳，并且身躯逐渐消散..",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 500
            },
            "而此时，仙琳眼前的景象产生了巨大的变动。",
            "\t[仙琳,fairy]\b[hero]！！！",
            {
                "type": "showImage",
                "code": 1,
                "image": "stop8.png",
                "loc": [
                    0,
                    0
                ],
                "opacity": 1,
                "time": 500
            },
            "仙琳看到眼前的景象不由自主的捏紧自己的衣颈......至于她为什么这么做，是因为她看到了——",
            "\r[red]“小粽”掐住了“仙琳”的喉咙！",
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            "“小粽”对“仙琳”不知道念叨了些什么，并且那之后右手一捏掐断了“仙琳”的喉咙！",
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 0
            },
            {
                "type": "setBlock",
                "number": "N1256",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 1,
                "time": 500
            },
            "仙琳眼前的景象到这里就结束了，这里不再有“小粽“与“仙琳”，只有仙雅在这里默默的注视她........。",
            "\t[仙琳,fairy]\b[hero]呼..........呼............",
            "\t[仙琳,fairy]\b[hero]呼..........呼..................",
            "\t[仙雅,N1256]\b[this,6,6]明白了吗？这就是当初仙雅的末路，也是你的末路。",
            "\t[仙雅,N1256]\b[this,6,6]曾经仙子一族第一位神灵仙雅，由于一些原因，死在了他的手中。",
            "\t[仙雅,N1256]\b[this,6,6]\r[red]而你的真实身份也就是神灵仙雅的未来身！",
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            {
                "type": "vibrate",
                "time": 500
            },
            "\t[仙琳,fairy]\b[hero]怎么可能..........怎么可能........！",
            "\t[仙琳,fairy]\b[hero]哈......哈.....骗人.....这都是骗人的！",
            "\t[仙雅,N1256]\b[this,6,6]作为与你同样身份的我，理解你此时的心情，但是你必须接受。",
            "\t[仙琳,fairy]\b[hero]接受.....你让我如何接受？！",
            "\t[仙琳,fairy]\b[hero].....那你呢.....你既然说你也是仙雅，那你的身份是什么呢。",
            "\t[仙雅,N1256]\b[this,6,6]我的身份吗.........我其实真名就是仙雅，正好与你们世界的神灵仙雅同一个名字。哦，准确来说是你们的神灵用的我的名字。",
            {
                "type": "setVolume",
                "value": 0,
                "time": 500
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setVolume",
                "value": 90,
                "time": 0
            },
            "\t[仙琳,fairy]\b[hero]..........什么意思？",
            {
                "type": "playBgm",
                "name": "holy9.mp3",
                "keep": true
            },
            "\t[仙雅,N1256]\b[this,6,6]\r[red]因为！我就是神灵仙雅的过去身！你们所知道的仙雅是按照我的模板而书写的存在！",
            {
                "type": "playSound",
                "name": "049-Explosion02.ogg"
            },
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            {
                "type": "vibrate",
                "time": 500
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[仙琳,fairy]\b[hero]什么！！",
            "\t[仙雅,N1256]\b[this,6,6]你应该明白这个道理——历史是由胜利者来书写的。你们所认为的历史何尝不过是更高存在所把弄的玩物呢？",
            "\t[仙琳,fairy]\b[hero].........所以你想做什么？",
            "\t[仙雅,N1256]\b[this,6,6]那当然是赎罪啊！为了我之前所犯下的罪过而赎罪！！",
            "\t[仙琳,fairy]\b[hero]赎罪？",
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            "\t[仙琳,fairy]\b[hero]难道你所说的赎罪是对你所说的少爷？？！",
            "\t[仙雅,N1256]\b[this,6,6]没错！就是这样！！曾经，我因为自己一时的愚昧导致少爷极度悲伤。",
            "\t[仙雅,N1256]\b[this,6,6]等我死亡之后，我的意识并没有被时间长河所吞噬，反而是为我凝聚这道意识。",
            "\t[仙雅,N1256]\b[this,6,6]而在我凝聚之后我学会了观测能力，发现了这个世界有观测者的存在。",
            "\t[仙雅,N1256]\b[this,6,6]只可惜我这道意识只能存活于世界线的夹域之中，并不能离开这里。",
            "\t[仙雅,N1256]\b[this,6,6]不过功夫不愧有心人，在我的观测能力之下，我终于找到了寻找复活自己的方法。",
            "\t[仙雅,N1256]\b[this,6,6]那就是吸收观测者所选定的既定之人的力量！！",
            "\t[仙雅,N1256]\b[this,6,6]一般既定之人只会对应一个人，不过我比较独特，要吸收的既定之人是两个人，而其中一个就是你！",
            "\t[仙雅,N1256]\b[this,6,6]于是我开始设计棋盘，用各种手段引导和建造魔塔，目的就是为了培养你们，然后供我吞噬！！",
            {
                "type": "screenFlash",
                "color": [
                    255,
                    255,
                    255,
                    1
                ],
                "time": 500,
                "times": 1
            },
            {
                "type": "showFloorImg",
                "loc": [
                    [
                        168,
                        166
                    ]
                ]
            },
            {
                "type": "setBlock",
                "number": "E1530",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "time": 0
            },
            "\t[仙雅,N1256]\b[this,6,6]那么现在！你准备好了吗？！",
            "\t[仙琳,fairy]\b[hero].........虽然很难以相信这一切.....但是！",
            "\t[仙琳,fairy]\b[hero]那又怎么样呢！！",
            "\t[仙琳,fairy]\b[hero]无论我是仙琳，还是所谓的神灵仙雅，这对我来说真的重要吗？",
            "\t[仙琳,fairy]\b[hero]敢爱敢恨，才是我的作风，因为...",
            "\t[仙琳,fairy]\b[hero]\r[red]这才是我啊！！",
            "\t[仙琳,fairy]\b[hero]来吧！我是绝对不会让你的阴谋得逞的！！",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,9": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT520\", \"MT521\", \"MT522\", \"MT523\", \"MT524\", \"MT525\", \"MT526\", \"MT527\", \"MT528\"]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==0)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "remove": true
                    }
                ]
            }
        ],
        "6,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                {
                    "type": "if",
                    "condition": "(flag:boss527F===8)",
                    "true": [
                        {
                            "type": "pauseBgm"
                        },
                        {
                            "type": "callBook"
                        },
                        "\t[仙雅,N1256]\b[this,6,6]明白了吗？！你是不可能击败我的！！",
                        "\t[仙雅,N1256]\b[this,6,6]在我的能力之下，你的能力会完全被我压制！！",
                        "\t[仙琳,hero]\b[hero]............",
                        "\t[仙雅,N1256]\b[this,6,6]无论是生命还是攻击，我都完全碾压！所以说！！你.......",
                        "\t[仙琳,hero]\b[hero]你真的好吵呀。",
                        {
                            "type": "playSound",
                            "name": "cgefc01.wav"
                        },
                        {
                            "type": "animate",
                            "name": "unexpected1",
                            "loc": [
                                6,
                                6
                            ]
                        },
                        "\t[仙雅,N1256]\b[this,6,6]哦？！",
                        "\t[仙琳,hero]\b[hero]虽然我不知道你对你那所谓的少爷做了什么对不起他的事情，但是我现在只知道你现在只是一个为了赎罪而不择手段的女人！",
                        "\t[仙雅,N1256]\b[this,6,6]哼！那又如何，只要能够赎清我自己的罪恶，便足够了！",
                        "\t[仙琳,hero]\b[hero]是吗，看来你已经被所谓的赎罪蒙蔽了自己的双眼。",
                        "\t[仙雅,N1256]\b[this,6,6]哦，反正你马上就是个死人了，我就暂且让你说这些不知所谓的大道理吧！",
                        "\t[仙琳,hero]\b[hero]...........",
                        {
                            "type": "setValue",
                            "name": "status:mdef",
                            "value": "0"
                        },
                        "仙琳散去的自己的护盾力量。",
                        {
                            "type": "playSound",
                            "name": "cgefc01.wav"
                        },
                        {
                            "type": "animate",
                            "name": "unexpected1",
                            "loc": [
                                6,
                                6
                            ]
                        },
                        "\t[仙雅,N1256]\b[this,6,6]居然将自己的护盾之力化为了虚无？！",
                        "\t[仙雅,N1256]\b[this,6,6]哼，不错的想法，这样一来我的净化之力对你来说的确是毫无作用了。",
                        "\t[仙雅,N1256]\b[this,6,6]不过就算你把自己的护盾散去又如何？你现在的生命气息早就衰竭！根本没有与我对抗的资本！",
                        "\t[仙琳,hero]\b[hero]是吗？",
                        {
                            "type": "playSound",
                            "name": "087-Action02.ogg"
                        },
                        {
                            "type": "animate",
                            "name": "buff1",
                            "loc": [
                                6,
                                7
                            ]
                        },
                        {
                            "type": "changePos",
                            "loc": [
                                15,
                                0
                            ]
                        },
                        {
                            "type": "setBlock",
                            "number": "N1397",
                            "loc": [
                                [
                                    6,
                                    7
                                ]
                            ],
                            "time": 0
                        },
                        {
                            "type": "playBgm",
                            "name": "lolita4.mp3",
                            "keep": true
                        },
                        "仙琳完全开启皇族形态 血量提升3000亿！ 并且攻防变成原来的两倍 ！！",
                        {
                            "type": "hideStatusBar"
                        },
                        {
                            "type": "setValue",
                            "name": "status:hp",
                            "operator": "+=",
                            "value": "300000000000"
                        },
                        {
                            "type": "setValue",
                            "name": "status:atk",
                            "operator": "*=",
                            "value": "2"
                        },
                        {
                            "type": "setValue",
                            "name": "status:def",
                            "operator": "*=",
                            "value": "2"
                        },
                        {
                            "type": "playSound",
                            "name": "cgefc01.wav"
                        },
                        {
                            "type": "animate",
                            "name": "unexpected1",
                            "loc": [
                                6,
                                6
                            ]
                        },
                        "\t[仙雅,N1256]\b[this,6,6]什么？！这是怎么回事？！明明你的生命气息已经衰竭，怎么可能突然爆发出如此强大的力量？！！",
                        "\t[仙雅,N1256]\b[this,6,6]怎么可能！！",
                        "\t[仙琳,N1397]\b[this,6,7]哦？这不就是仙子一族成为神灵的形态吗，有什么问题吗？",
                        "\t[仙雅,N1256]\b[this,6,6]开什么玩笑！这.....这怎么会！！就算是当初的仙雅也没有这个力量！！",
                        "\t[仙雅,N1256]\b[this,6,6]你！究竟是谁？！",
                        "\t[仙琳,N1397]\b[this,6,7]....虽然不知道你为什么看我我现在这副模样会如此激动，但是我现在知道你的阴谋——\r[red]结束了！",
                        {
                            "type": "battle",
                            "id": "E1530"
                        },
                        {
                            "type": "setCurtain",
                            "color": [
                                255,
                                255,
                                255,
                                1
                            ],
                            "time": 500,
                            "keep": true
                        },
                        "\t[仙雅,N1256]\b[this,6,6]不可能！！！",
                        {
                            "type": "sleep",
                            "time": 500
                        },
                        {
                            "type": "hideFloorImg",
                            "loc": [
                                [
                                    168,
                                    166
                                ]
                            ]
                        },
                        {
                            "type": "setBlock",
                            "number": "N1371",
                            "loc": [
                                [
                                    6,
                                    6
                                ]
                            ],
                            "time": 0
                        },
                        {
                            "type": "setCurtain",
                            "time": 1000
                        },
                        {
                            "type": "playBgm",
                            "name": "GG3.mp3",
                            "keep": true
                        },
                        "\t[仙琳,N1397]\b[this,6,7].................",
                        {
                            "type": "screenFlash",
                            "color": [
                                255,
                                0,
                                0,
                                1
                            ],
                            "time": 500,
                            "times": 1
                        },
                        "\t[仙琳,N1397]\b[this,6,7]\r[red]咳咳咳！！",
                        "\t[仙琳,N1397]\b[this,6,7]（没想到我开启这个形态居然能够有如此强大的实力.......不过我感觉现在的我依旧无法完全掌握...。）",
                        "\t[仙雅,N1371]\b[this,6,6]..................",
                        "\t[仙琳,N1397]\b[this,6,7]没想到你的这道意志居然还残留在此？！",
                        "\t[仙琳,N1397]\b[this,6,7]就让我.........",
                        "\t[仙雅,N1371]\b[this,6,6]..................不必了，我已经恢复正常了。",
                        "\t[仙琳,N1397]\b[this,6,7]恢复正常？什么意思。",
                        "\t[仙雅,N1371]\b[this,6,6]就是字面意思，谢谢你，名为仙琳的神灵，谢谢你让我得以解脱。",
                        "\t[仙琳,N1397]\b[this,6,7]等等！你究竟在说什么？",
                        "\t[仙雅,N1371]\b[this,6,6]就在这短暂的时间内重新向你告诉有关于我的一切真相吧。",
                        "\t[仙雅,N1371]\b[this,6,6]我的名字叫仙雅，曾经的我，因体弱多病，经常遭到贼人所害。",
                        "\t[仙雅,N1371]\b[this,6,6]有一次，在我即将被人伤害的时候，那个人救赎了我。",
                        "\t[仙琳,N1397]\b[this,6,7]那个人？你说的是......。",
                        "\t[仙雅,N1371]\b[this,6,6]没错，就是你想的那样，我口中的少爷。",
                        "\t[仙雅,N1371]\b[this,6,6]是他救赎了我，并且给予了我全新的生活。",
                        "\t[仙雅,N1371]\b[this,6,6]在那个时候为了报答少爷对我的恩情，我本来打算是以身相许的，但是少爷却说：",
                        "\t[仙雅,N1371]\b[this,6,6]\"不，我不希望你就这么简单的决定自己的命运。我也不希望我的出手相助对你来说成为一种道德绑架。\"",
                        "\t[仙雅,N1371]\b[this,6,6]\"我只希望你能够做好自己，并且能够平安就好。\"",
                        "\t[仙琳,N1397]\b[this,6,7]..............后来呢？",
                        "\t[仙雅,N1371]\b[this,6,6]后来吗.......少爷因知我体弱多病，不惜去极危之地为我取得草药，只为治疗我的隐病。",
                        "\t[仙琳,N1397]\b[this,6,7]如果故事是按照你这么说的话，那后来你的病情一定会好转，乃至完全治愈才对，而现在你又为什么会出现在这里，还有要对你口中的少爷赎罪呢？",
                        "\t[仙雅,N1371]\b[this,6,6]是呀，如果现实真的就像故事一般顺理成章的接下去就好了，可惜现实是残酷的........。",
                        "\t[仙雅,N1371]\b[this,6,6]有一次在少爷取得草药回来的时候，浑身是伤，后来我得知少爷是为了取得草药不小心被岩浆所烫伤。",
                        "\t[仙雅,N1371]\b[this,6,6]你知道那是怎样的伤势吗？保护身体的肌肉几乎全部被烫伤，甚至连体内的骨头都清晰可见！",
                        "\t[仙琳,N1397]\b[this,6,7]..............这........。",
                        "\t[仙雅,N1371]\b[this,6,6]我在看到少爷受伤如此严重第一时间指责了少爷。但是少爷却说这是他应该做的。",
                        "\t[仙琳,N1397]\b[this,6,7].....................。",
                        "\t[仙雅,N1371]\b[this,6,6]而那时我对少爷说：“我不希望少爷为了我而受这么重的伤，如果少爷你执意如此...那我就死给你看！”",
                        "\t[仙雅,N1371]\b[this,6,6]但是少爷却笑着说我不会这样的。",
                        "\t[仙琳,N1397]\b[this,6,7].....................难道后来........。",
                        "\t[仙雅,N1371]\b[this,6,6]嗯，自那以后，我就再也没有吃过少爷为我做的药汤，每次少爷给我药汤的时候....我都偷偷倒掉了。",
                        {
                            "type": "playSound",
                            "name": "cgefc01.wav"
                        },
                        {
                            "type": "animate",
                            "name": "unexpected1",
                            "loc": [
                                6,
                                7
                            ]
                        },
                        "\t[仙琳,N1397]\b[this,6,7]为什么你要这么做？",
                        "\t[仙雅,N1371]\b[this,6,6]我不希望少爷因为我这个没用的女子而付出宝贵的时间与生命，我更不希望少爷因为我而受伤....所以我才这样...。",
                        "\t[仙琳,N1397]\b[this,6,7]你不应该这么自私，你不应该为了自己的一己私欲而不顾他人的感受。",
                        "\t[仙雅,N1380]\b[this,6,6]是呀......我是一个自私的女人，我就像少爷说的那样....是一个傻女人...是一个没用的女人....",
                        "\t[仙雅,N1371]\b[this,6,6]或许.....我从一开始就应该被贼人所杀害，不应该与少爷结下这段因缘。",
                        "\t[仙雅,N1371]\b[this,6,6]或许.....我从一开始就不应该活着...因为我活着只是为了给他人添麻烦.....。",
                        "\t[仙雅,N1371]\b[this,6,6]或许.........！",
                        "\t[仙琳,N1397]\b[this,6,7]够了！！",
                        {
                            "type": "playSound",
                            "name": "cgefc01.wav"
                        },
                        {
                            "type": "animate",
                            "name": "unexpected1",
                            "loc": [
                                6,
                                6
                            ]
                        },
                        "\t[仙雅,N1371]\b[this,6,6].............",
                        "\t[仙琳,N1397]\b[this,6,7]不要就这样轻易否定自己的存在，我们每个人存在这这个世界那必然是有存在的意义。",
                        "\t[仙琳,N1397]\b[this,6,7]或许我们在追寻真相的旅途中会迷茫，会悲伤，会绝望。但是！",
                        "\t[仙琳,N1397]\b[this,6,7]这些都是我们成长所必须经历的挫折！必须经历的过程！！",
                        "\t[仙琳,N1397]\b[this,6,7]而你现在却只是在自暴自弃，遇到困难就只是在逃避！！",
                        "\t[仙雅,N1371]\b[this,6,6].................",
                        "\t[仙琳,N1397]\b[this,6,7]........当然...或许是因为你太善良了，不希望他人为你而受伤才会选择逃避的.....。",
                        "\t[仙雅,N1371]\b[this,6,6].................",
                        "\t[仙琳,N1397]\b[this,6,7]善良固然是一个非常好的品质，但是极致的善良可能却导致极致的邪恶。你知道吗？",
                        "\t[仙雅,N1371]\b[this,6,6].................",
                        "\t[仙琳,N1397]\b[this,6,7]或许在你眼中....自杀...让他人不再挂念你，是一种非常好的解决问题的方法。",
                        "\t[仙琳,N1397]\b[this,6,7]或许在他人眼中，尤其是你所挂念的少爷，当他看到....你为了让他不再操心而选择自杀的时候....就是一种极度的邪恶。",
                        "\t[仙琳,N1397]\b[this,6,7]因为你的这种行为在他看来.....比别人在他面前亲手杀死你还要沉重！",
                        "\t[仙雅,N1371]\b[this,6,6].................",
                        "\t[仙琳,N1397]\b[this,6,7]你知道你自己的行为给予了他多么沉重的打击吗？你难道就这么轻易的否定他为你所做的一切吗？你难道真的....只是会选择逃避吗？......",
                        "\t[仙雅,N1371]\b[this,6,6]是呀....都是仙雅的错....都是仙雅的错，我不应该就这样轻易否定自己...不应该轻易否定少爷为我做的一切.........。",
                        "\t[仙雅,N1371]\b[this,6,6]谢谢你，让我能够重新正视自己。",
                        {
                            "type": "setBlock",
                            "number": "N1380",
                            "loc": [
                                [
                                    6,
                                    6
                                ]
                            ],
                            "time": 500
                        },
                        "\t[仙琳,N1397]\b[this,6,7]等等！你的身体！！",
                        "\t[仙雅,N1380]\b[this,6,6].........这是我残留世界线的执念，毕竟当初的仙雅早就死了....唯独留下这不愿离去只为赎罪的执念。",
                        "\t[仙雅,N1380]\b[this,6,6]在你感化了我之后....这道执念将不再被赎罪二字所束缚。换来的则是消散于时间长河。",
                        "\t[仙琳,N1397]\b[this,6,7]这......",
                        "\t[仙雅,N1380]\b[this,6,6]不必为我悲伤，毕竟我本身的存在就已经违背了世界线的法则.....现在也只是让世界线重新正常运转罢了。",
                        "\t[仙琳,N1397]\b[this,6,7]............",
                        "\t[仙雅,N1380]\b[this,6,6]作为旧时代的仙雅，不应该继续阻拦新时代的仙雅的发展........不是吗？",
                        "\t[仙琳,N1397]\b[this,6,7]....................",
                        "\t[仙雅,N1380]\b[this,6,6]在永别之前，我希望你不要把我的事情告诉给任何人，包括你最珍视的人。",
                        "\t[仙琳,N1397]\b[this,6,7]............为什么？",
                        "\t[仙雅,N1380]\b[this,6,6]...........因为，我只是希望你们平安就好。",
                        "\t[仙琳,N1397]\b[this,6,7]............",
                        "\t[仙雅,N1380]\b[this,6,6]这是我最后一个任性的请求，你愿意接受我这个小小的请求吗？",
                        "\t[仙琳,N1397]\b[this,6,7]............",
                        "\t[仙琳,N1397]\b[this,6,7]................",
                        "\t[仙琳,N1397]\b[this,6,7]................放心吧，我不会告诉给其他人的。",
                        "\t[仙雅,N1380]\b[this,6,6]谢谢.....希望下一世....我....不再像.....现在一样.....任....性.....呀......。",
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    6,
                                    6
                                ]
                            ],
                            "remove": true,
                            "time": 500
                        },
                        "\t[仙琳,N1397]\b[this,6,7]................",
                        "\t[仙琳,N1397]\b[this,6,7]................仙雅，虽然我不认同你对我所说我是仙雅的未来身这个身份，但是你的情感，你的故事，我会记住的。",
                        "\t[仙琳,N1397]\b[this,6,7]唔，身体暂时没力气了，必须进行调整。",
                        "\t[仙琳,N1397]\b[this,6,7]希望小粽他们能够旅途顺利。",
                        {
                            "type": "setCurtain",
                            "color": [
                                0,
                                0,
                                0,
                                1
                            ],
                            "time": 500,
                            "keep": true
                        },
                        {
                            "type": "if",
                            "condition": "(flag:求道者===1)",
                            "true": [
                                "与此同时..............",
                                {
                                    "type": "setHeroIcon",
                                    "name": "hero2.png"
                                },
                                {
                                    "type": "changeFloor",
                                    "floorId": "MT529",
                                    "loc": [
                                        6,
                                        6
                                    ],
                                    "direction": "down",
                                    "time": 0
                                },
                                {
                                    "type": "update"
                                }
                            ],
                            "false": [
                                {
                                    "type": "if",
                                    "condition": "(flag:梦之泪===1)",
                                    "true": [
                                        {
                                            "type": "setHeroIcon",
                                            "name": "hero.png"
                                        },
                                        {
                                            "type": "changeFloor",
                                            "floorId": "MT531",
                                            "loc": [
                                                6,
                                                12
                                            ],
                                            "direction": "up",
                                            "time": 0
                                        },
                                        {
                                            "type": "update"
                                        }
                                    ],
                                    "false": [
                                        {
                                            "type": "setHeroIcon",
                                            "name": "hero.png"
                                        },
                                        {
                                            "type": "changeFloor",
                                            "floorId": "MT573",
                                            "loc": [
                                                6,
                                                12
                                            ],
                                            "direction": "up",
                                            "time": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ],
                    "false": [
                        {
                            "type": "if",
                            "condition": "(flag:boss527F===7)",
                            "true": [
                                {
                                    "type": "battle",
                                    "id": "E1530"
                                },
                                "\t[仙琳,hero]\b[hero]咳咳咳！！",
                                "\t[仙雅,N1256]\b[this,6,6]我有点烦躁了，下一招就结束这一切吧！",
                                "仙雅完全施展能力！全属性大幅度提升！净化效果变成1888倍！！！！",
                                {
                                    "type": "setValue",
                                    "name": "flag:boss527F",
                                    "value": "8",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "E1530",
                                    "name": "hp",
                                    "value": "1000000000000"
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "E1530",
                                    "name": "atk",
                                    "value": "2500000000"
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "E1530",
                                    "name": "def",
                                    "value": "300000000"
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "E1530",
                                    "name": "n",
                                    "value": "1888"
                                },
                                {
                                    "type": "update"
                                }
                            ],
                            "false": [
                                {
                                    "type": "if",
                                    "condition": "(flag:boss527F===6)",
                                    "true": [
                                        {
                                            "type": "battle",
                                            "id": "E1530"
                                        },
                                        "\t[仙琳,hero]\b[hero].............",
                                        "\t[仙雅,N1256]\b[this,6,6].........奇怪，究竟是什么力量在支撑着你，竟然还能如此坚持。",
                                        "仙雅加强情感之力，全属性提升！净化效果变成26倍！",
                                        {
                                            "type": "setValue",
                                            "name": "flag:boss527F",
                                            "value": "7",
                                            "norefresh": true
                                        },
                                        {
                                            "type": "setEnemy",
                                            "id": "E1530",
                                            "name": "hp",
                                            "value": "550000000000"
                                        },
                                        {
                                            "type": "setEnemy",
                                            "id": "E1530",
                                            "name": "atk",
                                            "value": "1200000000"
                                        },
                                        {
                                            "type": "setEnemy",
                                            "id": "E1530",
                                            "name": "def",
                                            "value": "300000000"
                                        },
                                        {
                                            "type": "setEnemy",
                                            "id": "E1530",
                                            "name": "n",
                                            "value": "26"
                                        },
                                        {
                                            "type": "update"
                                        }
                                    ],
                                    "false": [
                                        {
                                            "type": "if",
                                            "condition": "(flag:boss527F===5)",
                                            "true": [
                                                {
                                                    "type": "battle",
                                                    "id": "E1530"
                                                },
                                                {
                                                    "type": "setValue",
                                                    "name": "flag:boss527F",
                                                    "value": "6",
                                                    "norefresh": true
                                                },
                                                "\t[仙雅,N1256]\b[this,6,6]哦？没想到在我的压制之下，你居然能够够站在我面前，不愧是观测者选中的既定之人，不过那又如何呢？",
                                                "\t[仙雅,N1256]\b[this,6,6]你已经摆脱不了被我吞噬的命运！",
                                                "仙雅加强情感之力，全属性提升！净化效果变成24倍！",
                                                {
                                                    "type": "setEnemy",
                                                    "id": "E1530",
                                                    "name": "hp",
                                                    "value": "60000000000"
                                                },
                                                {
                                                    "type": "setEnemy",
                                                    "id": "E1530",
                                                    "name": "atk",
                                                    "value": "1800000000"
                                                },
                                                {
                                                    "type": "setEnemy",
                                                    "id": "E1530",
                                                    "name": "def",
                                                    "value": "500000000"
                                                },
                                                {
                                                    "type": "setEnemy",
                                                    "id": "E1530",
                                                    "name": "n",
                                                    "value": "24"
                                                },
                                                {
                                                    "type": "update"
                                                }
                                            ],
                                            "false": [
                                                {
                                                    "type": "if",
                                                    "condition": "(flag:boss527F===4)",
                                                    "true": [
                                                        {
                                                            "type": "battle",
                                                            "id": "E1530"
                                                        },
                                                        {
                                                            "type": "setValue",
                                                            "name": "flag:boss527F",
                                                            "value": "5",
                                                            "norefresh": true
                                                        },
                                                        "\t[仙琳,hero]\b[hero]唔！",
                                                        "\t[仙雅,N1256]\b[this,6,6]呵呵呵.....看来你已经快要不行了，那就最好了！只要杀了你我就能够重新复活，并且为少爷赎罪了！哈哈哈哈哈哈哈哈！！",
                                                        "仙雅加强情感之力，全属性提升！净化效果变成22倍！",
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1530",
                                                            "name": "hp",
                                                            "value": "55000000000"
                                                        },
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1530",
                                                            "name": "atk",
                                                            "value": "1800000000"
                                                        },
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1530",
                                                            "name": "def",
                                                            "value": "475000000"
                                                        },
                                                        {
                                                            "type": "setEnemy",
                                                            "id": "E1530",
                                                            "name": "n",
                                                            "value": "22"
                                                        },
                                                        {
                                                            "type": "update"
                                                        }
                                                    ],
                                                    "false": [
                                                        {
                                                            "type": "if",
                                                            "condition": "(flag:boss527F===3)",
                                                            "true": [
                                                                {
                                                                    "type": "battle",
                                                                    "id": "E1530"
                                                                },
                                                                {
                                                                    "type": "setValue",
                                                                    "name": "flag:boss527F",
                                                                    "value": "4",
                                                                    "norefresh": true
                                                                },
                                                                "\t[仙雅,N1256]\b[this,6,6]没用的，没用的！你还不明白吗？与其让你这么痛苦，还不如让我杀了你为少爷赎罪呢！",
                                                                "仙雅加强情感之力，全属性提升！净化效果变成20倍！",
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1530",
                                                                    "name": "hp",
                                                                    "value": "50000000000"
                                                                },
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1530",
                                                                    "name": "atk",
                                                                    "value": "1750000000"
                                                                },
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1530",
                                                                    "name": "def",
                                                                    "value": "450000000"
                                                                },
                                                                {
                                                                    "type": "setEnemy",
                                                                    "id": "E1530",
                                                                    "name": "n",
                                                                    "value": "20"
                                                                },
                                                                {
                                                                    "type": "update"
                                                                }
                                                            ],
                                                            "false": [
                                                                {
                                                                    "type": "if",
                                                                    "condition": "(flag:boss527F===2)",
                                                                    "true": [
                                                                        {
                                                                            "type": "battle",
                                                                            "id": "E1530"
                                                                        },
                                                                        {
                                                                            "type": "setValue",
                                                                            "name": "flag:boss527F",
                                                                            "value": "3"
                                                                        },
                                                                        "\t[仙雅,N1256]\b[this,6,6]你应该发现了，每次在你击败我一个形态的之后，你的护盾能力会越来越成为你的累赘！",
                                                                        "仙雅加强情感之力，全属性提升！净化效果变成18倍！",
                                                                        {
                                                                            "type": "setEnemy",
                                                                            "id": "E1530",
                                                                            "name": "hp",
                                                                            "value": "45000000000"
                                                                        },
                                                                        {
                                                                            "type": "setEnemy",
                                                                            "id": "E1530",
                                                                            "name": "atk",
                                                                            "value": "1700000000"
                                                                        },
                                                                        {
                                                                            "type": "setEnemy",
                                                                            "id": "E1530",
                                                                            "name": "def",
                                                                            "value": "400000000"
                                                                        },
                                                                        {
                                                                            "type": "setEnemy",
                                                                            "id": "E1530",
                                                                            "name": "n",
                                                                            "value": "18"
                                                                        },
                                                                        {
                                                                            "type": "update"
                                                                        }
                                                                    ],
                                                                    "false": [
                                                                        {
                                                                            "type": "if",
                                                                            "condition": "(flag:boss527F===1)",
                                                                            "true": [
                                                                                {
                                                                                    "type": "battle",
                                                                                    "id": "E1530"
                                                                                },
                                                                                {
                                                                                    "type": "setValue",
                                                                                    "name": "flag:boss527F",
                                                                                    "value": "2"
                                                                                },
                                                                                "\t[仙雅,N1256]\b[this,6,6]我说过，你的能力来源于我，你最擅长的护盾之力在我面前如同虚设！",
                                                                                "仙雅加强情感之力，全属性提升！净化效果变成16倍！",
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "hp",
                                                                                    "value": "40000000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "atk",
                                                                                    "value": "1675000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "def",
                                                                                    "value": "350000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "n",
                                                                                    "value": "16"
                                                                                },
                                                                                {
                                                                                    "type": "update"
                                                                                },
                                                                                {
                                                                                    "type": "waitAsync"
                                                                                }
                                                                            ],
                                                                            "false": [
                                                                                {
                                                                                    "type": "battle",
                                                                                    "id": "E1530"
                                                                                },
                                                                                {
                                                                                    "type": "setValue",
                                                                                    "name": "flag:boss527F",
                                                                                    "value": "1"
                                                                                },
                                                                                "\t[仙雅,N1256]\b[this,6,6]没用的，你的能力是来源于我，是我创造了你的存在。",
                                                                                "\t[仙雅,N1256]\b[this,6,6]你的攻击对我来说毫无作用！",
                                                                                "仙雅加强情感之力，全属性提升！净化效果变成14倍！",
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "hp",
                                                                                    "value": "35000000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "atk",
                                                                                    "value": "1650000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "def",
                                                                                    "value": "300000000"
                                                                                },
                                                                                {
                                                                                    "type": "setEnemy",
                                                                                    "id": "E1530",
                                                                                    "name": "n",
                                                                                    "value": "14"
                                                                                },
                                                                                {
                                                                                    "type": "update"
                                                                                },
                                                                                {
                                                                                    "type": "waitAsync"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        "3,8": [
            {
                "type": "setValue",
                "name": "flag:梦之泪",
                "value": "2",
                "norefresh": true
            }
        ],
        "9,8": [
            {
                "type": "setValue",
                "name": "flag:求道者",
                "value": "1",
                "norefresh": true
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": ":before",
            "stair": "upFloor",
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [1274,1273,90007,1275,  0,90007, 85,90007,  0, 22,90007,1274,1273],
    [1273,1274,90007,  0,1274,90007, 85,90007, 23,  0,90007,1273,1274],
    [ 83,90007,90007,90007,90007,90007, 85,90007,90007,90007,90007,90007, 83],
    [668,402,90007,  0,  0,  0,  0,  0,  0,  0,90007,668,1273],
    [ 81,90007,90007,  0,  0,  0,  0,  0,  0,  0,90007,90007, 82],
    [667,401,90007,  0,  0, 17, 17, 17,  0,  0,90007,669,669],
    [ 81,401,90007,  0,  0, 17,1256, 17,  0,  0,90007,90007, 82],
    [667,90007,90007,  0,  0,  0,  0,  0,  0,  0,90007,669,668],
    [ 81,401,90007,  0,  0,  0,  0,  0,  0,  0,90007,90007, 82],
    [667,90007,90007,90007,90007,90007,670,90007,90007,90007,90007,669,667],
    [ 81,90007,90007,668, 21,356,  0,356, 21,668,90007,90007, 82],
    [401,401,90007, 21,340,  0, 23,  0,356, 21,90007,401,667],
    [401,401, 81,668,  0,388, 88,388,  0,668, 82,667,401]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}