main.floors.MT556=
{
    "floorId": "MT556",
    "title": "未知之地",
    "name": "未知之地",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "Sky4.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "T1158",
    "bgm": "universe4.mp3",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "setGlobalValue",
            "name": "redPotion",
            "value": 10000000
        },
        {
            "type": "setGlobalValue",
            "name": "bluePotion",
            "value": 20000000
        },
        {
            "type": "setGlobalValue",
            "name": "yellowPotion",
            "value": 50000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenPotion",
            "value": 100000000
        },
        {
            "type": "setGlobalValue",
            "name": "redGem",
            "value": 5000000
        },
        {
            "type": "setGlobalValue",
            "name": "blueGem",
            "value": 5000000
        },
        {
            "type": "setGlobalValue",
            "name": "greenGem",
            "value": 25000000
        }
    ],
    "parallelDo": "",
    "events": {
        "6,2": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT554\", ]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==1)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    {
                        "type": "hide",
                        "remove": true
                    },
                    {
                        "type": "insert",
                        "loc": [
                            6,
                            1
                        ]
                    }
                ]
            }
        ],
        "6,1": [
            "\t[邪神·谶,E1544]\b[this,6,1]我不是说了嘛，你是无法摆脱这个游戏的。",
            "\t[小粽,hero]\b[hero]抱歉，我是不会就此止步的。",
            "\t[小粽,hero]\b[hero]不管你运用的是什么手段...",
            "\t[小粽,hero]\b[hero]我一定会.....",
            "\t[小粽,hero]\b[hero]\r[red]粉碎你的阴谋！！",
            "\t[小粽,hero]\b[hero]\r[red]我们一定会取得胜利的！！",
            "\t[邪神·谶,E1544]\b[this,6,1]真是搞不清楚状况啊.....你为什么可以如此坚持呢？",
            "\t[邪神·谶,E1544]\b[this,6,1]就算是会白白牺牲自己......",
            "\t[邪神·谶,E1544]\b[this,6,1]你守护的究竟是什么呢？",
            "\t[邪神·谶,E1544]\b[this,6,1]明明连自己的性命都无法保护，还妄图想守护他人，呵，别开玩笑了。",
            "\t[小粽,hero]\b[hero]我要去拯救大家，去拯救这个世界。",
            "\t[小粽,hero]\b[hero]还有我......曾经答应她去看人类世界的风景。",
            "\t[小粽,hero]\b[hero]这是我与她早已定下好的誓言。",
            {
                "type": "playBgm",
                "name": "GG6.mp3",
                "keep": true
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "changeFloor",
                "floorId": "MT558",
                "loc": [
                    6,
                    10
                ],
                "direction": "down",
                "time": 500
            }
        ],
        "6,0": [
            {
                "type": "setCurtain",
                "time": 500
            },
            "\t[小粽,hero]\b[hero]这就是.....我与她所定下的誓言。",
            "\t[小粽,hero]\b[hero]我一定会实现这个誓言。绝不会.....",
            "\t[小粽,hero]\b[hero]\r[red]让你这种家伙来妨碍我！",
            "\t[邪神·谶,E1544]\b[this,6,1]\r[red]哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈！！！",
            "\t[邪神·谶,E1544]\b[this,6,1]\r[red]实在是太可笑了！！",
            "\t[邪神·谶,E1544]\b[this,6,1]\r[red]那个小丫头的意识是被我创造出来的。",
            "\t[邪神·谶,E1544]\b[this,6,1]\r[red]是我用双手亲自创造出来的！！",
            "\t[小粽,hero]\b[hero]别胡说八道！我是不会被你的谶语所骗的！！",
            "\t[小粽,hero]\b[hero]我知道你最擅长的就是思维误导，你所说的每一句我我是绝对不会相信的！！",
            "\t[邪神·谶,E1544]\b[this,6,1]\r[red]这并不是胡说八道，我现在也没对你使用思维误导，这只不过是现实罢了，只是你不愿接受。",
            "\t[邪神·谶,E1544]\b[this,6,1]你应该在世界线的终焉里也看到了.......",
            "\t[邪神·谶,E1544]\b[this,6,1]当初的\r[red]“仙琳”！",
            "\t[邪神·谶,E1544]\b[this,6,1]通过你的双眼，亲自看到那一幕了吧！",
            "\t[小粽,hero]\b[hero]..............",
            "\t[小粽,hero]\b[hero]当初的..........",
            "\t[小粽,hero]\b[hero]............仙琳？",
            "\t[小粽,hero]\b[hero]难道说.......当初在第九重的那一幕.......是！",
            {
                "type": "setValue",
                "name": "status:atk",
                "operator": "-=",
                "value": "700000000"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "operator": "-=",
                "value": "512000000"
            },
            {
                "type": "setValue",
                "name": "status:mdef",
                "operator": "-=",
                "value": "225000000"
            },
            {
                "type": "changeFloor",
                "floorId": "MT557",
                "loc": [
                    6,
                    12
                ],
                "direction": "up",
                "time": 0
            }
        ]
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [1138,1138,339,387,339,1138,1138,1138,339,387,339,1138,1138],
    [1138,1138,1138,1550,1138,1138,1544,1138,1138,1550,1138,1138,1138],
    [1275,1138,  0,355,1138,1138,670,1138,1138,355,  0,1138,1275],
    [1395,1550,339,1138,1138,1138,1550,1138,1138,1138,339,1550,1276],
    [1275,1138,  0,1138,1138,1550,1275,1550,1138,1138,  0,1138,1275],
    [1138,1138,355,1138,339,1138, 81,1138,339,1138,355,1138,1138],
    [1275,1138,  0,  0,  0,1550,  0,1550,  0,  0,  0,1138,1275],
    [385,1138,1138,1138,1138,1138, 21,1138,1138,1138,1138,1138,385],
    [353,1275,1138,388,  0,1550,1395,1550,  0,388,1138,1275,353],
    [337,1138,1138,1546,1138,1138,1395,1138,1138,1546,1138,1138,337],
    [1549,  0,337,1274,369,1138,1276,1138,369,1274,337,  0,1549],
    [1138,1138,1549,1138,1138,1138,  0,1138,1138,1138,1549,1138,1138],
    [354,338,1275,338,354,1138,  0,1138,354,338,1275,338,354]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0, 17, 17, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}