main.floors.MT565=
{
    "floorId": "MT565",
    "title": "未知空间（真实结局）",
    "name": "未知空间（真实结局）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [
        {
            "name": "universe1.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 500000000,
    "defaultGround": "T1158",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "Recoil1.mp3",
            "keep": true
        },
        "\t[弃坑立粽,N724]\b[this,6,2]全部都记录下来了吧。",
        "\t[记录者,N680]\b[this,7,1]是，所有人都过上了他们最想要的结局。",
        "\t[弃坑立粽,N724]\b[this,6,2].............是吗，那就好。",
        "\t[记录者,N680]\b[this,7,1]不过.....你担任了这么久的守望者.....到底是为了什么呢？",
        "\t[记录者,N680]\b[this,7,1]自己最珍视的人都早已不在，只留下你来守望这个故事。",
        "\t[弃坑立粽,N724]\b[this,6,2]........................",
        "\t[记录者,N680]\b[this,7,1]...........................说起来，我有一个问题想问你",
        "\t[弃坑立粽,N724]\b[this,6,2]说",
        "\t[记录者,N680]\b[this,7,1]告诉我……你究竟想要做什么？创造这个故事的目的究竟是什么？",
        "\t[弃坑立粽,N724]\b[this,6,2]……一次机缘巧合吧。",
        "\t[弃坑立粽,N724]\b[this,6,2]我虽然是守望者，但其实我也不过是普通人罢了。是那位前辈拯救了我给予了我这个能力。",
        "\t[弃坑立粽,N724]\b[this,6,2]这个世界所有事物和人物……包含着我的心血，我的情感，虽然他们是被书写的存在，但是他们背后所给人们带来的却是比这弥足珍贵的事物。",
        "\t[弃坑立粽,N724]\b[this,6,2]在每个人身上我们都看到他们所带来的信念与情感......",
        "\t[弃坑立粽,N724]\b[this,6,2]而这个过程中 我一直思考这一切……",
        "\t[记录者,N680]\b[this,7,1]…………",
        "\t[记录者,N680]\b[this,7,1]所以……你……",
        {
            "type": "setBlock",
            "number": "N1579",
            "loc": [
                [
                    6,
                    2
                ]
            ],
            "time": 0
        },
        "\t[记录者,N680]\b[this,7,1]！！等等 你的身体",
        "\t[弃坑立粽,N1579]\b[this,6,2]……呵，看来是时候离开这里流入轮回了。",
        "\t[记录者,N680]\b[this,7,1]......你最后能告诉我你要去哪里吗？",
        "\t[弃坑立粽,N1579]\b[this,6,2]我要去找她了，在那条世界线我亏欠她太多了。",
        "\t[记录者,N680]\b[this,7,1]云梦溪吗........。",
        "\t[弃坑立粽,N1579]\b[this,6,2]对，我希望我下一世能够与她平平淡淡的度过一生，而不是像现在这样背负太多太多的责任了。",
        "\t[弃坑立粽,N1579]\b[this,6,2]谢谢你，愿意能花时间倾听这个故事的人啊……",
        "\t[弃坑立粽,N1579]\b[this,6,2]这个世界……我不再守望……不再联系…………愿你们……能够……拥有属于……自己的……未来。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    2
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[记录者,N680]\b[this,7,1]………",
        "\t[记录者,N680]\b[this,7,1]………....",
        "\t[记录者,N680]\b[this,7,1]………………",
        "\t[记录者,N680]\b[this,7,1]………………守望者……",
        "\t[记录者,N680]\b[this,7,1]你的故事，我会流传记录下去的！",
        "\t[记录者,N680]\b[this,7,1]这不仅是属于名为小粽的主角的传记，更是属于你的传记！",
        "\t[记录者,N680]\b[this,7,1]是呀，就叫它——\\d弃坑立粽传吧！",
        "\\d游戏结束，感谢游玩。",
        {
            "type": "if",
            "condition": "(item:greenKey > 0)",
            "true": [
                {
                    "type": "win",
                    "reason": "最终章 永不言败（全绿难度）"
                }
            ],
            "false": [
                {
                    "type": "win",
                    "reason": "最终章 永不言败（0绿难度）"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,680,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,724,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}