main.floors.MT572=
{
    "floorId": "MT572",
    "title": "后院（坏结局）",
    "name": "后院（坏结局）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": true,
    "images": [],
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "playSound",
            "name": "jump.mp3"
        },
        {
            "type": "animate",
            "name": "unexpected2",
            "loc": [
                6,
                4
            ]
        },
        "\t[仙琳,N1397]\b[this,6,4]………………这是……一个墓碑？",
        "\t[仙琳,N1397]\b[this,6,4]墓碑周围如此整洁，看来是有人定期在这里打扫……",
        {
            "type": "move",
            "loc": [
                6,
                4
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up"
            ]
        },
        "\t[仙琳,N1397]\b[this,6,2]我看看这墓碑写的是…………",
        "\t[？？]啊？啊！",
        {
            "type": "setBlock",
            "number": "N1589",
            "loc": [
                [
                    6,
                    12
                ]
            ],
            "time": 500
        },
        {
            "type": "move",
            "loc": [
                6,
                12
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up",
                "up",
                "up",
                "up",
                "up",
                "up"
            ]
        },
        {
            "type": "setBlock",
            "number": "N1591",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "time": 0
        },
        "\t[仙琳,N1397]\b[this,6,2]你是谁？！",
        "\t[？？,N1591]\b[this,6,6]孩子，你已经醒了呀？",
        "\t[仙琳,N1397]\b[this,6,2]…………老爷爷，是你救了我吗？",
        "\t[？？,N1591]\b[this,6,6]……算是吧，",
        "\t[仙琳,N1397]\b[this,6,2]那……我昏迷了多久？",
        "\t[？？,N1591]\b[this,6,6]一百...一百天，孩子，你怎么了，你为什么会昏倒在那种地方？那个地方可全是万丈深渊呀。",
        "\t[？？,N1591]\b[this,6,6]要不是老头子我正好去采药，不然你就危险了。",
        "\t[仙琳,N1397]\b[this,6,2]…………只有百天吗，看来是我预估错了时间。",
        "\t[仙琳,N1397]\b[this,6,2]谢谢你，老爷爷，不过当初你救我的时候有没有看见另一个昏迷的人呀。",
        "\t[？？,N1591]\b[this,6,6]嗯…………有印象，有印象，在我在远处看到你昏迷的时候，那个孩子已经醒了，不过他好像直接扭头就走了，根本就没在乎你的死活，真不是个好东西！",
        "\t[仙琳,N1397]\b[this,6,2]啊？！！老爷爷你看到他去哪里了吗？！我要去找他！",
        "\t[？？,N1591]\b[this,6,6]他应该往王都那个地方走了，出门右转就到了。",
        "\t[仙琳,N1397]\b[this,6,2]啊！这样吗！谢谢你，老爷爷。",
        "\t[仙琳,N1397]\b[this,6,2]…………嗯，去吧，孩子。",
        {
            "type": "move",
            "loc": [
                6,
                2
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down",
                "down",
                "down"
            ]
        },
        "然而在仙琳离开的时候，无意看到了老爷爷右边腰带上系的红色飘带……",
        "\t[仙琳,N1397]\b[this,6,5]………………老爷爷，你这衣服上面系的什么？我怎么感觉在哪里见过…………",
        "\t[？？,N1591]\b[this,6,6]…………！！你在说些什么呢，孩子。",
        "仙琳靠近老爷爷，仔细一看……",
        "\t[仙琳,N1397]\b[this,6,5]这是我与他的定情信物，为什么会在老爷爷你手中？！",
        "\t[？？,N1591]\b[this,6,6]…………！这，这其实……",
        {
            "type": "move",
            "loc": [
                6,
                5
            ],
            "time": 100,
            "keep": true,
            "steps": [
                "up",
                "up",
                "up"
            ]
        },
        "仙琳似乎想起什么，返回头看向墓碑",
        "\t[仙琳,N1397]\b[this,6,2]母亲之墓…………下面还有个小字…………",
        "\t[仙琳,N1397]\b[this,6,2]小粽？！！",
        "\t[小粽,N1591]\b[this,6,6]！！！！！！",
        {
            "type": "move",
            "loc": [
                6,
                2
            ],
            "time": 50,
            "keep": true,
            "steps": [
                "down",
                "down",
                "down"
            ]
        },
        "\t[仙琳,N1397]\b[this,6,5]……………………",
        "\t[小粽,N1591]\b[this,6,6]……………………",
        "\t[仙琳,N1397]\b[this,6,5]……………………为什么你要骗我……",
        "\t[小粽,N1591]\b[this,6,6]……………………我不认…………",
        "\t[仙琳,N1397]\b[this,6,5]够了！！",
        "\t[小粽,N1591]\b[this,6,6]………………",
        "\t[仙琳,N1397]\b[this,6,5]小粽，………………即使你变成这副模样，你也你不应该不与我相认。",
        "\t[小粽,N1591]\b[this,6,6]………………孩子，人生若只如初见，何事秋风悲画扇。我们早已是两个世界的人了，你应该出去去找另一个叫小粽的人。",
        "\t[仙琳,N1397]\b[this,6,5]……小粽，我之前说过，就算你变成什么模样，我这一生也只会爱你一个人！",
        "\t[小粽,N1591]\b[this,6,6]……………………",
        "\t[小粽,N1591]\b[this,6,6]…………………………呜呜呜……仙琳……。",
        "\t[小粽,N1591]\b[this,6,6]………………谢谢你，能让我见到她最后一面…………。",
        "小粽在说完之后停止了呼吸.....。",
        {
            "type": "hide",
            "remove": true
        },
        "\t[仙琳,N1397]\b[this,6,5]……小粽，我之前说过，就算你变成什么模样，我这一生也只会爱你一个人！",
        "\t[仙琳,N1397]\b[this,6,5]！！！小粽！！",
        "\t[仙琳,N1397]\b[this,6,5]生命严重衰竭！必须马上补充生命力！",
        "\t[仙琳,N1397]\b[this,6,5]生命·礼赞！",
        {
            "type": "playSound",
            "name": "116-Raise02.ogg"
        },
        {
            "type": "animate",
            "name": "aid3",
            "loc": [
                6,
                5
            ]
        },
        "…………",
        "\t[仙琳,N1397]\b[this,6,5]！！不可能！为什么会完全没有效果？！！",
        "\t[仙琳,N1397]\b[this,6,5]明明爸爸当初都能做到的事，为什么我却做不到？！！",
        "\t[仙琳,N1397]\b[this,6,5]怎么会这样！怎么会这样！！",
        {
            "type": "playBgm",
            "name": "disorder13.mp3",
            "keep": true
        },
        "\t[？？？]人间的小神，你尽力了！",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": [
                6,
                5
            ]
        },
        "\t[仙琳,N1397]\b[this,6,5]！！！！！这个声音是！不可能！！",
        {
            "type": "playSound",
            "name": "139-Darkness02.ogg"
        },
        {
            "type": "animate",
            "name": "attack18",
            "loc": [
                6,
                7
            ]
        },
        {
            "type": "setBlock",
            "number": "N1590",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 0
        },
        "\t[邪神·谶,N1590]\b[this,6,7]哟，好久不见呀，不知道你们过得如何啊！",
        "\t[仙琳,N1397]\b[this,6,5]邪神·谶？！",
        "\t[仙琳,N1397]\b[this,6,5]你！不是已经死了吗？！为什么还会出现在这里？！！",
        "\t[邪神·谶,N1590]\b[this,6,7]我不是说过吗？只要这个世界仍存罪恶，我便能延续在你们的内心之中再度降临！",
        "\t[邪神·谶,N1590]\b[this,6,7]而这个叫小粽的小家伙，正好因为对自己的自责，我才得以借此重生！",
        "\t[仙琳,N1397]\b[this,6,5]不……不会是这样的！",
        "\t[邪神·谶,N1590]\b[this,6,7]你们的故事的确很动人，但在本座面前却如同泡沫般虚妄！",
        "\t[仙琳,N1397]\b[this,6,5]你！必须死！！",
        "\t[邪神·谶,N1590]\b[this,6,7]蝼蚁的力量罢了！",
        {
            "type": "playSound",
            "name": "138-Darkness01.ogg"
        },
        {
            "type": "animate",
            "name": "attack18",
            "loc": [
                6,
                5
            ]
        },
        "\t[仙琳,N1397]\b[this,6,5]\r[red]噗！！",
        "\t[邪神·谶,N1590]\b[this,6,7]\r[red]你与他一同成为亡命鸳鸯吧！",
        "\t[仙琳,N1397]\b[this,6,5]\r[red]小粽…………这就是我们的终焉吗…………",
        {
            "type": "playSound",
            "name": "049-Explosion02.ogg"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        "\t[邪神·谶]结束了",
        "\t[邪神·谶]不知道这样的结局觉得如何呢？",
        "\t[邪神·谶]\r[red]观测者！",
        {
            "type": "if",
            "condition": "(item:greenKey > 0)",
            "true": [
                {
                    "type": "win",
                    "reason": "Bad End  一生守候（全绿难度）"
                }
            ],
            "false": [
                {
                    "type": "win",
                    "reason": "Bad End  一生守候（0绿难度）"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [151,151,151,151,151,152,152,152,151,151,151,151,151],
    [151,151,151,151,152,152,30088,152,152,151,151,151,151],
    [151,151,151,152,152,  0,  0,  0,152,152,151,151,151],
    [151,151,152,152,20002,  0,  0,  0,20002,152,152,151,151],
    [151,20000,20000,152,  0,  0,  0,  0,  0,152,20000,30000,151],
    [20000,20121,20122,20123,30015,  0,  0,  0,30015,20121,20122,20123,20000],
    [151,30011,  0,  0,  0,  0,  0,  0,  0,  0,  0,30011,151],
    [151,151,30012,20011,20000,  0,  0,  0,20000,20011,30012,151,151],
    [151,151,151,  0,  0,  0,  0,  0,  0,  0,151,151,151],
    [151,151,151,151,20084,  0,  0,  0,20087,151,151,151,151],
    [151,151,151,151,151,  0,  0,  0,151,151,151,151,151],
    [151,151,151,151,151,  0,  0,  0,151,151,151,151,151],
    [151,151,151,151,151,  0,1397,  0,151,151,151,151,151]
],
    "bgmap": [
    [151,151,151,151,151,30000,30000,30000,151,151,151,151,151],
    [151,151,151,151,30000,20000,30000,20000,30000,151,151,151,151],
    [151,151,151,30000,20000,153,153,153,20000,30000,151,151,151],
    [151,151,30000,20000,20000,153,153,153,20000,20000,30000,151,151],
    [151,30000,30000,30000,20000,153,153,153,20000,30000,30000,30000,151],
    [30000,30000,30000,30000,30000,153,153,153,30000,30000,30000,30000,30000],
    [151,30000,153,153,153,153,153,153,153,153,153,30000,151],
    [151,151,30000,30000,153,153,153,153,153,30000,30000,151,151],
    [151,151,151,153,153,153,153,153,153,153,151,151,151],
    [151,151,151,151,30000,153,153,153,30000,151,151,151,151],
    [151,151,151,151,151,153,153,153,151,151,151,151,151],
    [151,151,151,151,151,153,153,153,151,151,151,151,151],
    [151,151,151,151,151,153,153,153,151,151,151,151,151]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,30080,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20135,20105,20106,20107,  0,  0,  0,  0,  0,20105,20106,20107,20135],
    [20143,20113,20114,20115,30007,  0,  0,  0,30007,20113,20114,20115,20143],
    [20151,20121,20122,20123,30015,  0,  0,  0,30015,20121,20122,20123,20151],
    [  0,  0,  0,30006,  0,  0,  0,  0,  0,30006,  0,  0,  0],
    [  0,  0,  0,30014,20068,20069,  0,20070,20071,30014,  0,  0,  0],
    [  0,  0,  0,  0,20076,20077,  0,20078,20079,  0,  0,  0,  0],
    [  0,  0,  0,  0,20084,20085,  0,20086,20087,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0],
    [  0,  0,153,153,153,153,153,153,153,153,153,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0],
    [  0,  0,  0,153,153,153,153,153,153,153,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,153,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,153,153,153,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}