main.floors.MT68=
{
    "floorId": "MT68",
    "title": "未知地带",
    "name": "未知地带",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": true,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 1,
    "defaultGround": "white",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "emmslow",
            "loc": [
                6,
                12
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???]大人前来可是为何事？",
        "\t[???,N832]\b[this,6,12]呵，好久不见，君阁主。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N832]\b[this,6,12]看来这一次闭关，君阁主的实力又进了一步。",
        "\t[???]大人说笑了，我这萤烛之火岂得敢与大人您相比呢？",
        "\t[???]比起这个，大人您这次前来不只是为了看我闭关的程度如何吧！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???,N832]\b[this,6,12]你说的没错！这一次本座前来不仅是看你闭关程度如何。",
        "\t[???,N832]更重要的是！我现在打算开始实施\r[red]【】计划！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???]哦？大人您已经找到合适的人选了？！",
        "\t[???,N832]\b[this,6,12]没错,根据我的情报显示，这些天有一位人类的勇者进入了这座高塔。",
        "\t[???,N832]\b[this,6,12]在短短数天，这个人类先后斩杀：安兹乌洛斯 若影卡萨 道傀使等头目级别的高手。",
        "\t[???,N832]\b[this,6,12]如果我没猜错的话，现在这个人类应该快突破到剑之巅的领域了。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???]..........这种天资，在我们魔物建造这座高塔开始算起，也就只有当初的初代勇者能凌驾于其上吧.....",
        "\t[???,N832]\b[this,6,12]呵，的确，这种勇者才是实施【】计划的最佳人选！",
        "\t[???,N832]\b[this,6,12]不过这个勇者目前的实力还太过弱小，短时间内【】计划是不可能实施的了的，所以......",
        {
            "type": "sleep",
            "time": 1000
        },
        "...............................",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[???]好一步暗度陈仓！我明白了！！",
        "\t[???,N832]\b[this,6,12]嗯，具体操作情况等君阁主你出关以后自会告知。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500
        },
        {
            "type": "changeFloor",
            "floorId": "MT67",
            "loc": [
                6,
                6
            ],
            "direction": "up",
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,120176,120177,120178,120179,120180,120181,120182,  0,  0,  0],
    [  0,  0,  0,120184,120185,120186,120187,120188,120189,120190,  0,  0,  0],
    [  0,  0,  0,120192,120193,120194,120195,120196,120197,120198,  0,  0,  0],
    [  0,  0,  0,120200,120201,120202,120203,120204,120205,120206,  0,  0,  0],
    [  0,  0,  0,120208,120209,120210,120211,120212,120213,120214,  0,  0,  0],
    [  0,  0,  0,120216,120217,120218,120219,120220,120221,120222,  0,  0,  0],
    [  0,  0,  0,120224,120225,120226,120227,120228,120229,120230,  0,  0,  0],
    [  0,  0,  0,120232,120233,120234,120235,120236,120237,120238,  0,  0,  0],
    [  0,  0,  0,120240,120241,120242,120243,120244,120245,120246,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,832,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,148,148,148,148,148,148,148,148,148,  0,  0],
    [  0,  0,148,148,148,148,148,148,148,148,148,  0,  0],
    [  0,  0,148,148,148,148,148,148,148,148,148,  0,  0],
    [  0,  0,148,148,148,148,148,148,148,148,148,  0,  0],
    [  0,  0,148,148,148,148,148,148,148,148,148,  0,  0],
    [  0,  0,148,148,148,148,148,148,148,148,148,  0,  0],
    [  0,  0,148,148,148,148,148,148,148,148,148,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,148,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,148,148,148,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bgm": "holy1.mp3",
    "bg2map": [

],
    "fg2map": [

]
}