main.floors.MT69=
{
    "floorId": "MT69",
    "title": "登天之巅外围",
    "name": "登天之巅外围",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[仙琳,fairy]\b[this,6,6]堇姐姐的投影气息居然消散了.....。",
                "\t[仙琳,fairy]\b[this,6,6]嗯.....没想到小粽他的实力居然提升这么快呀....。",
                "\t[仙琳,fairy]\b[this,6,6]那我.....。",
                {
                    "type": "playSound",
                    "name": "cgefc01.wav"
                },
                {
                    "type": "animate",
                    "name": "unexpected1",
                    "loc": [
                        6,
                        6
                    ]
                },
                {
                    "type": "jump",
                    "from": [
                        6,
                        6
                    ],
                    "to": [
                        6,
                        5
                    ],
                    "time": 500,
                    "keep": true
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[仙琳,fairy]\b[this,6,5]哎呀！你突然过来站这么近是要吓死人家呀！",
                "\t[小粽,hero]\b[hero]额,我只是看你刚才在这里不知道在念叨什么,比较好奇而已。",
                "\t[仙琳,fairy]\b[this,6,5]也没什么呀~就是感叹一下你实力提升的也太快了。",
                "\t[小粽,hero]\b[hero].....还好吧，我感觉这个区域的魔物都挺强的，我这实力应该也算不了什么吧。",
                "\t[仙琳,fairy]\b[this,6,5]算了，只要你不被这些魔物打死就行，至于实力提升的速度人家就暂时不要在意了。",
                "\t[仙琳,fairy]\b[this,6,5]接下来我们即将到达堇姐姐管理的最后一个区域：登天之巅。",
                "\t[仙琳,fairy]\b[this,6,5]首先呢，这个区域非常的大，其充其量差不多是前面登天潭径，登天之路的总和吧！",
                {
                    "type": "playSound",
                    "name": "cgefc01.wav"
                },
                {
                    "type": "animate",
                    "name": "unexpected1",
                    "loc": "hero"
                },
                "\t[小粽,hero]\b[hero]这.....这么夸张？？？！",
                "\t[小粽,hero]\b[hero]单是登天潭径这个领域就差点让我迷路了，结果这个登天之巅居然是前面加起来的总和？？！",
                "\t[仙琳,fairy]\b[this,6,5]这个大区域有四位剑神高手分别辅助堇姐姐来驻守登天之巅，所以这个区域会很大。",
                "\t[小粽,hero]\b[hero]....行吧，我自从与你那位所说的堇姐姐对战之后,我对剑的感悟又进了一步。",
                "\t[小粽,hero]\b[hero]感觉只要突破了这里，我的实力就将会有巨大的飞跃！",
                "\t[仙琳,fairy]\b[this,6,5]嗯嗯，那人家先告诉你有关登天之巅的一些情况。",
                "\t[仙琳,fairy]\b[this,6,5]这个区域所有宝石与血瓶提升的能力为100倍，而且剑盾的攻防为15000点！",
                "\t[仙琳,fairy]\b[this,6,5]不过相信你已经察觉到了,现在商店给你的属性已经比较鸡助了。",
                "\t[仙琳,fairy]\b[this,6,5]等你商店内的购买价格到1200时到前面找人家，人家可以帮你升级一下商店。",
                "\t[小粽,hero]\b[hero]好！明白了。",
                "\t[仙琳,fairy]\b[this,6,5]嗯嗯，那我就在前面等你~",
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            5
                        ]
                    ],
                    "time": 500
                },
                {
                    "type": "insert",
                    "loc": [
                        12,
                        12
                    ]
                }
            ]
        },
        "12,12": [
            "\t[小粽,hero]\b[hero].........",
            "\t[小粽,hero]\b[hero]不过她刚才在嘀咕些什么呢？"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT67",
            "loc": [
                6,
                0
            ],
            "time": 0
        },
        "6,0": {
            "floorId": "MT70",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [148,148,148,148,148,148, 91,148,148,148,148,148,148],
    [148,148,393,393,393, 24,  0, 24, 21, 22, 23,148,148],
    [148,148,148,148,148,148,  0,148,148,148,148,148,148],
    [148,148,148,148,148,148,  0,148,148,148,148,148,148],
    [148,148, 21, 47, 21, 24,  0, 24,399,400,399,148,148],
    [148,148,148,148,148,148,  0,148,148,148,148,148,148],
    [148,148,148,148,148,148,124,148,148,148,148,148,148],
    [148,148, 21, 21, 21, 82, 34, 81, 81, 81, 22,148,148],
    [148,148,148,148,148,148, 33,148,148,148,148,148,148],
    [148,148,148,148,148,148, 33,148,148,148,148,148,148],
    [148,148,148,148,148,148, 33,148,148,148,148,148,148],
    [148,148,148,148,148,148, 33,148,148,148,148,148,148],
    [148,148,148,148,148,148, 93,148,148,148,148,148,148]
],
    "bgmap": [

],
    "fgmap": [
    [  0, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [  0, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0],
    [  0, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "battle4.mp3",
    "bg2map": [

],
    "fg2map": [

]
}