main.floors.MT70=
{
    "floorId": "MT70",
    "title": "登天之巅（下一）",
    "name": "登天之巅（下一）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,11": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[仙琳,fairy]\b[this,7,11]我可以提升你的商店等级，让商店里相同金钱出售的能力*2.5，购买价格到1200时来找我吧。",
                {
                    "type": "choices",
                    "text": "\t[仙琳,fairy]是否加倍？",
                    "choices": [
                        {
                            "text": "加倍！",
                            "action": [
                                {
                                    "type": "if",
                                    "condition": "(flag:shop_times>=118)",
                                    "true": [
                                        {
                                            "type": "disableShop",
                                            "id": "51FShop"
                                        },
                                        "\t[仙琳,fairy]\b[this,7,11]搞定，顺便为了方便你购买，基础价格和购买效果也翻了一倍。",
                                        {
                                            "type": "hide",
                                            "loc": [
                                                [
                                                    7,
                                                    7
                                                ]
                                            ],
                                            "floorId": "MT51",
                                            "time": 0
                                        },
                                        {
                                            "type": "hide",
                                            "time": 500
                                        },
                                        {
                                            "type": "openShop",
                                            "id": "71Fshop"
                                        }
                                    ],
                                    "false": [
                                        "\t[仙琳,fairy]\b[this,7,11]不够不够。",
                                        {
                                            "type": "exit"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "text": "暂时不用",
                            "action": [
                                "\t[仙琳,fairy]\b[this,7,11]那好吧。"
                            ]
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT69",
            "loc": [
                6,
                0
            ],
            "time": 0
        },
        "6,0": {
            "floorId": "MT71",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [140006, 28,614, 27,140006,351, 91,335, 82, 32, 21, 82, 28],
    [140006,140006, 81,140006,140006,630,  0,630,140006, 81,140006,140006, 21],
    [140006,140006, 21,140006, 33,140006, 81,140006,  0,  0, 29,140006, 81],
    [  0,350,637,350, 81,  0,  0,334,  0,629,  0,140006,335],
    [366,140006,334,140006,623,350,140006,140006,626,  0,  0,623, 33],
    [492,140006,140006,  0,  0, 81,140006, 34,384,140006,  0,140006,140006],
    [  0, 28,610,335,  0,140006,140006,140006,140006,140006,636,399,140006],
    [140006,140006,140006, 34, 82,610,  0,140006, 27,140006,  0,140006, 27],
    [ 29, 28,140006,351,140006,  0, 34,  0,620,  0,  0,629, 32],
    [ 27,614, 81, 33,140006,140006, 81,140006,140006,140006,615,140006, 28],
    [140006, 81,140006,140006,366,  0,606,  0,366,140006, 29,  0,140006],
    [350,618,334, 82,  0,366, 32,366,124,140006,140006, 81,140006],
    [ 32,366, 34,140006,140006,  0, 93,430,140006,140006, 27,610, 28]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}