main.floors.MT74=
{
    "floorId": "MT74",
    "title": "登天之巅（下五）",
    "name": "登天之巅（下五）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]现在应该到仙琳所说的天淼剑神所管辖的区域了吧。",
        "\t[天淼剑神,E639]\b[this,6,1]你就是大人所说的那位勇者？",
        {
            "type": "playSound",
            "name": "cgefc01.wav"
        },
        {
            "type": "animate",
            "name": "unexpected1",
            "loc": "hero"
        },
        "\t[小粽,hero]\b[hero]（好强大的气场！他就是天淼剑神吗？！）",
        "\t[天淼剑神,E639]\b[this,6,1]呵！就这点实力，大人还叫我们要密切小心。",
        "\t[天淼剑神,E639]\b[this,6,1]我看就你这种货色，本剑神一剑即可封喉！",
        "\t[天淼剑神,E639]\b[this,6,1]哼！如果你是一个真正的勇者，就活着走到我的面前吧。",
        "\t[天淼剑神,E639]\b[this,6,1]是像个懦夫一样等死，还是拼搏出最后的勇气在战斗中牺牲，做出选择吧！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]（这家伙说的没错,我现在的实力在他面前完全不够看,我得另想办法先绕过他。）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[天淼剑神,E639]\b[this,6,1]很好！你成功的走到了我的面前",
                "\t[天淼剑神,E639]\b[this,6,1]那么.....你该去世了！",
                {
                    "type": "battle",
                    "id": "E639"
                },
                "\t[天淼剑神,E639]\b[this,6,1]不....不！！我可是天淼剑神！！堂堂弱小的人类怎么可能击败我？！",
                "\t[小粽,hero]\b[hero]看来,你并不能一剑将我封喉呢",
                "\t[天淼剑神,E639]\b[this,6,1]愚蠢的人类，你会死的，你一定会死的！只要他们出手......",
                "\t[小粽,hero]\b[hero]好了,该去世了!",
                "\t[天淼剑神,E639]\b[this,6,1]不！！！！",
                {
                    "type": "hide",
                    "time": 500
                }
            ]
        }
    },
    "changeFloor": {
        "11,12": {
            "floorId": "MT73",
            "loc": [
                11,
                0
            ],
            "time": 0
        },
        "0,0": {
            "floorId": "MT74",
            "loc": [
                12,
                11
            ],
            "time": 0
        },
        "6,0": {
            "floorId": "MT75",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 89,140005, 32,140006,352, 33, 91, 33,352,140006, 32,140006, 32],
    [  0,140005, 33,140006, 33,336,639,336, 33,140006, 33,140006, 33],
    [ 47,140005, 81,140006,140006,140006, 82,140006,140006,140006, 81,140006, 81],
    [140005,140005,350,140006, 28,  0,623,  0,  0,140006, 21,626, 21],
    [140006,140006, 21,140006,  0, 27,140006,  0,367,629,140006, 22,140006],
    [140006, 27,  0,637, 27,629,140006,629,  0,383,  0, 81,335],
    [140006, 81,140006,140006,140006,140006,140006,140006,140006, 82,  0,  0, 33],
    [140006,367,140006, 21,350, 21,140006, 34,140006,  0,616,629,140006],
    [140006, 33,140006,334,626,366,140006, 28,140006,  0, 81, 34,140006],
    [140006,351,140006,140006, 81,140006, 21,492, 32, 29,  0,140006,140006],
    [140006,335, 81,  0, 21, 81,  0,140006,140006,  0, 27, 32, 83],
    [140006,412,636, 34,351,618, 28,140006, 21,629,  0,140006, 50],
    [140006,140006,140006,140006,140006,140006,140006,140006,140006, 28,610, 93,140006]
],
    "bgmap": [
    [  0,  0,  0,  0,143,143,143,143,143,  0,  0,  0,  0],
    [  0,  0,  0,  0,143,143,143,143,143,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}