main.floors.MT76=
{
    "floorId": "MT76",
    "title": "登天之巅（下七）",
    "name": "登天之巅（下七）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]呼~这些魔物越来越棘手了。",
        "\t[小粽,hero]不过我感觉我马上就能感悟出新的剑技了，再沉淀一下！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "随着小粽对其剑法的不断锤炼与这个领域魔物的奋战,小粽感悟出一丝属于未来在剑这一领域的道路。",
                "早在登天之路的时候,小粽就已经开始浮现有关于“剑技”的影子,只不过那个时候还缺少与真正同修“剑技”的高手之间的战斗感悟。",
                "而在与剑道星尊·堇战斗的时候,这种感悟就如同雨后春笋一般涌现与小粽的脑海里。",
                "或许,这就是我未来该走的路吧,小粽说。",
                "获得一丝感悟,全属性提升5000点！",
                {
                    "type": "addValue",
                    "name": "status:atk",
                    "value": "5000"
                },
                {
                    "type": "addValue",
                    "name": "status:def",
                    "value": "5000"
                },
                {
                    "type": "addValue",
                    "name": "status:mdef",
                    "value": "5000"
                },
                {
                    "type": "hide",
                    "time": 0
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT75",
            "loc": [
                6,
                0
            ],
            "time": 0
        },
        "2,0": {
            "floorId": "MT77",
            "loc": [
                2,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 34,140006, 91,140006, 22,140006,140006,140006, 27,140006,638,383, 34],
    [ 33,140006,  0,140006, 81, 34,  0,  0,611, 28,  0,140006,140006],
    [ 81,140006, 33,140006,140006,  0,646,140006,140006,  0, 29,140006,352],
    [382,623,  0,646,140006,  0,140006,140006,383,646,  0, 81,636],
    [140006,140006,351,  0,  0,618, 30,140006,140006,  0, 29,140006,335],
    [140006,367,  0,  0,335,140006,140006,  0,  0, 33,140006,140006,140006],
    [ 32, 81,140006,632,  0,632,  0,641, 21,  0,612,399,324],
    [140006,  0,351,  0,  0,  0,140006,385,140006,140006,140006,140006, 83],
    [ 30,637,  0,140006,  0,492,  0,140006,140006,140006, 32,140006, 21],
    [140006, 81,140006,412,616,140006, 81, 29,  0,626, 30,630,382],
    [351,647,335,140006,  0, 29,  0,  0,140006,140006,140006,140006, 82],
    [140006, 33,140006, 21, 82,140006,492,  0, 81,492, 82, 33,352],
    [140006,430,140006, 21, 21,140006, 93,140006,140006, 30,611,336,140006]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}