main.floors.MT79=
{
    "floorId": "MT79",
    "title": "登天之巅（下十）",
    "name": "登天之巅（下十）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,7": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[仙琳,fairy]\b[this,6,7]小粽,前面有三位剑神高手,以你现在的实力肯定是应付不了的。",
                "\t[仙琳,fairy]\b[this,6,7]我用我们仙子一族的魔法将他们所处的空间暂时封闭起来了，一时半会他们是出不来的。",
                "\t[小粽,hero]\b[hero]那他们不会察觉到吗？",
                "\t[仙琳,fairy]\b[this,6,7]你在这里听听他们在干什么就知道了呀~",
                "\t[蓝焱剑神,E662]\b[this,7,4]对三！",
                "\t[红焱剑神,E640]\b[this,5,4]对十！",
                "\t[光焱剑神,E661]\b[this,6,3]对二！",
                "\t[红焱剑神,E640]\b[this,5,4]老大！你也太狠了吧！！直接对二出手。",
                "\t[光焱剑神,E661]\b[this,6,3]嘿嘿，要不起吧！飞机！！",
                {
                    "type": "playSound",
                    "name": "Raise1.ogg"
                },
                {
                    "type": "animate",
                    "name": "wuyu",
                    "loc": "hero"
                },
                "\t[小粽,hero]\b[hero]........这.....他们居然在.....。",
                "\t[仙琳,fairy]\b[this,6,7]现在你明白了吧，他们是肯定发现不了的。",
                "\t[小粽,hero]\b[hero]信！信了！！",
                "\t[仙琳,fairy]\b[this,6,7]嗯嗯，你现在先去左右两条路提高一下实力吧。",
                "\t[仙琳,fairy]\b[this,6,7]对了漏怪检测不检测这一层的金币，所以0绿大佬可以放心游玩。",
                "\t[小粽,hero]\b[hero]？？？？？？？？什么情况",
                "\t[小粽,hero]\b[hero]你在说什么呢？",
                {
                    "type": "hide",
                    "time": 500
                }
            ]
        },
        "6,6": [
            "这里是漏怪检测装置。正在检测是否有剩余怪物。",
            {
                "type": "function",
                "function": "function(){\ncore.checkMonster([\"MT49\", \"MT50\", \"MT51\", \"MT52\", \"MT53\", \"MT54\", \"MT55\", \"MT56\", \"MT57\", \"MT58\", \"MT59\", \"MT60\", \"MT61\", \"MT62\", \"MT63\", \"MT64\", \"MT65\", \"MT67\", \"MT70\", \"MT71\", \"MT72\", \"MT73\", \"MT74\", \"MT75\", \"MT76\", \"MT77\", \"MT78\", \"MT80\", \"MT81\", \"MT82\", \"MT83\", \"MT84\", \"MT85\", \"MT86\", \"MT87\", \"MT88\", \"MT89\", \"MT90\", \"MT91\", \"MT92\", \"MT93\", \"MT94\", \"MT95\", \"MT96\", \"MT97\", \"MT98\", \"MT99\", \"MT100\", \"MT101\"]);\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainMonsterCount!==0)",
                "true": [
                    "共有${flag:remainMonsterCount}只怪物未清除。",
                    "剩余enemy:${flag:remainMonsterInfo}"
                ],
                "false": [
                    "怪物已清完！继续前进吧！",
                    "\t[系统提示]继续前进将无法再返回此区域，请及时清理地上的资源。",
                    {
                        "type": "hide",
                        "time": 0
                    }
                ]
            }
        ],
        "6,5": [
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": "hero"
            },
            {
                "type": "playSound",
                "name": "Wind01.ogg"
            },
            {
                "type": "animate",
                "name": "fast",
                "loc": "hero",
                "async": true
            },
            {
                "type": "moveHero",
                "time": 50,
                "steps": [
                    "down",
                    "down",
                    "down",
                    "left"
                ]
            },
            {
                "type": "changePos",
                "direction": "right"
            },
            "\t[小粽,hero]\b[hero]（他们好像没发现我，那么正好.....！）",
            "\t[蓝焱剑神,E662]\b[this,7,4]哎呀，不打了，不打了，每次都是老大赢。",
            "\t[光焱剑神,E661]\b[this,6,3]那玩什么,我今天只带了牌。",
            "\t[蓝焱剑神,E662]\b[this,7,4]额......说的也是呀。",
            "\t[红焱剑神,E640]\b[this,5,4]老大，不久之前堇大人好像说有人类的勇者闯入这座高塔了呢，真的假的？",
            "\t[蓝焱剑神,E662]\b[this,7,4]怎么可能，我记得上次人类闯入这座高塔的时候，都是半年前的事了。",
            "\t[蓝焱剑神,E662]\b[this,7,4]而且就算最近真的有人类闯入了这座高塔，估计早就死在安兹乌洛斯那个弟弟手中了，怎么可能打到我们这里。",
            "\t[蓝焱剑神,E662]\b[this,7,4]我看是堇大人看我们太怠惰了，给我们的催促罢了。",
            "\t[光焱剑神,E661]\b[this,6,3]不管是真是假，我们也应该继续修炼了。",
            "\t[红焱剑神,E640]\b[this,5,4]好！那小弟我先行告退了。",
            {
                "type": "playSound",
                "name": "Wind01.ogg"
            },
            {
                "type": "animate",
                "name": "fast",
                "loc": "hero",
                "async": true
            },
            {
                "type": "moveHero",
                "time": 50,
                "steps": [
                    "right",
                    "up",
                    "up",
                    "up"
                ]
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    5,
                    4
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    6,
                    3
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "cgefc01.wav"
            },
            {
                "type": "animate",
                "name": "unexpected1",
                "loc": [
                    7,
                    4
                ],
                "async": true
            },
            "\t[小粽,hero]\b[hero]万灭瞬杀！",
            {
                "type": "animate",
                "name": "attack8",
                "loc": [
                    6,
                    3
                ],
                "async": true
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "battle",
                "id": "E662"
            },
            {
                "type": "battle",
                "id": "E640"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        4
                    ]
                ],
                "time": 500
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        4
                    ]
                ],
                "time": 500
            },
            "\t[光焱剑神,E661]\b[this,6,3]二弟！三弟！！",
            "\t[小粽,hero]\b[hero]就剩你一位剑神了。",
            "\t[光焱剑神,E661]\b[this,6,3]你.....你这混蛋！！！",
            "\t[光焱剑神,E661]\b[this,6,3]给我去死吧！",
            "\t[小粽,hero]\b[hero]审判之剑！",
            {
                "type": "playSound",
                "name": "skill01.ogg"
            },
            {
                "type": "animate",
                "name": "attack7",
                "loc": [
                    6,
                    3
                ]
            },
            {
                "type": "sleep",
                "time": 50
            },
            {
                "type": "battle",
                "id": "E661"
            },
            "\t[光焱剑神,E661]\b[this,6,3]咳咳咳！！怎么可能！人类怎么可能如此强大！！",
            "\t[光焱剑神,E661]\b[this,6,3]这不可能！！！",
            "\t[小粽,hero]\b[hero]呼.....呼！不是我实力对于你们来说有多强,只是你们太大意了！",
            "\t[光焱剑神,E661]\b[this,6,3]你.....你！",
            "\t[小粽,hero]\b[hero]恨血饮天！",
            {
                "type": "animate",
                "name": "attack9",
                "loc": [
                    6,
                    3
                ],
                "async": true
            },
            {
                "type": "playSound",
                "name": "Attack09.wav"
            },
            {
                "type": "screenFlash",
                "color": [
                    255,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "times": 1
            },
            {
                "type": "sleep",
                "time": 200
            },
            {
                "type": "playSound",
                "name": "Blow4.ogg"
            },
            "\t[光焱剑神,E661]\b[this,6,3]不！！！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        3
                    ]
                ],
                "time": 500
            },
            "\t[小粽,hero]\b[hero]........结束了。",
            "\t[小粽,hero]\b[hero]接下来就是真正的一战了！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        1
                    ]
                ],
                "floorId": "MT95",
                "time": 500
            },
            {
                "type": "hide",
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT78",
            "loc": [
                6,
                0
            ],
            "time": 0
        },
        "0,7": {
            "floorId": "MT80",
            "loc": [
                12,
                7
            ],
            "time": 0
        },
        "12,7": {
            "floorId": "MT96",
            "loc": [
                0,
                7
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {
        "3,5": [
            "up"
        ],
        "2,5": [
            "up"
        ],
        "4,5": [
            "up"
        ],
        "5,5": [
            "up"
        ],
        "7,5": [
            "up"
        ],
        "8,5": [
            "up"
        ],
        "9,5": [
            "up"
        ],
        "10,5": [
            "up"
        ],
        "1,4": [
            "right"
        ],
        "1,3": [
            "right"
        ],
        "1,2": [
            "right"
        ],
        "1,1": [
            "right"
        ],
        "1,0": [
            "right"
        ],
        "11,4": [
            "left"
        ],
        "11,3": [
            "left"
        ],
        "11,2": [
            "left"
        ],
        "11,1": [
            "left"
        ],
        "11,0": [
            "left"
        ]
    },
    "map": [
    [  0,  0,140010,130014,130015,130011,130012,130013,130014,130015,140010,  0,  0],
    [  0,  0,140010,130022,130023,130019,130020,130021,130022,130023,140010,  0,  0],
    [  0,150176,150177,130030,130031,130027,130028,130029,130030,130031,150180,  0,  0],
    [  0,150184,150185,130038,130039,664,661,664,130038,130039,150188,150189,  0],
    [  0,  0,150193,664,401,640,140010,662,401,664,150196,  0,  0],
    [  0,  0,140010,140010,140010,140010,140010,140010,140010,140010,140010,  0,  0],
    [148,148,148,148,148,148,670,148,148,148,148,148,148],
    [ 92,148,148,148,148,148,124,148,148,148,148,148, 94],
    [  0,  0,  0,  0,  0,  0, 22,  0,  0,  0,  0,  0,  0],
    [148,148,148,148,148,148, 21,148,148,148,148,148,148],
    [148,401,402,402,402, 24, 21, 24,430,430,430,664,148],
    [148,148,148,148,148,148, 21,148,148,148,148,148,148],
    [148,148,148,148,148,148, 93,148,148,148,148,148,148]
],
    "bgmap": [
    [148,148,140010,140010,140010,130048,130049,130050,140010,140010,140010,148,148],
    [148,148,140010,140010,140010,130056,130057,130058,140010,140010,140010,148,148],
    [148,148,140010,140010,140010,130064,130065,130066,140010,140010,140010,148,148],
    [148,148,140010,140010,140010,130072,130073,130074,140010,140010,140010,148,148],
    [148,148,140010,140010,140010,140010,140010,140010,140010,140010,140010,148,148],
    [148,148,  0,  0,  0,  0,140010,  0,  0,  0,  0,148,148],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0,  0, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17, 17],
    [ 17, 17,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17, 17],
    [ 17, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17, 17],
    [  0, 17, 17, 17, 17, 17,  0, 17, 17, 17, 17, 17,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}