main.floors.MT85=
{
    "floorId": "MT85",
    "title": "登天之巅（左六）",
    "name": "登天之巅（左六）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,12": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[仙琳,fairy]\b[this,7,12]我可以提升你的商店等级，让商店里相同金钱出售的能力*2.5，购买价格到5500时来找我吧。",
                {
                    "type": "choices",
                    "text": "\t[仙琳,fairy]是否加倍？",
                    "choices": [
                        {
                            "text": "加倍！",
                            "action": [
                                {
                                    "type": "if",
                                    "condition": "(flag:shop_times>=273)",
                                    "true": [
                                        {
                                            "type": "disableShop",
                                            "id": "71Fshop"
                                        },
                                        "\t[仙琳,fairy]\b[this,7,12]搞定，顺便为了方便你购买，基础价格和购买效果也翻了一倍。",
                                        {
                                            "type": "hide",
                                            "time": 500
                                        },
                                        {
                                            "type": "openShop",
                                            "id": "85Fshop"
                                        }
                                    ],
                                    "false": [
                                        "\t[仙琳,fairy]\b[this,7,12]不够不够。",
                                        {
                                            "type": "exit"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "text": "暂时不用",
                            "action": [
                                "\t[仙琳,fairy]\b[this,7,12]那好吧。"
                            ]
                        }
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT84",
            "loc": [
                6,
                0
            ],
            "time": 0
        },
        "6,0": {
            "floorId": "MT86",
            "loc": [
                6,
                12
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [140006,338,354,370,354, 81, 91,140006,140006,140006,140006,140006,140006],
    [140006,627,140006,140006,140006,140006, 82,355,140006,351,635,367,140006],
    [140006, 33,140006,351,367,140006,  0,649,399,140006, 81,140006,430],
    [383,652,140006,335,140006,334,658,140006,664,140006, 30,140006,350],
    [140006,367, 81,648,140006,140006,  0,366,140006,  0, 33,  0,652],
    [140006,  0,140006,399,140006,350,  0,140006,140006,642,  0,642,  0],
    [350,660,335,140006,402,140006,468, 33,140006,140006,  0,140006,140006],
    [  0,140006,140006, 28, 82,140006,  0,140006,  0, 81,383,140006,412],
    [ 21,140006, 22,635,  0,  0, 21,  0,  0,631,  0, 81, 21],
    [658,  0,334,140006,140006,140006, 81,140006,140006,140006,140006, 81,140006],
    [140006, 81,140006,140006,402,140006, 23,140006,402,140006,335,660,351],
    [ 21,655, 21,140006, 82,  0,399,  0, 82,140006, 33,140006,140006],
    [ 21,337, 21,140006,  0,  0, 93,124,  0,140006,631,384,399]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}