main.floors.MT89=
{
    "floorId": "MT89",
    "title": "登天之巅（左十）",
    "name": "登天之巅（左十）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[小粽,hero]\b[hero]啊这.....严重怀疑作者有水层嫌疑！",
        "\t[小粽,hero]\b[hero]等等，作者是谁？水层是什么？为什么我要说这些名词？......",
        "\t[小粽,hero]\b[hero]等等，前面好像有人。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,3": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                {
                    "type": "changePos",
                    "direction": "up"
                },
                "\t[小粽,hero]\b[hero]请问你是......",
                "\t[???,E665]\b[this,8,2]..................",
                {
                    "type": "playSound",
                    "name": "jump.mp3"
                },
                {
                    "type": "animate",
                    "name": "unknown",
                    "loc": "hero"
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[小粽,hero]\b[hero]嗯？你......",
                "\t[???,E665]\b[this,8,2]你终于来了。",
                "\t[小粽,hero]\b[hero]你.....一直在这里等我？",
                "\t[小粽,hero]\b[hero]还有，我好像并不认识你。",
                "\t[???,E665]\b[this,8,2].........是吗？或许并不是所有人都知道我的存在呢.......",
                "\t[小粽,hero]\b[hero]什么意思？",
                "\t[???,E665]\b[this,8,2]算了，不管你是不是认识我，我在这里只是受那个人的嘱托而已，而我需要你帮我传达一个消息给某个人。",
                "\t[小粽,hero]\b[hero]（奇怪的人.....不知道她在碎碎念些什么。）",
                "\t[小粽,hero]\b[hero]..........什么消息？",
                "\t[???,E665]\b[this,8,2]跟他说：斯莉英雄传要更新了,我还等着去道宗境呢。",
                "\t[小粽,hero]\b[hero]（斯莉英雄传是什么？还有道宗境是什么区域？？）",
                "\t[小粽,hero]\b[hero]等等，你让我把这个消息传达给谁？他叫什么名字。",
                "\t[???,E665]\b[this,8,2]他的名字吗.....",
                "\t[???,E665]\b[this,8,2]是......。",
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            2
                        ]
                    ],
                    "time": 500
                },
                "\t[小粽,hero]\b[hero]等等！人怎么消失了？？",
                "\t[小粽,hero]\b[hero]感觉这座高塔越来越诡异了.....。",
                {
                    "type": "hide",
                    "time": 500
                }
            ]
        },
        "8,1": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[小粽,hero]\b[hero]别看了，就是装饰用的水晶。"
            ]
        }
    },
    "changeFloor": {
        "7,12": {
            "floorId": "MT87",
            "loc": [
                7,
                0
            ],
            "time": 0
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [140006, 33,140006,140006,140006,140006,140006,140006,101,140006,140006,140006,140006],
    [140006, 33,140006,140006,402,140006,140006,140006,102,140006,140006,140006,400],
    [140006,400,140006,140006, 81,140006,140006,140006,665,140006,140006,140006, 81],
    [140006,402,140006,140006,400,140006,  0,  0,  0,  0,  0,140006, 22],
    [140006, 82,140006,140006, 81,140006,  0,  0,  0,  0,  0,140006, 81],
    [140006, 33,140006,140006,400,140006,  0,  0,399,  0,  0, 81, 81],
    [140006,400,140006,140006, 81,140006,  0,399,387,399,  0,140006,140006],
    [140006,402,140006,140006,399,140006,  0,  0, 21,140006,140006,140006,400],
    [140006, 82,140006,140006, 81,140006,  0,  0,  0,140006, 33, 82,402],
    [140006,400,402, 82,399,140006,  0,  0,  0, 81,399,140006, 81],
    [140006,140006,140006,140006, 81,  0,  0,  0,  0,140006, 33, 81, 81],
    [140006,140006,140006,140006,140006, 83,140006,  0,140006,140006, 83,140006,140006],
    [402,402,402,402,402,402,140006, 93,140006,401,401,401,140006]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}