main.floors.MT98=
{
    "floorId": "MT98",
    "title": "登天之巅（右三）",
    "name": "登天之巅（右三）",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "sky2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "item_ratio": 100,
    "defaultGround": "ground",
    "bgm": "battle4.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,6": [
            {
                "type": "closeDoor",
                "id": "specialDoor",
                "loc": [
                    9,
                    5
                ]
            },
            {
                "type": "hide",
                "time": 0
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT97",
            "loc": [
                6,
                0
            ],
            "time": 0
        },
        "0,8": {
            "floorId": "MT99",
            "loc": [
                12,
                8
            ],
            "time": 0
        },
        "0,5": {
            "floorId": "MT99",
            "loc": [
                12,
                5
            ],
            "time": 0
        }
    },
    "afterBattle": {
        "8,6": [
            {
                "type": "addValue",
                "name": "flag:door_MT98_9_5",
                "value": "1"
            }
        ],
        "10,6": [
            {
                "type": "addValue",
                "name": "flag:door_MT98_9_5",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "9,5": {
            "0": {
                "condition": "flag:door_MT98_9_5==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "map": [
    [140006, 21, 22,140006,351,140006,383,140006,140006,140006,140006,140006,140006],
    [140006,652, 21,140006,367,140006,  0, 33,  0,656, 21,399,140006],
    [140006, 81,140006, 22,611,140006,  0, 81,140006,385,140006,654,386],
    [140006, 34,140006,140006,399,140006,617,  0,  0,140006,140006,383,140006],
    [140006, 30,140006, 33,367, 81, 33,351,641, 22, 81,617,140006],
    [ 92,657, 34,351,653, 21,  0,140006,140006,  0,140006,140006, 23],
    [140006,140006,140006,140006, 81, 33,140006,140006,650,  0,650,140006, 82],
    [140006,383,140006,  0,  0,660,385,140006,354,354,354,140006, 82],
    [ 92,651,  0,351,140006,  0,140006,140006,140006, 83,140006,140006, 82],
    [140006,140006, 21, 33,657, 21,  0,140006,  0,335,  0, 82, 82],
    [ 33, 81,  0,367,140006,  0, 33,  0,617,  0,  0,140006, 82],
    [ 33,140006,653,140006,140006, 28,647, 28,140006, 81,612,140006,402],
    [140006,351,367,335,140006,140006, 93,140006,367,335,351, 33,140006]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

]
}